package com.blindreader;

import android.util.Log;

import java.util.Arrays;
import java.util.stream.IntStream;

public class Text {
    private static final String TAG = "order";
    public String[][] title = {{"人类：一种也没什么特别的动物","知善恶树","亚当和夏娃的一天","毁天灭地的人类洪水"},
            {"史上最大骗局","盖起金字塔","记忆过载","历史从无正义"},
            {"历史的方向","金钱的味道","帝国的愿景","宗教的法则","成功的秘密"},
            {"发现自己的无知","科学与帝国的联姻","资本主义教条","工业的巨轮","一场永远的革命","从此过着幸福快乐的日子","智人末日"}
    };
    public String[] chap_title = {"认知革命","农业革命","人类的融合统一","科学革命"};
    public String[][] rawtext = {{"测试","测试","测试","测试"},{"人类曾有长达250万年的时间靠采集及狩猎维生，并不会特别干预动植物的生长情形。" +
            "直立人、匠人或是尼安德特人都会采集野无花果、猎捕野绵羊，但不会去管究竟无花果树该长在哪，羊该在哪片草地吃草，又或是哪只公羊该跟母羊交配。" +
            "虽然智人从东非来到中东、欧洲、亚洲，最后到了澳大利亚和美洲，但不管他们到了什么地方，仍然就是靠野生的动植物维生。" +
            "毕竟，如果现在的生活方式就吃得饱，社会结构、宗教信仰、政治情况也都稳定多元，何必自找麻烦改来改去？" +
            "这一切在大约1万年前全然改观，人类开始投入几乎全部的心力，操纵着几种动植物的生命。" +
            "从日升到日落，人类忙着播种、浇水、除草、牧羊，一心以为这样就能得到更多的水果、谷物和肉类。" +
            "这是一场关于人类生活方式的革命：农业革命。" +
            "从采集走向农业的转变，始于大约公元前9500年至公元前8500年，发源于土耳其东南部、伊朗西部和地中海东部的丘陵地带。" +
            "这场改变一开始速度缓慢，地区也有限。" +
            "小麦与山羊驯化成为农作物和家畜的时间大约是在公元前9000年，豌豆和小扁豆约在公元前8000年，橄榄树在公元前5000年，马在公元前4000年，葡萄则是在公元前3500年。" +
            "至于骆驼和腰果等其他动植物驯化的时间还要更晚，但不论如何，到了公元前3500年，主要一波驯化的热潮已经结束。" +
            "即使到了今天，虽然人类有着种种先进科技，但食物热量超过90%的来源仍然是来自人类祖先在公元前9500年到公元前3500年间驯化的植物：小麦、稻米、玉米、马铃薯、小米和大麦。" +
            "在过去2000年间，人类并没有驯化什么特别值得一提的动植物。" +
            "可以说，人到现代还有着远古狩猎采集者的心，以及远古农民的胃。" +
            "学者曾经以为农业就是起源于中东，再传布到全球各地，但现在则认为农业是同时间在各地独自发展而开花结果，而不是由中东的农民传到世界各地。" +
            "中美洲人驯化了玉米和豆类，但不知道中东人种了小麦和豌豆。" +
            "南美人学会如何栽培马铃薯和驯养骆马，但也不知道在墨西哥或地中海东部又发生了什么事。" +
            "中国最早驯化的是稻米、小米和猪。" +
            "北美最早的农夫，也是因为懒得再在树丛里四处寻找南瓜，决定干脆自己种。" +
            "新几内亚驯化了甘蔗和香蕉，西非农民也驯化了小米、非洲稻、高粱和小麦。" +
            "就从这些最早的出发点，农业开始往四方远播。" +
            "到了公元1世纪，全球大多数地区的绝大多数人口都从事农业。" +
            "为什么农业革命发生在中东、中国和中美洲，而不是澳大利亚、阿拉斯加或南非？" +
            "原因很简单：大部分的动植物其实无法驯化。" +
            "虽然智人能挖出美味的松露、猎杀毛茸茸的长毛象，但真菌太难捉摸，巨兽又太过凶猛，于是想自己种或自己养真是难上加难。" +
            "在我们远古祖先所狩猎采集的成千上万物种中，适合农牧的只有极少数几种。" +
            "这几种物种只生长在特定的地方，而这些地方也正是农业革命的起源地。" +
            "学者曾宣称农业革命是人类的大跃进，是由人类脑力所推动的进步故事。" +
            "他们说演化让人越来越聪明，解开了大自然的秘密，于是能够驯化绵羊、种植小麦。" +
            "等到这件事发生，人类就开开心心地放弃了狩猎采集的艰苦、危险、简陋，安定下来，享受农民愉快而饱足的生活。" +
            "这个故事只是幻想。" +
            "并没有任何证据显示人类越来越聪明。" +
            "早在农业革命之前，采集者就已经对大自然的秘密了然于胸，毕竟为了活命，他们不得不非常了解自己所猎杀的动物、所采集的食物。" +
            "农业革命所带来的非但不是轻松生活的新时代，反而让农民过着比采集者更辛苦、更不满足的生活。" +
            "狩猎采集者的生活其实更为丰富多变，也比较少会碰上饥饿和疾病的威胁。" +
            "确实，农业革命让人类的食物总量增加，但量的增加并不代表吃得更好、过得更悠闲，反而只是造成人口爆炸，而且产生一群养尊处优、娇生惯养的精英分子。" +
            "普遍来说，农民的工作要比采集者更辛苦，而且到头来的饮食还要更糟。" +
            "农业革命可说是史上最大的一桩骗局。" +
            "谁该负责？" +
            "这背后的主谋，既不是国王，不是牧师，也不是商人。" +
            "真正的主要嫌疑人，就是那极少数的植物物种，其中包括小麦、稻米和马铃薯。" +
            "人类以为自己驯化了植物，但其实是植物驯化了智人。" +
            "如果我们用小麦的观点来看看农业革命这件事，在1万年前，小麦也不过就是许多野草当中的一种，只出现在中东一个很小的地区。" +
            "但就在短短1000年内，小麦突然就传遍了世界各地。" +
            "生存和繁衍正是最基本的演化标准，而根据这个标准，小麦可以说是地球史上最成功的植物。" +
            "以北美大平原为例，1万年前完全没有小麦的身影，但现在却有大片麦田波浪起伏，几百公里内完全没有其他植物。" +
            "小麦在全球总共占据大约225万平方公里的地表面积，快有英国的10倍大小。" +
            "究竟，这种野草是怎么从无足轻重变成无所不在？" +
            "小麦的秘诀就在于操纵智人、为其所用。" +
            "智人这种猿类，原本靠着狩猎和采集过着颇为舒适的生活，直到大约1万年前，才开始投入越来越多的精力来培育小麦。" +
            "而在接下来的几千年间，全球许多地方的人类都开始种起小麦，从早到晚只忙这件事就已经焦头烂额。" +
            "种小麦可不容易，照顾起来处处麻烦。" +
            "第一，小麦不喜欢大小石头，所以智人得把田地里的石头捡干净搬出去，搞得腰酸背痛。" +
            "第二，小麦不喜欢与其他植物分享空间、水和养分，所以我们看到男男女女在烈日下整天除草。" +
            "第三，小麦会得病，所以智人得帮忙驱虫防病。" +
            "第四，不论是蝗虫还是兔子，都不排斥饱尝一顿小麦大餐，但小麦完全无力抵抗，所以农民又不得不守卫保护。" +
            "最后，小麦会渴，所以人类得从涌泉或溪流大老远把水引来，为它止渴；" +
            "小麦也会饿，所以智人甚至得收集动物粪便，用来滋养小麦生长的土地。" +
            "智人的身体演化目的并不是为了从事这些活动，我们适应的活动是爬爬果树、追追瞪羚，而不是弯腰清石块、努力挑水桶。" +
            "于是，人类的脊椎、膝盖、脖子和脚底就得付出代价。" +
            "研究古代骨骼发现，人类进到农业时代后出现了大量疾病，例如椎间盘突出、关节炎和疝气。" +
            "此外，新的农业活动得花上大把时间，人类就只能被迫永久定居在麦田旁边。" +
            "这彻底改变了人类的生活方式。" +
            "其实不是我们驯化了小麦，而是小麦驯化了我们。" +
            "驯化一词来自拉丁文，意思就是房子。" +
            "但现在关在房子里的可不是小麦，而是智人。" +
            "小麦究竟做了什么，才让智人放弃了本来很不错的生活，换成另一种悲惨的生活方式？" +
            "它提供了什么报酬？" +
            "就智人的饮食来说，其实并没有更好。" +
            "别忘了，人类原本就是种杂食的猿类，吃的是各式各样的食物。" +
            "在农业革命之前，谷物不过是人类饮食的一小部分罢了。" +
            "而且，以谷物为主的食物不仅矿物质和维生素含量不足、难以消化，还对牙齿和牙龈大大有害。" +
            "而就民生经济而言，小麦也并未带来经济安全。" +
            "比起狩猎采集者，农民的生活其实比较没保障。" +
            "采集者有几十种不同的食物能够维生，就算没有存粮，遇到荒年也不用担心饿死。" +
            "即使某物种数量减少，只要其他物种多采一点、多猎一些，就能补足所需的量。" +
            "然而，一直到最近为止，农业社会绝大多数饮食靠的还是寥寥无几的少数几种农业作物，很多地区甚至只有一种主食，例如小麦、马铃薯或稻米。" +
            "所以，如果缺水、来了蝗灾又或是爆发真菌感染，贫农死亡人数甚至有可能达到百万。" +
            "再就人类暴力而言，小麦也没办法提供人身安全。" +
            "农业时代早期的农民，性格并不见得比过去的采集者温和，甚至还可能更暴力。" +
            "毕竟现在他们的个人财产变多，而且还需要土地才能耕作。" +
            "如果被附近的人抢了土地，就可能从温饱的天堂掉进饥饿的地狱，所以在土地这件事上几乎没有妥协的余地。" +
            "过去，如果采集者的部落遇到比较强的对手，只要撤退搬家就能解决。" +
            "虽然说有些困难和危险，但至少是个可行的选项。" +
            "但如果是农民遇到了强敌，撤退就代表着得放弃田地、房屋和存粮。" +
            "很多时候这几乎就注定了饿死一途。" +
            "因此，农民常常得死守田地，双方拼个你死我活。" +
            "许多人类学和考古研究显示，在只有基本的村庄和部落政治结构的农业社会中，人类暴力行为造成15%的总死亡数，而在男性之间则是25%。" +
            "现在的新几内亚还有达尼和恩加两个农业部落社会，暴力造成男性死亡所占百分率分别是30%和35%。" +
            "而在厄瓜多尔的瓦拉尼人，成年人甚至约有50%会死在另一个人的暴力行为之下！" +
            "慢慢地，人类发展出进阶的社会结构，如城市、王国、国家，于是人类的暴力也得到了控制。" +
            "不过，这样庞大而有效的政治结构可是足足花了数千年，才终于建立起来。" +
            "当然，农村生活确实为第一代农民带来了一些直接的利益，像是比较不需要担心野兽袭击、风吹雨淋，但对一般人来说，可能其实弊大于利。" +
            "现代社会繁荣富庶，可能我们很难理解弊处何在，毕竟这一切的富裕和安全都是建立在农业革命之上，所以我们也就觉得农业革命真是个美妙的进步。" +
            "然而，我们不能光用今天的观点来看这几千年的历史。" +
            "一个更具代表性的观点，可能是1世纪汉代某个女孩因为家里的农作物歉收而饿死。" +
            "她会不会说：虽然我饿死了，但我知道在两千多年后，人类能够吃喝不尽，住在有空调的豪宅里，所以我的牺牲也都值得了？" +
            "对于那个营养不良的汉代女孩或是所有农民来说，小麦究竟给了他们什么？" +
            "对于个人来说，小麦根本算不上给了什么。" +
            "但对于智人这个物种整体来说，小麦的影响就十分深远。" +
            "种植小麦，每单位土地就能提供更多食物，于是智人的数量也呈指数成长。" +
            "大约在公元前13000年，人类还靠采集和狩猎维生的时候，巴勒斯坦的杰里科绿洲一带，大概可以养活一个有百名成员的采集部落，而且人们相对健康、营养充足。" +
            "到了大约公元前8500年，野生植物的荒野成了片片麦田，这片绿洲这时养活了约有千人的农村，但人口密度也因此增大，而且成员染病及营养不良的情形要比过去严重太多。" +
            "如果要衡量某种物种演化成功与否，评断标准就在于世界上其DNA螺旋的拷贝数的多寡。" +
            "这很类似于货币的概念，就像今天如果要说某家公司行不行，我们看的是它的市值有多少钱，而不是它的员工开不开心；" +
            "物种的演化成功，看的就是这个物种DNA拷贝数在世界上的多寡。" +
            "如果世界上不再有某物种的DNA拷贝，就代表该物种已经绝种，也等于公司没有钱而宣告倒闭。" +
            "而如果某个物种还有许多个体带着它的DNA拷贝存在这个世上，就代表着这个物种演化成功、欣欣向荣。" +
            "从这种角度看来，1000份DNA拷贝永远都强过100份。" +
            "这正是农业革命真正的本质：让更多的人却以更糟的状况活下去。" +
            "但是，身为个人，为什么要管这种演化问题？" +
            "如果有人说，为了增加智人基因组在世界上的拷贝数，希望你降低自己的生活水平，你会同意吗？" +
            "没有人会同意这笔交易。" +
            "简单说来，农业革命就是一个陷阱。","测试","测试","测试"},
            {"测试","测试","测试","测试","测试"},
            {"假设有个西班牙农民，在公元1000年沉沉睡去，等到他醒来的时候已经过了500年，虽然这时哥伦布的水手已经登上新大陆，但他看看四周的世界，还是会感到十分熟悉。" +
            "这时的科技、礼仪和国界都有许多不同，但这位做了个长梦的中世纪农民仍然能有家的感觉。" +
            "然而，如果是某位哥伦布的水手做了这场梦，醒来的时候听到的是21世纪的iPhone铃声，他会发现自己处在一个完全陌生、无法理解的世界。" +
            "他很可能会问自己：这是天堂吗？" +
            "还是地狱？" +
            "在过去500年间，人类的力量有了前所未有的惊人成长。" +
            "公元1500年时，全球智人的人口大约有5亿，但今天已经到了70亿。" +
            "人类在1500年生产的商品和服务总共约合现值2500亿美元，但今天每年人类生产的价值约为60万亿美元。" +
            "在1500年，全人类每天总共约消耗13万亿卡路里，但今天每天要消耗1500万亿卡路里。" +
            "看看这些数字，人口增加了14倍，生产增加240倍，消耗的能量增加了115倍。" +
            "假设有一艘现代战舰回到了哥伦布的时代，只要几秒就能摧毁整个哥伦布的船队，更能轻松击沉当时所有世界强权的海军，自己连个刮痕都不会有。" +
            "只要有五条现代的货柜船，就能承载当时全世界所有船队所运的货物。" +
            "只要有一台现代计算机，就能储存中世纪所有图书馆里全数抄本和卷轴的信息，而且还剩下许多空间。" +
            "就算把所有前现代王国的财产数量全部相加，也比不上现在世界上任何一家大型银行。" +
            "在公元1500年，有几个城市人口已经超过10万，多数建材使用泥土、木材和稻草；" +
            "只要有三层楼的建筑，就已经算是座摩天大楼。" +
            "街道是有车辙的泥土路，夏天尘土飞扬，冬天泥泞不堪，街上满满的是行人、马匹、羊、鸡，以及少数的运货马车。" +
            "城市里最常听到的噪音是人声和动物声，偶尔还会听到锤子和锯子的声音。" +
            "日落时分，城市景观是一片黑，只有偶尔能见到的几点烛光，或是火把闪烁。" +
            "如果这种城市的居民看到了现在的台北、纽约或孟买，他会怎么想？" +
            "在16世纪前，从没有人绕地球航行一周。" +
            "一直要到1522年，麦哲伦的船队历经72000公里的旅程，终于回到西班牙，完成了环球壮举。" +
            "这趟旅程耗时3年，几乎所有探险队员都在途中丧生，麦哲伦也是其中一员。" +
            "而到了1873年，在科幻小说家凡尔纳的想象中，富有的英国探险家福格已经可以只花80天就环游世界一周。" +
            "而到了今天，只要有中产阶级的收入，任何人都能够在48小时内轻松又安全地完成环球大业。" +
            "在公元1500年，人类还被局限在地面上。" +
            "虽然可以盖起高塔、爬上高山，但天空仍然是专属于飞鸟、天使和神的领域。" +
            "而到了1969年7月20日，人类登陆月球。" +
            "这不只是一项历史成就，更是一项演化上甚至是宇宙间的壮举。" +
            "在过去40亿年演化期间，没有任何生物能够离开地球大气层，更不用谈要在月球上留下手印或足迹。" +
            "在地球上，微生物占了全部有机体大约99.99%，但人类要到非常晚近，才对微生物有所认识。" +
            "这并不是因为微生物与我们无关，相反的是，我们每个人身上都有数十亿个单细胞生物，而且还不只是搭搭便车的关系。" +
            "微生物可以说是我们最好的朋友，也是最致命的敌人。" +
            "有些微生物可以帮助消化、健胃整肠，而有些则会导致疾病、造成感染。" +
            "一直要到1674年，才有人第一次真正看见了微生物。" +
            "当时安东·冯·列文虎克自制了一台显微镜，用来观察一滴水，他看到里面有许多小生物动个不停，这让他大吃一惊。" +
            "在随后的300年间，人类才开始认识了许许多多的微生物物种。" +
            "时至今日，我们已经能够治疗大多数由微生物造成的致命传染病，也能够将微生物用于医疗和产业用途。" +
            "像是我们可以用细菌来制造药物、生物燃料，或是杀死寄生虫。" +
            "然而，如果要在过去500年间挑出一个最重大、具代表性的一刻，一定就是1945年7月16日上午5点29分45秒。" +
            "就在这一秒，美国科学家在新墨西哥的阿拉莫戈多引爆了第一颗原子弹。" +
            "从这时开始，人类不仅有了改变历史进程的能力，更有了结束历史进程的能力。" +
            "将人类带到阿拉莫戈多、带上月球的这段历史进程，称为科学革命。" +
            "在这场革命中，人类因为将资源投入科学研究，取得了巨大的新力量。" +
            "之所以说这是一场革命，是因为一直到大约公元1500年前，全球人类还不相信自己能在医疗、军事和经济方面再有什么突破。" +
            "政府和富有的赞助者虽然也会将资金投入教育和作为奖学金，但一般来说只是为了维持现有能力，而不是取得新的能力。" +
            "典型的前现代统治者会赞助牧师、哲学家和诗人，目的是请他们让他的统治合法化，并且维护社会秩序，而不是要他们发明新的药物、武器，或是刺激经济成长。" +
            "但在过去的500年中，人类越来越相信可以靠着投资科学研究提升人类的能力。" +
            "而且这不只是盲目的信仰，而是经过了反复的证明。" +
            "随着证据越来越多，手中握有资源的富人和政府也就越来越愿意投入科学。" +
            "如果没有这些投资，人类永远不可能在月球上漫步，不可能操纵微生物，更不可能分裂原子。" +
            "以美国政府为例，最近数十年投入数十亿美元从事核物理研究。" +
            "靠着相关研究，美国得以兴建核发电厂，为美国产业提供廉价的电力，而产业又能纳税给美国政府，政府再拨其中部分继续研究核物理。" +
            "为什么现代人越来越相信自己能够靠着研究取得新的能力？" +
            "又是什么促成了科学、政治和经济的结合？" +
            "本章先着重在现代科学的独特性，以提供部分解答。" +
            "接下来的两章会再探讨科学、欧洲帝国、资本主义经济三者之间如何形成联盟。" +
            "小标题：不知为不知。" +
            "至少在认知革命之后，人类就很希望能了解这个世界。" +
            "我们的祖先投入大量时间和精力，希望能找出支配自然界的法则。" +
            "然而，现代科学与先前的知识体系有三大不同之处：1，愿意承认自己的无知。" +
            "现代科学的基础就是承认无知。" +
            "从这种立场，我们承认了自己并非无所不知。" +
            "更重要的是，我们也愿意在知识进展之后，承认过去相信的可能是错的。" +
            "于是，再也没有什么概念、想法或理论是神圣不可挑战的。" +
            "2，以观察和数学为中心。" +
            "承认无知之后，现代科学还希望能获得新知。" +
            "方式则是通过收集各种观察值，再用数学工具整理连接，形成全面的理论。" +
            "3，取得新能力。" +
            "光是创造理论，对现代科学来说还不够。" +
            "它希望能够运用这些理论来取得新的能力，特别是发展出新的科技。" +
            "科学革命并不是知识的革命，而是无知的革命。" +
            "真正让科学革命起步的伟大发现，就是发现：人类对于最重要的问题其实毫无所知。" +
            "对于像是伊斯兰教、基督教、佛教、儒教这些前现代知识体系来说，它们假设世上所有重要的事情都已经为人或为神所知。" +
            "这些全知者可能是某些伟大的神、某个全能的神或是某些过去的智者，通过经典或口传，将这些智慧传给后人。" +
            "而对于平民百姓而言，重点就是要钻研这些古籍和传统，正确加以理解，就能获得知识。" +
            "在当时，如果说圣经、古兰经或吠陀经居然漏了某些宇宙的重大秘密，而这个秘密又居然能被一般血肉之躯的人给发现，这简直是不可思议的事。" +
            "对古老的知识体系来说，只会承认两种无知的可能。" +
            "第一种，个人可能不知道某些重要的事。" +
            "要取得必要的知识，他该做的就是去问那些更聪明的人，而不是去寻找什么还没有人知道的事。" +
            "例如，如果有一位13世纪的英格兰农夫，想知道人类究竟是怎么来的，他会认为基督教知识体系一定能有明确的答案。" +
            "所以，他该做的就是去请教当地的牧师。" +
            "第二种，整个知识体系可能不知道一些不重要的事。" +
            "就当时的定义来说，伟大的神祇或智者都懒得告诉我们的事，一定是不重要的。" +
            "例如，假设我们这位英格兰农民又想知道蜘蛛是怎么结网的，他去问牧师也没用，因为任何的基督教经典都不会提到这个问题的答案。" +
            "然而，这绝对不代表基督教有什么缺陷。" +
            "反而是代表蜘蛛怎么结网这件事根本不重要，人类无须知道。" +
            "毕竟，上帝一定知道蜘蛛怎么结网，而如果这件事这么重要、会影响到人类的繁荣和救赎，上帝怎么可能不在圣经里面有完整的解释？" +
            "基督教并不会禁止民众研究蜘蛛。" +
            "但研究蜘蛛的学者（如果中世纪欧洲真的有人研究蜘蛛的话）就必须有心理准备，知道自己在社会就是处于边缘角色，而且不管研究结果为何，基督教永远都是对的。" +
            "所以，不管学者研究的是蜘蛛、蝴蝶，还是加拉帕戈斯雀，都只会被视为是无关痛痒的事，不会影响到社会、政治和经济的基本真理。" +
            "事实上，事情永远没那么简单。" +
            "就算是最虔诚、最保守的时代，还是会有人认为，一定有什么重要的事，是整个知识体系所不知道的，但这种人常常就会被边缘化或遭受迫害；" +
            "但也有可能，他们就会开创一个新的体系，开始宣称只有他们才知道所有该知道的事。" +
            "举例来说，穆罕默德宗教生涯的第一步，就是谴责他的阿拉伯同胞，说他们对于真正神圣的真理一无所知。" +
            "穆罕默德很快就宣称只有自己知道全部的真相，而信众也开始称呼他为先知的封印（意为所有先知到此为终结）。" +
            "于是，所有的启示当然也就是到了穆罕默德为止，再也没什么重要的了。" +
            "现代科学是一套独特的知识体系，独特之处也就在于公开承认这整套体系都对一些最重要的问题一无所知。" +
            "达尔文从来没有说过自己是生物学家的封印，说自己已经完全解开了生命的谜团。" +
            "经过几个世纪的大规模科学研究，生物学家承认，他们还是无法完整解释为什么大脑能够产生意识。" +
            "物理学家也承认，他们不知道什么引起了宇宙大爆炸，也不知道如何让量子力学与广义相对论结合起来。" +
            "也有些时候，因为不断有新证据出现，各种科学理论也就互相交锋、战火热烈。" +
            "一个典型的例子，就是究竟哪种经济模式最好。" +
            "虽然每个经济学家都可能会说自己的模式最恰当，但每次出现金融危机和股市泡沫，我们就会看到主流改变；" +
            "目前一般公认，我们还是不知道最佳的经济模式究竟为何。" +
            "还有些时候，因为现有的证据强力支持某些理论形成主流，于是其他理论就被冷落。" +
            "虽然我们一般认定主流理论为真，但每个人也都同意，如果新证据出现而与主流理论相违背，主流理论也就需要修正甚至是淘汰。" +
            "像是板块构造理论和演化论就属于这种例子。" +
            "现代科学愿意承认自己的无知，就让它比所有先前的知识体系更具活力、更有弹性，也更有求知欲。" +
            "这一点大幅提升了人类理解世界如何运作的能力，以及创造新科技的能力。" +
            "然而，这也给人类带来祖先多半无须面对的一个严重问题。" +
            "就现在这个体系而言，我们假设自己并非无所不知，现有的知识也并未定案，但这也同样适用于那些让数百万人得以有效合作的虚构故事。" +
            "如果证据显示许多这些故事都大有问题，社会岂不是要崩溃了？" +
            "要怎样才能让社会、国家和国际体系继续维持运作？" +
            "正因如此，现代想要维持社会政治秩序稳定，只能靠着两种不科学的方法，其他别无选择。" +
            "1，虽然采用科学理论，但必须违反一般科学做法：宣称这就是绝对的真理。" +
            "纳粹就是采用这种方式，声称他们的种族政策是来自生物事实的推论。" +
            "2，不要采取科学方法，而诉诸非科学的绝对真理。" +
            "这一直是自由人文主义的策略。" +
            "自由人文主义的基础在于坚持主张人类的特殊价值和权利，但很尴尬的是，对智人的科学研究并不认同这种看法。" +
            "但我们也不该太过惊讶。" +
            "毕竟，科学还是得倚靠着种种宗教和意识形态信仰，才能取得经费，并将研究正当化。" +
            "不论如何，现代文化已经比过去任何文化都更愿意承认自己的无知。" +
            "而现代社会之所以还能够维系，原因之一就在于对科技和科学研究方法的信任，这几乎成了类似宗教的信仰，甚至在一定程度上也取代了对绝对真理的信念。",
            "测试","测试","测试","测试","测试","测试"}};
    /*public String rawtext = "理想国涉及柏拉图思想体系的各个方面，包括哲学、伦理、教育、文艺、政治等内容，主要是探讨理想国家的问题。" +
            "理想国一书是柏拉图的一篇重要对话录，对话录里柏拉图以苏格拉底之口通过与其他人对话的方式设计了一个真、善、美相统一的政体，即可以达到公正的理想国。" +
            "柏拉图的理想国是人类历史上最早的乌托邦。" +
            "在他的理想国里统治者必须是哲学家，他认为现存的政治都是坏的，人类的真正出路在于哲学家掌握政权，也只有真正的哲学家才能拯救当时城邦所处的危机。" +
            "这种信念构成了柏拉图成熟的政治哲学体系的核心。" +
            "在他的眼里“哲学家”有着特殊的内涵。" +
            "他认为哲学家是最高尚、最有学识的人，而这种贤人统治下的贤人政体就是最好的政体。" +
            "所以，只有建立以哲学家为国王的国家才是最理想的国家。" +
            "这个国家就是存在于天上的模范国家。";*/
    public String[][][] word_text = {{{"测试"},{"测试"},{"测试"},{"测试"}},{{"人类曾有","长达","250万年的","时间","靠采集","及狩猎","维生","，","并不会","特别干预","动植物的","生长情形","。",
            "直立人、","匠人","或是","尼安德特人","都会","采集","野无花果、","猎捕","野绵羊","，","但不会","去管","究竟","无花果树","该长在哪","，","羊该在","哪片草地","吃草","，","又或是","哪只公羊","该跟母羊","交配","。",
            "虽然","智人","从东非","来到","中东、","欧洲、","亚洲","，","最后到了","澳大利亚","和美洲","，","但不管","他们到了","什么地方","，","仍然就是靠","野生的","动植物","维生","。",
            "毕竟","，","如果","现在的","生活方式","就吃得饱","，","社会结构、","宗教信仰、","政治情况","也都","稳定多元","，","何必","自找麻烦","改来改去","？",
            "这一切在","大约","1万年前","全然改观","，","人类","开始投入","几乎全部的","心力","，","操纵着","几种","动植物的","生命","。",
            "从日升","到日落","，","人类忙着","播种、","浇水、","除草、","牧羊","，","一心以为","这样就能","得到更多的","水果、","谷物","和肉类","。",
            "这是一场","关于","人类生活方式的","革命","：","农业革命","。",
            "从采集","走向农业的","转变","，","始于","大约公元前","9500年","至","公元前8500年","，","发源于","土耳其东南部、","伊朗西部","和地中海东部的","丘陵地带","。",
            "这场改变","一开始","速度缓慢","，","地区也","有限","。",
            "小麦","与山羊","驯化成为","农作物和","家畜的","时间","大约是在","公元前","9000年","，","豌豆和","小扁豆","约在","公元前","8000年","，","橄榄树","在公元前","5000年","，","马","在公元前","4000","年","，","葡萄则是在","公元前","3500年","。",
            "至于","骆驼和","腰果等","其他动植物","驯化的","时间","还要更晚","，","但不论如何","，","到了","公元前","3500年","，","主要一波","驯化的","热潮","已经结束","。",
            "即使","到了今天","，","虽然","人类有着","种种","先进科技","，","但","食物热量","超过","90%的","来源","仍然是","来自","人类祖先","在公元前","9500年","到","公元前","3500年间","驯化的","植物","：","小麦、","稻米、","玉米、","马铃薯、","小米","和大麦","。",
            "在过去","2000年间","，","人类","并没有","驯化什么","特别值得一提的","动植物","。",
            "可以","，","人到现代","还有着","远古","狩猎采集者的","心","，","以及","远古农民的","胃","。",
            "学者","曾经以为","农业","就是","起源于","中东","，","再传布到","全球各地","，","但现在","则认为","农业是","同时间","在各地","独自发展","而开花结果","，","而不是","由中东的","农民","传到","世界各地","。",
            "中美洲人","驯化了","玉米和","豆类","，","但不知道","中东人","种了","小麦和","豌豆","。",
            "南美人","学会","如何栽培","马铃薯和","驯养骆马","，","但也不知道","在墨西哥","或地中海东部","又发生了","什么事","。",
            "中国","最早驯化的","是稻米、","小米和","猪","。",
            "北美","最早的","农夫","，","也是因为","懒得再","在树丛里","四处寻找","南瓜","，","决定","干脆自己种","。",
            "新几内亚","驯化了","甘蔗和","香蕉","，","西非农民","也驯化了","小米、","非洲稻、","高粱和","小麦","。",
            "就从这些","最早的","出发点","，","农业","开始往","四方远播","。",
            "到了","公元1世纪","，","全球大多数地区的","绝大多数人口","都从事农业","。",
            "为什么","农业革命","发生在","中东、","中国","和中美洲","，","而不是","澳大利亚、","阿拉斯加","或南非","？",
            "原因","很简单","：","大部分的","动植物","其实","无法驯化","。",
            "虽然","智人能","挖出","美味的","松露、","猎杀","毛茸茸的","长毛象","，","但真菌","太难捉摸","，","巨兽","又太过","凶猛","，","于是想","自己种","或","自己养","真是难上加难","。",
            "在我们","远古祖先","所狩猎采集的","成千上万物种中","，","适合","农牧的","只有","极少数几种","。",
            "这几种","物种","只生长在","特定的","地方","，","而这些地方","也正是","农业革命的","起源地","。",
            "学者","曾宣称","农业革命是","人类的","大跃进","，","是由","人类脑力","所推动的","进步故事","。",
            "他们说","演化","让人","越来越聪明","，","解开了","大自然的","秘密","，","于是能够","驯化绵羊、","种植小麦","。",
            "等到","这件事","发生","，","人类就","开开心心地","放弃了","狩猎采集的","艰苦、","危险、","简陋","，","安定下来","，","享受农民","愉快而饱足的","生活","。",
            "这个故事","只是幻想","。",
            "并没有","任何证据","显示人类","越来越聪明","。",
            "早在","农业革命","之前","，","采集者","就已经对","大自然的秘密","了然于胸","，","毕竟","为了活命","，","他们不得不","非常了解","自己所猎杀的","动物、","所采集的","食物","。",
            "农业革命","所带来的","非但不是","轻松生活的","新时代","，","反而让农民","过着比采集者","更辛苦、","更不满足的","生活","。",
            "狩猎采集者的生活","其实更为","丰富多变","，","也比较少","会碰上","饥饿和疾病的威胁","。",
            "确实","，","农业革命","让人类的","食物总量","增加","，","但量的增加","并不代表","吃得更好、","过得更悠闲","，","反而只是","造成","人口爆炸","，","而且","产生一群","养尊处优、","娇生惯养的","精英分子","。",
            "普遍来说","，","农民的工作","要比采集者","更辛苦","，","而且","到头来的饮食","还要更糟","。",
            "农业革命","可说是","史上最大的","一桩骗局","。",
            "谁该负责","？",
            "这背后的","主谋","，","既不是","国王","，","不是牧师","，","也不是","商人","。",
            "真正的","主要嫌疑人","，","就是那","极少数的","植物物种","，","其中包括","小麦、","稻米","和马铃薯","。",
            "人类以为","自己","驯化了植物","，","但其实是","植物","驯化了","智人","。",
            "如果","我们用","小麦的","观点","来看看","农业革命","这件事","，","在1万年前","，","小麦","也不过就是","许多野草当中的","一种","，","只出现在","中东一个","很小的","地区","。",
            "但就在","短短","1000年内","，","小麦","突然就","传遍了","世界各地","。",
            "生存","和繁衍","正是","最基本的","演化标准","，","而根据","这个标准","，","小麦","可以说是","地球史上","最成功的","植物","。",
            "以北美大平原","为例","，","1万年前","完全没有","小麦的","身影","，","但现在","却有","大片麦田","波浪起伏","，","几百公里内","完全没有","其他植物","。",
            "小麦","在全球","总共占据","大约","225万平方公里的","地表面积","，","快有","英国的","10倍大小","。",
            "究竟","，","这种野草","是怎么从","无足轻重","变成","无所不在","？",
            "小麦的","秘诀","就在于","操纵","智人、","为其所用","。",
            "智人","这种猿类","，","原本","靠着","狩猎","和采集","过着","颇为舒适的","生活","，","直到","大约","1万年前","，","才开始","投入","越来越多的","精力","来培育","小麦","。",
            "而在","接下来的","几千年间","，","全球","许多地方的","人类","都开始","种起小麦","，","从早到晚","只忙","这件事","就已经","焦头烂额","。",
            "种小麦","可不容易","，","照顾起来","处处麻烦","。",
            "第一","，","小麦","不喜欢","大小石头","，","所以","智人得","把田地里的","石头","捡干净","搬出去","，","搞得","腰酸背痛","。",
            "第二","，","小麦","不喜欢","与","其他植物","分享","空间、","水","和养分","，","所以","我们看到","男男女女","在烈日下","整天","除草","。",
            "第三","，","小麦","会得病","，","所以","智人","得帮忙","驱虫","防病","。",
            "第四","，","不论是","蝗虫","还是","兔子","，","都不排斥","饱尝一顿","小麦大餐","，","但小麦","完全","无力抵抗","，","所以","农民","又不得不","守卫","保护","。",
            "最后","，","小麦","会渴","，","所以","人类得","从涌泉","或溪流","大老远","把水引来","，","为它","止渴","；",
            "小麦","也会饿","，","所以","智人甚至","得收集","动物粪便","，","用来","滋养","小麦生长的","土地","。",
            "智人的","身体","演化目的","并不是","为了","从事","这些活动","，","我们","适应的","活动是","爬爬果树、","追追瞪羚","，","而不是","弯腰","清石块、","努力","挑水桶","。",
            "于是","，","人类的","脊椎、","膝盖、","脖子","和脚底","就得","付出代价","。",
            "研究","古代骨骼","发现","，","人类","进到","农业时代后","出现了","大量","疾病","，","例如","椎间盘突出、","关节炎","和疝气","。",
            "此外","，","新的","农业活动","得花上","大把时间","，","人类就只能","被迫","永久定居在","麦田旁边","。",
            "这彻底改变了","人类的","生活方式","。",
            "其实","不是","我们","驯化了","小麦","，","而是","小麦","驯化了","我们","。",
            "驯化一词","来自","拉丁文","，","意思就是","房子","。",
            "但现在","关在","房子里的","可不是","小麦","，","而是","智人","。",
            "小麦","究竟","做了","什么","，","才让智人","放弃了","本来","很不错的","生活","，","换成","另一种","悲惨的","生活方式","？",
            "它","提供了","什么报酬","？",
            "就智人的","饮食","来说","，","其实","并没有","更好","。",
            "别忘了","，","人类","原本","就是","种杂食的","猿类","，","吃的是","各式各样的","食物","。",
            "在","农业革命","之前","，","谷物","不过是","人类","饮食的","一小部分","罢了","。",
            "而且","，","以谷物","为主的","食物","不仅","矿物质","和维生素","含量不足、","难以消化","，","还对牙齿","和牙龈","大大有害","。",
            "而就","民生经济","而言","，","小麦","也并未","带来","经济","安全","。",
            "比起","狩猎采集者","，","农民的","生活","其实","比较没保障","。",
            "采集者","有几十种","不同的","食物","能够维生","，","就算","没有","存粮","，","遇到","荒年","也不用","担心饿死","。",
            "即使","某物种","数量","减少","，","只要","其他物种","多采一点、","多猎一些","，","就能","补足","所需的量","。",
            "然而","，","一直到","最近为止","，","农业社会","绝大多数","饮食","靠的还是","寥寥无几的","少数几种","农业作物","，","很多地区","甚至只有","一种主食","，","例如","小麦、","马铃薯","或稻米","。",
            "所以","，","如果","缺水、","来了蝗灾","又或是","爆发","真菌感染","，","贫农","死亡人数","甚至有可能","达到","百万","。",
            "再就","人类暴力","而言","，","小麦","也没办法","提供","人身安全","。",
            "农业时代","早期的","农民","，","性格","并不见得","比过去的","采集者","温和","，","甚至还可能","更暴力","。",
            "毕竟","现在","他们的","个人财产","变多","，","而且","还需要","土地","才能耕作","。",
            "如果","被附近的人","抢了","土地","，","就可能从","温饱的","天堂","掉进","饥饿的","地狱","，","所以在","土地","这件事上","几乎没有","妥协的","余地","。",
            "过去","，","如果","采集者的","部落","遇到","比较强的","对手","，","只要","撤退","搬家","就能解决","。",
            "虽然说","有些","困难","和危险","，","但至少是个","可行的","选项","。",
            "但如果是","农民","遇到了","强敌","，","撤退","就代表着","得放弃","田地、","房屋","和存粮","。",
            "很多时候","这几乎","就注定了","饿死一途","。",
            "因此","，","农民","常常得","死守田地","，","双方","拼个","你死我活","。",
            "许多","人类学","和考古研究","显示","，","在只有","基本的","村庄","和部落","政治结构的","农业社会中","，","人类暴力行为","造成","15%的","总死亡数","，","而在","男性之间","则是","25%","。",
            "现在的","新几内亚","还有","达尼","和恩加","两个","农业部落社会","，","暴力","造成","男性死亡","所占百分率","分别是","30%","和35%","。",
            "而在","厄瓜多尔的","瓦拉尼人","，","成年人","甚至约有","50%","会死在","另一个人的","暴力行为之下","！",
            "慢慢地","，","人类","发展出","进阶的","社会结构","，","如城市、","王国、","国家","，","于是","人类的","暴力","也得到了","控制","。",
            "不过","，","这样","庞大","而有效的","政治结构","可是","足足花了","数千年","，","才终于","建立起来","。",
            "当然","，","农村生活","确实为","第一代","农民","带来了","一些","直接的","利益","，","像是","比较不需要","担心","野兽袭击、","风吹雨淋","，","但对","一般人","来说","，","可能其实","弊大于利","。",
            "现代社会","繁荣","富庶","，","可能我们","很难理解","弊处何在","，","毕竟","这一切的","富裕","和安全","都是","建立在","农业革命","之上","，","所以","我们","也就觉得","农业革命","真是个","美妙的","进步","。",
            "然而","，","我们","不能光用","今天的","观点","来看","这几千年的","历史","。",
            "一个","更具代表性的","观点","，","可能是","1世纪","汉代","某个女孩","因为","家里的","农作物","歉收","而饿死","。",
            "她会不会","说","：","虽然","我","饿死了","，","但","我知道","在两千多年后","，","人类","能够","吃喝不尽","，","住在","有空调的","豪宅里","，","所以","我的牺牲","也都","值得了","？",
            "对于那个","营养不良的","汉代女孩","或是","所有农民","来说","，","小麦","究竟","给了他们","什么","？",
            "对于","个人来说","，","小麦","根本","算不上","给了什么","。",
            "但对于","智人","这个物种","整体来说","，","小麦的","影响","就十分深远","。",
            "种植小麦","，","每单位土地","就能提供","更多食物","，","于是","智人的","数量","也呈指数成长","。",
            "大约在","公元前13000年","，","人类","还靠","采集","和狩猎","维生的","时候","，","巴勒斯坦的","杰里科绿洲一带","，","大概可以","养活","一个有","百名成员的","采集部落","，","而且","人们","相对健康、","营养充足","。",
            "到了大约","公元前","8500年","，","野生植物的","荒野","成了","片片麦田","，","这片绿洲","这时","养活了","约有千人的","农村","，","但人口密度","也因此","增大","，","而且","成员","染病","及营养不良的","情形","要比过去","严重太多","。",
            "如果要","衡量","某种物种","演化","成功与否","，","评断标准","就在于","世界上","其DNA螺旋的","拷贝数的","多寡","。",
            "这很类似于","货币的","概念","，","就像今天","如果要说","某家公司","行不行","，","我们看的是","它的市值","有多少钱","，","而不是","它的员工","开不开心","；",
            "物种的","演化","成功","，","看的就是","这个物种","DNA拷贝数","在世界上的","多寡","。",
            "如果","世界上","不再有","某物种的","DNA拷贝","，","就代表","该物种","已经绝种","，","也等于","公司","没有钱","而宣告倒闭","。",
            "而如果","某个物种","还有","许多个体","带着它的","DNA拷贝","存在","这个世上","，","就代表着","这个物种","演化成功、","欣欣向荣","。",
            "从这种角度","看来","，","1000份","DNA拷贝","永远都","强过","100份","。",
            "这正是","农业革命","真正的","本质","：","让更多的人","却以","更糟的","状况","活下去","。",
            "但是","，","身为","个人","，","为什么","要管","这种","演化问题","？",
            "如果","有人说","，","为了","增加","智人基因组","在世界上的","拷贝数","，","希望你","降低","自己的","生活水平","，","你会","同意吗","？",
            "没有人会","同意","这笔交易","。",
            "简单说来","，","农业革命","就是","一个陷阱","。"},{"测试"},{"测试"},{"测试"}},
            {{"测试"},{"测试"},{"测试"},{"测试"},{"测试"}},
            {{"假设","有个","西班牙农民","，","在","公元","1000年","沉沉睡去","，","等到他","醒来的","时候","已经过了","500年","，","虽然","这时","哥伦布的","水手","已经登上","新大陆","，","但他","看看","四周的","世界","，","还是会","感到","十分熟悉","。",
            "这时的科技、","礼仪","和国界","都有","许多不同","，","但这位","做了个长梦的","中世纪农民","仍然能有","家的感觉","。",
            "然而","，","如果是","某位","哥伦布的","水手","做了","这场梦","，","醒来的","时候","听到的是","21世纪的","iPhone铃声","，","他会发现","自己处在一个","完全陌生、","无法理解的","世界","。",
            "他很可能","会问自己","：","这是","天堂吗","？",
            "还是","地狱","？",
            "在","过去","500年间","，","人类的","力量","有了","前所未有的","惊人成长","。",
            "公元","1500年时","，","全球智人的","人口","大约有","5亿","，","但今天","已经到了","70亿","。",
            "人类在","1500年","生产的","商品","和服务","总共约合","现值","2500亿美元","，","但今天","每年","人类生产的","价值","约为","60万亿美元","。",
            "在1500年","，","全人类每天","总共","约消耗","13万亿","卡路里","，","但今天","每天","要消耗","1500万亿","卡路里","。",
            "看看","这些数字","，","人口","增加了","14倍","，","生产","增加","240倍","，","消耗的","能量","增加了","115倍","。",
            "假设","有一艘","现代战舰","回到了","哥伦布的","时代","，","只要几秒","就能摧毁","整个","哥伦布的","船队","，","更能","轻松击沉","当时所有","世界强权的","海军","，","自己","连个","刮痕","都不会有","。",
            "只要有","五条","现代的","货柜船","，","就能承载","当时","全世界","所有船队","所运的","货物","。",
            "只要有","一台","现代计算机","，","就能储存","中世纪","所有图书馆里","全数","抄本","和卷轴的","信息","，","而且","还剩下","许多空间","。",
            "就算","把所有","前现代王国的","财产数量","全部相加","，","也比不上","现在","世界上","任何一家","大型银行","。",
            "在公元1500年","，","有几个城市","人口","已经超过","10万","，","多数建材","使用","泥土、","木材","和稻草","；",
            "只要有","三层楼的","建筑","，","就已经","算是座","摩天大楼","。",
            "街道是","有车辙的","泥土路","，","夏天","尘土飞扬","，","冬天","泥泞不堪","，","街上","满满的是","行人、","马匹、","羊、","鸡","，","以及少数的","运货马车","。",
            "城市里","最常听到的","噪音是","人声","和动物声","，","偶尔","还会听到","锤子","和锯子的","声音","。",
            "日落时分","，","城市景观是","一片黑","，","只有偶尔","能见到的","几点烛光","，","或是","火把闪烁","。",
            "如果","这种城市的","居民","看到了","现在的","台北、","纽约","或","孟买","，","他会","怎么想","？",
            "在16世纪前","，","从没有人","绕地球","航行一周","。",
            "一直要到","1522年","，","麦哲伦的","船队","历经","72000公里的","旅程","，","终于","回到","西班牙","，","完成了","环球壮举","。",
            "这趟旅程","耗时3年","，","几乎所有","探险队员","都在","途中","丧生","，","麦哲伦","也是","其中一员","。",
            "而到了","1873年","，","在科幻小说家","凡尔纳的","想象中","，","富有的","英国探险家","福格","已经可以","只花","80天","就环游世界","一周","。",
            "而到了","今天","，","只要有","中产阶级的","收入","，","任何人","都能够在","48小时内","轻松","又安全地","完成","环球大业","。",
            "在公元1500年","，","人类还被","局限在","地面上","。",
            "虽然可以","盖起","高塔、","爬上","高山","，","但天空","仍然是","专属于","飞鸟、","天使","和神的","领域","。",
            "而到了","1969年","7月","20日","，","人类","登陆","月球","。",
            "这不只是","一项","历史成就","，","更是","一项","演化上","甚至是","宇宙间的","壮举","。",
            "在过去","40亿年","演化期间","，","没有","任何生物","能够离开","地球大气层","，","更不用谈","要在","月球上","留下手印","或足迹","。",
            "在地球上","，","微生物","占了","全部有机体","大约","99.99%","，","但人类","要到","非常晚近","，","才对微生物","有所认识","。",
            "这并不是因为","微生物","与我们","无关","，","相反的是","，","我们","每个人身上","都有","数十亿个","单细胞生物","，","而且","还不只是","搭搭便车的","关系","。",
            "微生物","可以说是","我们最好的","朋友","，","也是","最致命的","敌人","。",
            "有些微生物","可以","帮助消化、","健胃整肠","，","而有些则会","导致疾病、","造成感染","。",
            "一直要到","1674年","，","才有人","第一次","真正看见了","微生物","。",
            "当时","安东·冯·列文虎克","自制了","一台显微镜","，","用来观察","一滴水","，","他看到","里面有","许多","小生物","动个不停","，","这让他","大吃一惊","。",
            "在随后的","300年间","，","人类","才开始","认识了","许许多多的","微生物物种","。",
            "时至今日","，","我们已经","能够治疗","大多数","由微生物造成的","致命传染病","，","也能够","将微生物","用于医疗","和产业用途","。",
            "像是","我们可以","用细菌","来制造药物、","生物燃料","，","或是","杀死寄生虫","。",
            "然而","，","如果要在","过去500年间","挑出","一个最重大、","具代表性的一刻","，","一定就是","1945年","7月16日","上午5点","29分45秒","。",
            "就在","这一秒","，","美国科学家","在新墨西哥的","阿拉莫戈多","引爆了","第一颗","原子弹","。",
            "从这时开始","，","人类","不仅有了","改变历史进程的","能力","，","更有了","结束历史进程的","能力","。",
            "将人类","带到","阿拉莫戈多、","带上月球的","这段","历史进程","，","称为","科学革命","。",
            "在这场","革命中","，","人类","因为","将资源","投入科学研究","，","取得了","巨大的","新力量","。",
            "之所以说","这是一场","革命","，","是因为","一直到","大约","公元1500年前","，","全球人类","还不相信","自己能在","医疗、","军事","和经济方面","再有什么","突破","。",
            "政府","和富有的赞助者","虽然也会","将资金投入","教育","和作为奖学金","，","但一般来说","只是为了","维持","现有能力","，","而不是","取得","新的能力","。",
            "典型的","前现代统治者","会赞助","牧师、","哲学家","和诗人","，","目的是","请他们","让他的统治","合法化","，","并且","维护","社会秩序","，","而不是","要他们","发明","新的药物、","武器","，","或是","刺激","经济成长","。",
            "但在","过去的","500年中","，","人类","越来越相信","可以靠着","投资","科学研究","提升","人类的","能力","。",
            "而且","这不只是","盲目的","信仰","，","而是经过了","反复的","证明","。",
            "随着","证据","越来越多","，","手中","握有资源的","富人","和政府","也就","越来越愿意","投入科学","。",
            "如果没有","这些投资","，","人类","永远不可能","在月球上","漫步","，","不可能","操纵","微生物","，","更不可能","分裂原子","。",
            "以美国政府","为例","，","最近数十年","投入","数十亿美元","从事","核物理研究","。",
            "靠着","相关研究","，","美国得以","兴建","核发电厂","，","为美国产业","提供","廉价的电力","，","而产业","又能","纳税给","美国政府","，","政府再","拨其中部分","继续研究","核物理","。",
            "为什么","现代人","越来越相信","自己能够","靠着研究","取得","新的能力","？",
            "又是什么","促成了","科学、","政治","和经济的","结合","？",
            "本章","先着重在","现代科学的","独特性","，","以提供","部分解答","。",
            "接下来的","两章","会再探讨","科学、","欧洲帝国、","资本主义经济","三者之间","如何","形成联盟","。",
            "小标题","：","不知为不知","。",
            "至少在","认知革命","之后","，","人类","就很希望","能了解","这个世界","。",
            "我们的","祖先","投入","大量时间","和精力","，","希望能找出","支配","自然界的","法则","。",
            "然而","，","现代科学","与先前的","知识体系","有三大不同之处","：","1","，","愿意承认","自己的","无知","。",
            "现代科学的","基础","就是","承认无知","。",
            "从这种立场","，","我们承认了","自己","并非","无所不知","。",
            "更重要的是","，","我们","也愿意","在","知识进展","之后","，","承认","过去相信的","可能是","错的","。",
            "于是","，","再也没有","什么概念、","想法","或理论","是神圣不可挑战的","。",
            "2","，","以观察","和数学","为中心","。",
            "承认无知","之后","，","现代科学","还希望能","获得","新知","。",
            "方式","则是通过","收集","各种观察值","，","再用","数学工具","整理连接","，","形成","全面的","理论","。",
            "3","，","取得","新能力","。",
            "光是","创造理论","，","对现代科学来说","还不够","。",
            "它希望","能够运用","这些理论","来取得","新的能力","，","特别是","发展出","新的科技","。",
            "科学革命","并不是","知识的革命","，","而是","无知的革命","。",
            "真正让","科学革命","起步的","伟大发现","，","就是发现","：","人类对于","最重要的","问题","其实","毫无所知","。",
            "对于","像是","伊斯兰教、","基督教、","佛教、","儒教","这些","前现代","知识体系","来说","，","它们假设","世上","所有重要的","事情","都已经","为人","或为神所知","。",
            "这些全知者","可能是","某些","伟大的神、","某个","全能的神","或是某些","过去的智者","，","通过","经典","或口传","，","将这些","智慧","传给后人","。",
            "而对于","平民百姓而言","，","重点就是要","钻研","这些古籍","和传统","，","正确","加以理解","，","就能","获得知识","。",
            "在当时","，","如果说","圣经、","古兰经","或吠陀经","居然漏了","某些","宇宙的","重大秘密","，","而这个秘密","又居然能被","一般血肉之躯的人","给发现","，","这简直是","不可思议的事","。",
            "对古老的","知识体系","来说","，","只会","承认","两种","无知的","可能","。",
            "第一种","，","个人","可能","不知道","某些","重要的事","。",
            "要取得","必要的","知识","，","他该做的","就是去","问那些","更聪明的人","，","而不是","去寻找","什么","还没有人","知道的事","。",
            "例如","，","如果","有一位","13世纪的","英格兰农夫","，","想知道","人类","究竟是","怎么来的","，","他会认为","基督教","知识体系","一定能有","明确的","答案","。",
            "所以","，","他该做的","就是","去请教","当地的","牧师","。",
            "第二种","，","整个知识体系","可能","不知道","一些","不重要的事","。",
            "就当时的","定义来说","，","伟大的","神祇","或智者","都懒得","告诉我们的事","，","一定是","不重要的","。",
            "例如","，","假设","我们这位","英格兰农民","又想知道","蜘蛛是","怎么结网的","，","他去","问牧师","也没用","，","因为","任何的","基督教经典","都不会","提到","这个问题的","答案","。",
            "然而","，","这绝对","不代表","基督教","有什么缺陷","。",
            "反而是","代表","蜘蛛","怎么结网","这件事","根本不重要","，","人类","无须知道","。",
            "毕竟","，","上帝","一定知道","蜘蛛","怎么结网","，","而如果","这件事","这么重要、","会影响到","人类的","繁荣","和救赎","，","上帝","怎么可能","不在","圣经里面","有完整的","解释","？",
            "基督教","并不会","禁止民众","研究蜘蛛","。",
            "但","研究蜘蛛的","学者","（","如果","中世纪欧洲","真的有人","研究蜘蛛","的话","）","就必须","有心理准备","，","知道","自己","在社会","就是处于","边缘角色","，","而且不管","研究结果","为何","，","基督教","永远都是","对的","。",
            "所以","，","不管","学者","研究的是","蜘蛛、","蝴蝶","，","还是加拉帕戈斯雀","，","都只会被","视为是","无关痛痒的事","，","不会","影响到","社会、","政治","和经济的","基本真理","。",
            "事实上","，","事情","永远","没那么简单","。",
            "就算是","最虔诚、","最保守的","时代","，","还是","会有人","认为","，","一定","有什么","重要的事","，","是整个","知识体系","所不知道的","，","但这种人","常常就会被","边缘化","或遭受迫害","；",
            "但也有可能","，","他们就会","开创一个","新的体系","，","开始宣称","只有他们","才知道","所有","该知道的事","。",
            "举例来说","，","穆罕默德","宗教生涯的","第一步","，","就是","谴责","他的","阿拉伯同胞","，","说","他们对于","真正神圣的","真理","一无所知","。",
            "穆罕默德","很快","就宣称","只有自己","知道","全部的","真相","，","而信众","也开始","称呼他为","先知的","封印","（","意为","所有先知","到此为","终结","）","。",
            "于是","，","所有的","启示","当然","也就是","到了穆罕默德","为止","，","再也没什么","重要的了","。",
            "现代科学","是一套","独特的","知识体系","，","独特之处","也就在于","公开承认","这整套体系","都对一些","最重要的","问题","一无所知","。",
            "达尔文","从来没有","说过","自己是","生物学家的","封印","，","说自己","已经","完全解开了","生命的","谜团","。",
            "经过","几个世纪的","大规模","科学研究","，","生物学家","承认","，","他们","还是无法","完整解释","为什么","大脑","能够产生","意识","。",
            "物理学家","也承认","，","他们","不知道","什么","引起了","宇宙大爆炸","，","也不知道","如何让","量子力学","与广义相对论","结合起来","。",
            "也有些时候","，","因为","不断有","新证据","出现","，","各种","科学理论","也就互相交锋、","战火热烈","。",
            "一个典型的","例子","，","就是","究竟哪种","经济模式","最好","。",
            "虽然","每个经济学家","都可能会说","自己的","模式","最恰当","，","但每次","出现","金融危机","和股市泡沫","，","我们就会","看到","主流改变","；",
            "目前","一般公认","，","我们","还是不知道","最佳的","经济模式","究竟为何","。",
            "还有些时候","，","因为","现有的","证据","强力支持","某些理论","形成主流","，","于是","其他理论","就被冷落","。",
            "虽然","我们一般","认定","主流理论","为真","，","但每个人","也都同意","，","如果","新证据","出现","而与主流理论","相违背","，","主流理论","也就需要","修正","甚至是","淘汰","。",
            "像是","板块构造理论","和演化论","就属于","这种例子","。",
            "现代科学","愿意承认","自己的","无知","，","就让它","比所有先前的","知识体系","更具活力、","更有弹性","，","也更有","求知欲","。",
            "这一点","大幅提升了","人类","理解世界","如何运作的","能力","，","以及","创造新科技的","能力","。",
            "然而","，","这也给人类","带来","祖先","多半","无须面对的","一个严重问题","。",
            "就现在","这个体系","而言","，","我们假设","自己并非","无所不知","，","现有的","知识","也并未","定案","，","但这也","同样","适用于那些","让数百万人","得以有效合作的","虚构故事","。",
            "如果","证据显示","许多","这些故事","都大有问题","，","社会","岂不是","要崩溃了","？",
            "要怎样","才能让社会、","国家","和国际体系","继续","维持运作","？",
            "正因如此","，","现代","想要维持","社会政治秩序","稳定","，","只能靠着","两种","不科学的","方法","，","其他","别无选择","。",
            "1","，","虽然","采用","科学理论","，","但","必须违反","一般科学做法","：","宣称","这就是","绝对的","真理","。",
            "纳粹","就是采用","这种方式","，","声称","他们的","种族政策是","来自","生物事实的","推论","。",
            "2","，","不要采取","科学方法","，","而诉诸","非科学的","绝对真理","。",
            "这一直是","自由人文主义的","策略","。",
            "自由人文主义的","基础在于","坚持主张","人类的","特殊价值","和权利","，","但很尴尬的是","，","对智人的","科学研究","并不认同","这种看法","。",
            "但我们","也不该","太过惊讶","。",
            "毕竟","，","科学","还是得倚靠着","种种宗教","和意识形态信仰","，","才能","取得经费","，","并将研究","正当化","。",
            "不论如何","，","现代文化","已经","比过去","任何文化","都更愿意","承认","自己的","无知","。",
            "而现代社会","之所以","还能够维系","，","原因之一","就在于对","科技","和科学研究方法的","信任","，","这几乎成了","类似宗教的","信仰","，","甚至在","一定程度上","也取代了","对绝对真理的","信念","。"},
            {"测试"},{"测试"},{"测试"},{"测试"},{"测试"},{"测试"}}
    };
    /* public String[] word_text = {"理想国","涉及","柏拉图","思想体系的","各个方面","，","包括哲学、","伦理、","教育、","文艺、","政治等内容","，","主要是","探讨","理想国家的","问题","。",
            "理想国一书","是柏拉图的","一篇","重要对话录","，","对话录里","柏拉图","以苏格拉底之口","通过","与其他人","对话的方式","设计了一个","真、善、美","相统一的政体","，","即可以","达到","公正的","理想国","。",
            "柏拉图的","理想国","是人类历史上","最早的","乌托邦","。",
            "在他的理想国里","统治者","必须是","哲学家","，","他认为","现存的","政治","都是坏的","，","人类的","真正出路","在于","哲学家","掌握政权","也只有","真正的","哲学家","才能拯救","当时","城邦所处的","危机","。",
            "这种信念","构成了","柏拉图","成熟的","政治哲学体系的","核心","。",
            "在他的眼里","“哲学家”","有着","特殊的内涵","。",
            "他认为","哲学家是","最高尚、","最有学识的人","，","而这种","贤人统治下的","贤人政体","就是","最好的政体","。",
            "所以","，","只有","建立","以哲学家","为国王的","国家","才是","最理想的","国家","。",
            "这个国家","就是","存在于","天上的","模范国家","。"};*/
    public int[][][] num_words_in_sentence = {{{1},{1},{1},{1}},
    {{13, 25, 21, 17, 15, 16, 7, 16, 7, 29, 19, 31, 9, 12, 24, 11, 12, 6, 13, 12, 8, 7, 12, 8, 22, 10, 11, 11, 13, 18, 3, 5, 19, 12, 8, 22, 10, 5, 2, 11, 12, 9, 20, 9, 15, 17, 11, 8, 7, 22, 16, 6, 16, 18, 11, 21, 15, 13, 20, 10, 16, 12, 4, 11, 7, 9, 16, 4, 8, 12, 11, 15, 10, 8, 15, 14, 22, 15, 9, 13, 11, 19, 14, 9, 12, 5, 10, 22, 16, 11, 17, 13, 24, 25, 10, 14, 24, 12, 8, 9, 11, 24, 27, 13, 17, 10, 15, 14, 9, 11, 10, 17, 4, 6},
            {1},{1},{1}},
            {{1},{1},{1},{1},{1}},
            {{31, 12, 21, 6, 3, 10, 12, 16, 14, 16, 24, 12, 16, 12, 13, 8, 20, 12, 12, 13, 6, 16, 13, 16, 15, 6, 14, 9, 11, 15, 15, 18, 9, 9, 8, 17, 9, 13, 9, 14, 11, 11, 10, 12, 18, 16, 26, 13, 9, 12, 15, 9, 21, 8, 7, 8, 10, 4, 9, 11, 13, 5, 7, 13, 8, 6, 8, 13, 5, 6, 10, 7, 13, 19, 17, 14, 19, 10, 8, 15, 19, 8, 8, 12, 21, 7, 10, 22, 5, 27, 21, 6, 22, 12, 17, 20, 12, 14, 13, 16, 15, 12, 8, 16, 9, 13, 21, 6, 14, 11, 9, 20, 10, 7, 15, 15, 11, 9, 4, 14, 4, 13, 11, 20},
                    {1},{1},{1},{1},{1},{1}}};
    /*public int[] num_words_in_sentence = {17, 20, 6, 23, 7, 5, 11, 11, 6};*/
    public int[][] num_page() {
        int[][] result = new int[rawtext.length][];
        for (int i = 0; i < result.length; i++) {
            result[i] = new int[rawtext[i].length];
            for (int j = 0; j < result[i].length; j++) {
                int sum = Arrays.stream(num_words_in_sentence[i][j]).sum();
                int page_c = ((sum-1)/ (MyView.num_row * MyView.num_col)) +1;
                if (page_c < 0) {
                    page_c = 0;
                }
                result[i][j] = page_c;
            }
        }
        return result;
    }

    public void punc_word_text(String[] text) {
        for (int i = 0; i < text.length; i++) {
            text[i] = text[i].replaceAll("，","逗号");
            text[i] = text[i].replaceAll("。","句号");
            text[i] = text[i].replaceAll("!","感叹号");
            text[i] = text[i].replaceAll("？","问号");
            text[i] = text[i].replaceAll("；","分号");
            text[i] = text[i].replaceAll("（","括号");
            text[i] = text[i].replaceAll("）","括号");
        }
    }
}
