package com.blindreader;

import android.util.Log;

public class Text {
    private static final String TAG = "order";
    public String rawtext = "理想国涉及柏拉图思想体系的各个方面，包括哲学、伦理、教育、文艺、政治等内容，主要是探讨理想国家的问题。" +
            "理想国一书是柏拉图的一篇重要对话录，对话录里柏拉图以苏格拉底之口通过与其他人对话的方式设计了一个真、善、美相统一的政体，即可以达到公正的理想国。" +
            "柏拉图的理想国是人类历史上最早的乌托邦。" +
            "在他的理想国里统治者必须是哲学家，他认为现存的政治都是坏的，人类的真正出路在于哲学家掌握政权，也只有真正的哲学家才能拯救当时城邦所处的危机。" +
            "这种信念构成了柏拉图成熟的政治哲学体系的核心。" +
            "在他的眼里“哲学家”有着特殊的内涵。" +
            "他认为哲学家是最高尚、最有学识的人，而这种贤人统治下的贤人政体就是最好的政体。" +
            "所以，只有建立以哲学家为国王的国家才是最理想的国家。" +
            "这个国家就是存在于天上的模范国家。";
    public String[] sentence_text = rawtext.split("。");
    public String[] word_text = {"理想国","涉及","柏拉图","思想体系的","各个方面","，","包括哲学、","伦理、","教育、","文艺、","政治等内容","，","主要是","探讨","理想国家的","问题","。",
            "理想国一书","是柏拉图的","一篇","重要对话录","，","对话录里","柏拉图","以苏格拉底之口","通过","与其他人","对话的方式","设计了一个","真、善、美","相统一的政体","，","即可以","达到","公正的","理想国","。",
            "柏拉图的","理想国","是人类历史上","最早的","乌托邦","。",
            "在他的理想国里","统治者","必须是","哲学家","，","他认为","现存的","政治","都是坏的","，","人类的","真正出路","在于","哲学家","掌握政权","也只有","真正的","哲学家","才能拯救","当时","城邦所处的","危机","。",
            "这种信念","构成了","柏拉图","成熟的","政治哲学体系的","核心","。",
            "在他的眼里","“哲学家”","有着","特殊的内涵","。",
            "他认为","哲学家是","最高尚、","最有学识的人","，","而这种","贤人统治下的","贤人政体","就是","最好的政体","。",
            "所以","，","只有","建立","以哲学家","为国王的","国家","才是","最理想的","国家","。",
            "这个国家","就是","存在于","天上的","模范国家","。"};
    public int[] num_words_in_sentence = {17, 20, 6, 23, 7, 5, 11, 11, 6};

    public void punc_word_text(String[] text) {
        for (int i = 0; i < text.length; i++) {
            text[i] = text[i].replaceAll("，","逗号");
            text[i] = text[i].replaceAll("。","句号");
        }
    }
}
