package com.blindreader;

import android.util.Log;

import java.util.Arrays;
import java.util.stream.IntStream;

public class Text {
    private static final String TAG = "order";
    public String[][] title = {{"人类：一种也没什么特别的动物","知善恶树","亚当和夏娃的一天","毁天灭地的人类洪水"},
            {"史上最大骗局","盖起金字塔","记忆过载","历史从无正义"},
            {"历史的方向","金钱的味道","帝国的愿景","宗教的法则","成功的秘密"},
            {"发现自己的无知","科学与帝国的联姻","资本主义教条","工业的巨轮","一场永远的革命","从此过着幸福快乐的日子","智人末日"}
    };
    public String[] chap_title = {"认知革命","农业革命","人类的融合统一","科学革命"};
    public String[][] rawtext = {{"测试","测试","测试","测试"},{"人类曾有长达250万年的时间靠采集及狩猎维生，并不会特别干预动植物的生长情形。" +
            "虽然智人从东非来到中东、欧洲、亚洲，最后到了澳大利亚和美洲，但不管他们到了什么地方，仍然就是靠野生的动植物维生。" +
            "毕竟，如果现在的生活方式就吃得饱，社会结构、宗教信仰、政治情况也都稳定多元，何必自找麻烦改来改去？" +
            "这一切在大约1万年前全然改观，人类开始投入几乎全部的心力，操纵着几种动植物的生命。" +
            "从日升到日落，人类忙着播种、浇水、除草、牧羊，一心以为这样就能得到更多的水果、谷物和肉类。" +
            "这是一场关于人类生活方式的革命：农业革命。" +
            "学者曾经以为农业就是起源于中东，再传布到全球各地，但现在则认为农业是同时间在各地独自发展而开花结果。" +
            "到了公元1世纪，全球大多数地区的绝大多数人口都从事农业。" +
            "学者曾宣称农业革命是人类的大跃进，是由人类脑力所推动的进步故事。" +
            "他们说演化让人越来越聪明，解开了大自然的秘密，于是能够驯化绵羊、种植小麦。" +
            "等到这件事发生，人类就开开心心地放弃了狩猎采集的艰苦、危险、简陋，安定下来，享受农民愉快而饱足的生活。" +
            "这个故事只是幻想。" +
            "并没有任何证据显示人类越来越聪明。" +
            "农业革命所带来的非但不是轻松生活的新时代，反而让农民过着比采集者更辛苦、更不满足的生活。" +
            "狩猎采集者的生活其实更为丰富多变，也比较少会碰上饥饿和疾病的威胁。" +
            "确实，农业革命让人类的食物总量增加，但量的增加并不代表吃得更好、过得更悠闲，反而只是造成人口爆炸，而且产生一群养尊处优、娇生惯养的精英分子。" +
            "普遍来说，农民的工作要比采集者更辛苦，而且到头来的饮食还要更糟。" +
            "农业革命可说是史上最大的一桩骗局。" +
            "谁该负责？" +
            "这背后的主谋，既不是国王，不是牧师，也不是商人。" +
            "真正的主要嫌疑人，就是那极少数的植物物种，其中包括小麦、稻米和马铃薯。" +
            "人类以为自己驯化了植物，但其实是植物驯化了智人。" +
            "如果我们用小麦的观点来看看农业革命这件事，在1万年前，小麦也不过就是许多野草当中的一种，只出现在中东一个很小的地区。" +
            "但就在短短1000年内，小麦突然就传遍了世界各地。" +
            "生存和繁衍正是最基本的演化标准，而根据这个标准，小麦可以说是地球史上最成功的植物。" +
            "究竟，这种野草是怎么从无足轻重变成无所不在？" +
            "小麦的秘诀就在于操纵智人、为其所用。" +
            "智人这种猿类，原本靠着狩猎和采集过着颇为舒适的生活，直到大约1万年前，才开始投入越来越多的精力来培育小麦。" +
            "而在接下来的几千年间，全球许多地方的人类都开始种起小麦，从早到晚只忙这件事就已经焦头烂额。" +
            "种小麦可不容易，照顾起来处处麻烦。" +
            "第一，小麦不喜欢大小石头，所以智人得把田地里的石头捡干净搬出去，搞得腰酸背痛。" +
            "第二，小麦不喜欢与其他植物分享空间、水和养分，所以我们看到男男女女在烈日下整天除草。" +
            "第三，小麦会得病，所以智人得帮忙驱虫防病。" +
            "第四，不论是蝗虫还是兔子，都不排斥饱尝一顿小麦大餐，但小麦完全无力抵抗，所以农民又不得不守卫保护。" +
            "最后，小麦会渴，所以人类得从涌泉或溪流大老远把水引来，为它止渴；" +
            "小麦也会饿，所以智人甚至得收集动物粪便，用来滋养小麦生长的土地。" +
            "智人的身体演化目的并不是为了从事这些活动，我们适应的活动是爬爬果树、追追瞪羚，而不是弯腰清石块、努力挑水桶。" +
            "于是，人类的脊椎、膝盖、脖子和脚底就得付出代价。" +
            "研究古代骨骼发现，人类进到农业时代后出现了大量疾病，例如椎间盘突出、关节炎和疝气。" +
            "此外，新的农业活动得花上大把时间，人类就只能被迫永久定居在麦田旁边。" +
            "这彻底改变了人类的生活方式。" +
            "其实不是我们驯化了小麦，而是小麦驯化了我们。" +
            "驯化一词来自拉丁文，意思就是房子。" +
            "但现在关在房子里的可不是小麦，而是智人。" +
            "小麦究竟做了什么，才让智人放弃了本来很不错的生活，换成另一种悲惨的生活方式？" +
            "它提供了什么报酬？" +
            "就智人的饮食来说，其实并没有更好。" +
            "别忘了，人类原本就是种杂食的猿类，吃的是各式各样的食物。" +
            "在农业革命之前，谷物不过是人类饮食的一小部分罢了。" +
            "而且，以谷物为主的食物不仅矿物质和维生素含量不足、难以消化，还对牙齿和牙龈大大有害。" +
            "而就民生经济而言，小麦也并未带来经济安全。" +
            "一直到最近为止，农业社会绝大多数饮食靠的还是寥寥无几的少数几种农业作物，很多地区甚至只有一种主食，例如小麦、马铃薯或稻米。" +
            "所以，如果缺水、来了蝗灾又或是爆发真菌感染，贫农死亡人数甚至有可能达到百万。" +
            "再就人类暴力而言，小麦也没办法提供人身安全。" +
            "过去，如果采集者的部落遇到比较强的对手，只要撤退搬家就能解决。" +
            "虽然说有些困难和危险，但至少是个可行的选项。" +
            "但如果是农民遇到了强敌，撤退就代表着得放弃田地、房屋和存粮。" +
            "很多时候这几乎就注定了饿死一途。" +
            "因此，农民常常得死守田地，双方拼个你死我活。" +
            "慢慢地，人类发展出进阶的社会结构，如城市、王国、国家，于是人类的暴力也得到了控制。" +
            "不过，这样庞大而有效的政治结构可是足足花了数千年，才终于建立起来。" +
            "当然，农村生活确实为第一代农民带来了一些直接的利益，像是比较不需要担心野兽袭击、风吹雨淋，但对一般人来说，可能其实弊大于利。" +
            "纵观历史，对于个人来说，小麦根本算不上给了什么。" +
            "但对于智人这个物种整体来说，小麦的影响就十分深远。" +
            "种植小麦，每单位土地就能提供更多食物，于是智人的数量也呈指数成长。" +
            "但人口密度也因此增大，也会因此产生一系列负面影响。" +
            "如果要衡量某种物种演化成功与否，评断标准就在于世界上其DNA螺旋的拷贝数的多寡。" +
            "如果世界上不再有某物种的DNA拷贝，就代表该物种已经绝种，而如果某个物种还有许多个体带着它的DNA拷贝存在这个世上，就代表着这个物种演化成功、欣欣向荣。" +
            "从这种角度看来，1000份DNA拷贝永远都强过100份。" +
            "这正是农业革命真正的本质：让更多的人却以更糟的状况活下去。" +
            "但是，身为个人，为什么要管这种演化问题？" +
            "如果有人说，为了增加智人基因组在世界上的拷贝数，希望你降低自己的生活水平，你会同意吗？" +
            "没有人会同意这笔交易。" +
            "简单说来，农业革命就是一个陷阱。","测试","测试","测试"},
            {"测试","测试","测试","测试","测试"},
            {"小标题：不知为不知。" +
                    "至少在认知革命之后，人类就很希望能了解这个世界。" +
                    "我们的祖先投入大量时间和精力，希望能找出支配自然界的法则。" +
                    "然而，现代科学与先前的知识体系有三大不同之处：1，愿意承认自己的无知。" +
                    "现代科学的基础就是承认无知。" +
                    "从这种立场，我们承认了自己并非无所不知。" +
                    "更重要的是，我们也愿意在知识进展之后，承认过去相信的可能是错的。" +
                    "于是，再也没有什么概念、想法或理论是神圣不可挑战的。" +
                    "2，以观察和数学为中心。" +
                    "承认无知之后，现代科学还希望能获得新知。" +
                    "方式则是通过收集各种观察值，再用数学工具整理连接，形成全面的理论。" +
                    "3，取得新能力。" +
                    "光是创造理论，对现代科学来说还不够。" +
                    "它希望能够运用这些理论来取得新的能力，特别是发展出新的科技。" +
                    "科学革命并不是知识的革命，而是无知的革命。" +
                    "真正让科学革命起步的伟大发现，就是发现：人类对于最重要的问题其实毫无所知。" +
                    "对于像是伊斯兰教、基督教、佛教、儒教这些前现代知识体系来说，它们假设世上所有重要的事情都已经为人或为神所知。" +
                    "这些全知者可能是某些伟大的神、某个全能的神或是某些过去的智者，通过经典或口传，将这些智慧传给后人。" +
                    "而对于平民百姓而言，重点就是要钻研这些古籍和传统，正确加以理解，就能获得知识。" +
                    "在当时，如果说圣经、古兰经或吠陀经居然漏了某些宇宙的重大秘密，而这个秘密又居然能被一般血肉之躯的人给发现，这简直是不可思议的事。" +
                    "对古老的知识体系来说，只会承认两种无知的可能。" +
                    "第一种，个人可能不知道某些重要的事。" +
                    "要取得必要的知识，他该做的就是去问那些更聪明的人，而不是去寻找什么还没有人知道的事。" +
                    "例如，如果有一位13世纪的英格兰农夫，想知道人类究竟是怎么来的，他会认为基督教知识体系一定能有明确的答案。" +
                    "所以，他该做的就是去请教当地的牧师。" +
                    "第二种，整个知识体系可能不知道一些不重要的事。" +
                    "就当时的定义来说，伟大的神祇或智者都懒得告诉我们的事，一定是不重要的。" +
                    "例如，假设我们这位英格兰农民又想知道蜘蛛是怎么结网的，他去问牧师也没用，因为任何的基督教经典都不会提到这个问题的答案。" +
                    "然而，这绝对不代表基督教有什么缺陷。" +
                    "反而是代表蜘蛛怎么结网这件事根本不重要，人类无须知道。" +
                    "毕竟，上帝一定知道蜘蛛怎么结网，而如果这件事这么重要、会影响到人类的繁荣和救赎，上帝怎么可能不在圣经里面有完整的解释？" +
                    "基督教并不会禁止民众研究蜘蛛。" +
                    "但研究蜘蛛的学者（如果中世纪欧洲真的有人研究蜘蛛的话）就必须有心理准备，知道自己在社会就是处于边缘角色，而且不管研究结果为何，基督教永远都是对的。" +
                    "所以，不管学者研究的是蜘蛛、蝴蝶，还是加拉帕戈斯雀，都只会被视为是无关痛痒的事，不会影响到社会、政治和经济的基本真理。" +
                    "事实上，事情永远没那么简单。" +
                    "就算是最虔诚、最保守的时代，还是会有人认为，一定有什么重要的事，是整个知识体系所不知道的，但这种人常常就会被边缘化或遭受迫害；" +
                    "但也有可能，他们就会开创一个新的体系，开始宣称只有他们才知道所有该知道的事。" +
                    "举例来说，穆罕默德宗教生涯的第一步，就是谴责他的阿拉伯同胞，说他们对于真正神圣的真理一无所知。" +
                    "穆罕默德很快就宣称只有自己知道全部的真相，而信众也开始称呼他为先知的封印（意为所有先知到此为终结）。" +
                    "于是，所有的启示当然也就是到了穆罕默德为止，再也没什么重要的了。" +
                    "现代科学是一套独特的知识体系，独特之处也就在于公开承认这整套体系都对一些最重要的问题一无所知。" +
                    "达尔文从来没有说过自己是生物学家的封印，说自己已经完全解开了生命的谜团。" +
                    "经过几个世纪的大规模科学研究，生物学家承认，他们还是无法完整解释为什么大脑能够产生意识。" +
                    "物理学家也承认，他们不知道什么引起了宇宙大爆炸，也不知道如何让量子力学与广义相对论结合起来。" +
                    "也有些时候，因为不断有新证据出现，各种科学理论也就互相交锋、战火热烈。" +
                    "一个典型的例子，就是究竟哪种经济模式最好。" +
                    "虽然每个经济学家都可能会说自己的模式最恰当，但每次出现金融危机和股市泡沫，我们就会看到主流改变；" +
                    "目前一般公认，我们还是不知道最佳的经济模式究竟为何。" +
                    "还有些时候，因为现有的证据强力支持某些理论形成主流，于是其他理论就被冷落。" +
                    "虽然我们一般认定主流理论为真，但每个人也都同意，如果新证据出现而与主流理论相违背，主流理论也就需要修正甚至是淘汰。" +
                    "像是板块构造理论和演化论就属于这种例子。" +
                    "现代科学愿意承认自己的无知，就让它比所有先前的知识体系更具活力、更有弹性，也更有求知欲。" +
                    "这一点大幅提升了人类理解世界如何运作的能力，以及创造新科技的能力。" +
                    "然而，这也给人类带来祖先多半无须面对的一个严重问题。" +
                    "就现在这个体系而言，我们假设自己并非无所不知，现有的知识也并未定案，但这也同样适用于那些让数百万人得以有效合作的虚构故事。" +
                    "如果证据显示许多这些故事都大有问题，社会岂不是要崩溃了？" +
                    "要怎样才能让社会、国家和国际体系继续维持运作？" +
                    "正因如此，现代想要维持社会政治秩序稳定，只能靠着两种不科学的方法，其他别无选择。" +
                    "1，虽然采用科学理论，但必须违反一般科学做法：宣称这就是绝对的真理。" +
                    "纳粹就是采用这种方式，声称他们的种族政策是来自生物事实的推论。" +
                    "2，不要采取科学方法，而诉诸非科学的绝对真理。" +
                    "这一直是自由人文主义的策略。" +
                    "自由人文主义的基础在于坚持主张人类的特殊价值和权利，但很尴尬的是，对智人的科学研究并不认同这种看法。" +
                    "但我们也不该太过惊讶。" +
                    "毕竟，科学还是得倚靠着种种宗教和意识形态信仰，才能取得经费，并将研究正当化。" +
                    "不论如何，现代文化已经比过去任何文化都更愿意承认自己的无知。" +
                    "而现代社会之所以还能够维系，原因之一就在于对科技和科学研究方法的信任，这几乎成了类似宗教的信仰，甚至在一定程度上也取代了对绝对真理的信念。",
            "测试","测试",
                    "工业革命为人类带来了前所未有的种种能源和原料，不仅种类丰富，而且价格低廉。" +
                    "结果就是人类的生产力有了爆炸性的发展。" +
                    "首先引爆、影响也最深的就是农业。" +
                    "一般情况下，我们想到工业革命，脑中浮现的画面就是一片都市景象、冒着烟的烟囱，或者是一群煤矿工人汗流浃背，深入地底辛苦工作。" +
                    "然而，工业革命最重要的一点，其实在于它就是第二次的农业革命。" +
                    "过去两百年间，工业化生产成了农业的支柱。" +
                    "过去得靠肌肉力量或根本做不到的事情，现在都由像是曳引机之类的机器接手。" +
                    "由于有了化学肥料、工业杀虫剂和各种激素及药物，无论是农地还是家禽家畜的产量都大幅跃进。" +
                    "而有了冰箱、船舶和飞机之后，各种农产品能够保存长达数个月，而且也能快速、廉价地运送到世界的另一头。" +
                    "欧洲人开始能够大啖新鲜美味的阿根廷牛肉和日本寿司。" +
                    "如果将所有数字加总，全球随时都有数十亿只家禽家畜就像活在工厂生产线上，而每年宰杀总数更达到百亿。" +
                    "采用工业化的禽畜饲养方式后，农业生产量和人类粮食储备量大幅增长。" +
                    "像这种工业化的畜牧业， 再加上农作物种植的机械化，就成了整个现代社会经济秩序的基础。" +
                    "随着农业工业化，只需要越来越少的农民数量，就足以养活越来越多的办公或工厂人口。" +
                    "例如现在的美国，只有2%的人口以农业为生，但仅仅就是这2%，不仅养活了整个美国的人口，还有剩余粮食可以出口到世界各地。" +
                    "如果没有农业工业化，就不会有足够的人力来办公思考和从事工厂劳动，也就不可能有都市里的工业革命。" +
                    "正是因为农业释放出了数十亿的人力，由工厂和办公室吸纳，才开始像雪崩一样有各种新产品倾泻而出。" +
                    "比起以前，人类生产出更多钢铁，制作出更多服装，兴建出更多建筑，还制造出令人瞠目结舌、超出想象的各种产品，像是灯泡、手机、数码相机和洗碗机。" +
                    "人类有史以来第一次，生产超出了需求。" +
                    "也是因为如此，产生了一个全新的问题：谁要来买这些产品？" +
                    "小标题：血拼的年代。" +
                    "现代资本主义经济如果想要存活，就得不断提高产量。" +
                    "然而，光是生产还不够。" +
                    "生产出来之后，还得有人买，否则业者或投资人都得关门大吉。" +
                    "为了避免这种灾难，确保不管什么新产品都有人买账，就出现了一种新的伦理观：消费主义。" +
                    "有史以来，人类的生活多半颇为困窘，因此节俭就成了过去所高喊的口号，像是清教徒或斯巴达人，都以简朴律己而闻名。" +
                    "所以，如果是正直的人，就该避免奢侈、从来不浪费食物，裤子破了该缝缝补补，而不是去买条新的。" +
                    "然而，消费主义的美德就是消费更多的产品和服务，鼓励所有人应该善待自己、宠爱自己，就算因为过度消费而慢慢走上绝路，也是在所不惜。" +
                    "在这里，节俭就像是一种该赶快治疗的疾病。" +
                    "现在我们很容易在身边找到各种鼓励消费的广告。" +
                    "在历史上的大多数时候，各种鼓励消费伦理的文案不但无法引起消费欲望，反而还会激起极度的反感。" +
                    "在过去的人眼中，这种内容真是自私、堕落、道德沦丧！" +
                    "消费主义除了自身非常努力，还在大众心理学的推波助澜之下，不断说服大众：放纵对你有益，而节俭是自我压抑。" +
                    "而且，这套理论已经成功了。" +
                    "我们都成了乖巧的消费者，买了无数种我们并不真正需要的产品，而且有的根本就是昨天才知道的。" +
                    "制造商设计产品的时候，刻意让它在一段短时间后就被淘汰；" +
                    "而且就算旧型号明明就足以满足各种需求，厂商还是会不断推出新型号，我们如果不跟进，就仿佛显得落伍。" +
                    "购物已成为人类最喜爱的消遣，而且消费性产品也成了家人、朋友、配偶之间不可或缺的中介。" +
                    "各种宗教节日，例如圣诞节，都已经成了购物节。" +
                    "消费主义伦理开枝散叶，在食品市场表现得最为明显。" +
                    "在过去的传统农业社会，饥荒的阴影总是挥之不去。" +
                    "但到了今日的富裕世界，一大健康问题却成了肥胖，而且对穷人的冲击更大于富人。" +
                    "因为富人懂得选择有机沙拉和水果奶昔，但穷人常常是大啖汉堡、比萨。" +
                    "美国每年为了节食所花的钱，已经足以养活其他地方所有正在挨饿的人。" +
                    "肥胖这件事，可以说是消费主义的双重胜利。" +
                    "一方面，如果大家吃得太少，就会导致经济萎缩，这可不妙；" +
                    "另一方面，大家吃多了之后，就得购买减肥产品，再次促进经济成长。" +
                    "然而，如果根据商人的资本主义伦理，所有的利润都该再投入生产而不是白白浪费，这样一来，消费主义伦理和资本主义道德该如何共存？" +
                    "没问题！" +
                    "就像过去的年代，今天也有精英分子和一般大众的劳力分工。" +
                    "在中世纪欧洲，贵族浪掷千金、尽享奢华，而农民则是省吃俭用、锱铢必较。" +
                    "但今天情况正相反。" +
                    "大富豪管理资产和投资非常谨慎，反而 是没那么有钱的人，买起没那么需要的汽车和电视机却毫不手软。" +
                    "资本主义和消费主义的伦理可以说是一枚硬币的正反两面，将这两种秩序合而为一。" +
                    "有钱人的最高指导原则是投资，而我们这些其他人的最高指导原则则是购买。" +
                    "这种资本/消费主义的伦理，还有另一个革命性的意义。" +
                    "过去的伦理体系，常常要求人类做些难如登天的事，告诉他们照做就能上天堂。" +
                    "但总是要求他们慈悲、宽容，克服各种欲望和愤怒，还得放下己身的私利。" +
                    "这对大多数人来说实在太过强人所难。" +
                    "所以翻开伦理道德的历史，虽然会看到许多美妙的理想，但遗憾的是几乎没人能做到。" +
                    "大多数基督徒的作为不像基督，大多数佛教徒没听佛陀的话，大多数儒家子弟可能会让孔子频频摇头。" +
                    "但今天的情况有所不同了，大多数人都能轻松达到资本/消费主义的理想。" +
                    "想要进入这种新伦理所承诺的天堂，条件就是有钱人应该继续贪婪下去，把时间投入赚更多的钱，至于一般大众则是要尽情满足自己的欲望和热情，想要什么就买什么。" +
                    "这是人类有史以来第一次，信众终于真的能够做到宗教要求的条件。" +
                    "只不过，我们又怎么知道它承诺的天堂是什么样子？" +
                    "答案是：看看电视，你就知道。","测试","测试","测试"}};
    /*public String rawtext = "理想国涉及柏拉图思想体系的各个方面，包括哲学、伦理、教育、文艺、政治等内容，主要是探讨理想国家的问题。" +
            "理想国一书是柏拉图的一篇重要对话录，对话录里柏拉图以苏格拉底之口通过与其他人对话的方式设计了一个真、善、美相统一的政体，即可以达到公正的理想国。" +
            "柏拉图的理想国是人类历史上最早的乌托邦。" +
            "在他的理想国里统治者必须是哲学家，他认为现存的政治都是坏的，人类的真正出路在于哲学家掌握政权，也只有真正的哲学家才能拯救当时城邦所处的危机。" +
            "这种信念构成了柏拉图成熟的政治哲学体系的核心。" +
            "在他的眼里“哲学家”有着特殊的内涵。" +
            "他认为哲学家是最高尚、最有学识的人，而这种贤人统治下的贤人政体就是最好的政体。" +
            "所以，只有建立以哲学家为国王的国家才是最理想的国家。" +
            "这个国家就是存在于天上的模范国家。";*/
    public String[][][] word_text = {{{"测试"},{"测试"},{"测试"},{"测试"}},{{"人类曾有","长达","250万年的","时间","靠采集","及狩猎","维生","，","并不会","特别干预","动植物的","生长情形","。",
            "虽然","智人","从东非","来到","中东、","欧洲、","亚洲","，","最后到了","澳大利亚","和美洲","，","但不管","他们到了","什么地方","，","仍然就是","靠野生的","动植物","维生","。",
            "毕竟","，","如果","现在的","生活方式","就吃得饱","，","社会结构、","宗教信仰、","政治情况","也都","稳定多元","，","何必","自找麻烦","改来改去","？",
            "这一切在","大约","1万年前","全然改观","，","人类","开始投入","几乎全部的","心力","，","操纵着","几种","动植物的","生命","。",
            "从日升","到日落","，","人类忙着","播种、","浇水、","除草、","牧羊","，","一心以为","这样就能","得到更多的","水果、","谷物","和肉类","。",
            "这是一场","关于","人类","生活方式的","革命","：","农业革命","。",
            "学者","曾经以为","农业","就是","起源于","中东","，","再传布到","全球各地","，","但现在","则认为","农业是","同时间","在各地","独自发展","而开花结果","。",
            "到了","公元1世纪","，","全球","大多数地区的","绝大多数","人口","都从事","农业","。",
            "学者","曾宣称","农业革命是","人类的","大跃进","，","是由","人类脑力","所推动的","进步故事","。",
            "他们说","演化","让人","越来越聪明","，","解开了","大自然的","秘密","，","于是能够","驯化绵羊、","种植小麦","。",
            "等到","这件事","发生","，","人类就","开开心心地","放弃了","狩猎采集的","艰苦、","危险、","简陋","，","安定下来","，","享受","农民","愉快而饱足的","生活","。",
            "这个故事","只是幻想","。",
            "并没有","任何证据","显示","人类","越来越聪明","。",
            "农业革命","所带来的","非但不是","轻松生活的","新时代","，","反而","让农民","过着","比采集者","更辛苦、","更不满足的","生活","。",
            "狩猎采集者的","生活","其实更为","丰富多变","，","也比较少","会碰上","饥饿","和疾病的","威胁","。",
            "确实","，","农业革命","让人类的","食物总量","增加","，","但量的增加","并不代表","吃得更好、","过得更悠闲","，","反而只是","造成","人口爆炸","，","而且","产生一群","养尊处优、","娇生惯养的","精英分子","。",
            "普遍来说","，","农民的工作","要比采集者","更辛苦","，","而且","到头来的","饮食","还要更糟","。",
            "农业革命","可说是","史上最大的","一桩骗局","。",
            "谁该负责","？",
            "这背后的","主谋","，","既不是","国王","，","不是牧师","，","也不是","商人","。",
            "真正的","主要嫌疑人","，","就是那","极少数的","植物物种","，","其中包括","小麦、","稻米","和马铃薯","。",
            "人类以为","自己","驯化了植物","，","但其实是","植物","驯化了","智人","。",
            "如果","我们用","小麦的","观点","来看看","农业革命","这件事","，","在1万年前","，","小麦","也不过就是","许多野草","当中的","一种","，","只出现在","中东一个","很小的","地区","。",
            "但就在","短短","1000年内","，","小麦","突然就","传遍了","世界各地","。",
            "生存","和繁衍","正是","最基本的","演化标准","，","而根据","这个标准","，","小麦","可以说是","地球史上","最成功的","植物","。",
            "究竟","，","这种野草","是怎么从","无足轻重","变成","无所不在","？",
            "小麦的","秘诀","就在于","操纵","智人、","为其所用","。",
            "智人","这种猿类","，","原本靠着","狩猎","和采集","过着","颇为舒适的","生活","，","直到","大约","1万年前","，","才开始","投入","越来越多的","精力","来培育","小麦","。",
            "而在","接下来的","几千年间","，","全球","许多地方的","人类","都开始","种起小麦","，","从早到晚","只忙","这件事","就已经","焦头烂额","。",
            "种小麦","可不容易","，","照顾起来","处处麻烦","。",
            "第一","，","小麦","不喜欢","大小石头","，","所以","智人得","把田地里的","石头","捡干净","搬出去","，","搞得","腰酸背痛","。",
            "第二","，","小麦","不喜欢","与","其他植物","分享","空间、","水","和养分","，","所以","我们看到","男男女女","在烈日下","整天","除草","。",
            "第三","，","小麦","会得病","，","所以","智人","得帮忙","驱虫","防病","。",
            "第四","，","不论是","蝗虫","还是","兔子","，","都不排斥","饱尝一顿","小麦大餐","，","但小麦","完全","无力抵抗","，","所以","农民","又不得不","守卫","保护","。",
            "最后","，","小麦","会渴","，","所以","人类得","从涌泉","或溪流","大老远","把水引来","，","为它止渴","；",
            "小麦","也会饿","，","所以","智人甚至","得收集","动物粪便","，","用来滋养","小麦生长的","土地","。",
            "智人的","身体","演化目的","并不是","为了从事","这些活动","，","我们适应的","活动是","爬爬果树、","追追瞪羚","，","而不是","弯腰","清石块、","努力","挑水桶","。",
            "于是","，","人类的","脊椎、","膝盖、","脖子","和脚底","就得","付出代价","。",
            "研究","古代骨骼","发现","，","人类","进到","农业时代后","出现了","大量疾病","，","例如","椎间盘突出、","关节炎","和疝气","。",
            "此外","，","新的","农业活动","得花上","大把时间","，","人类就只能","被迫","永久定居在","麦田旁边","。",
            "这彻底改变了","人类的","生活方式","。",
            "其实","不是","我们","驯化了","小麦","，","而是","小麦","驯化了","我们","。",
            "驯化一词","来自","拉丁文","，","意思","就是","房子","。",
            "但现在","关在","房子里的","可不是","小麦","，","而是智人","。",
            "小麦","究竟","做了什么","，","才让智人","放弃了","本来","很不错的","生活","，","换成","另一种","悲惨的","生活方式","？",
            "它","提供了","什么报酬","？",
            "就智人的","饮食","来说","，","其实","并没有","更好","。",
            "别忘了","，","人类","原本","就是种","杂食的猿类","，","吃的是","各式各样的","食物","。",
            "在","农业革命","之前","，","谷物","不过是","人类","饮食的","一小部分","罢了","。",
            "而且","，","以谷物","为主的","食物","不仅","矿物质","和维生素","含量不足、","难以消化","，","还对牙齿","和牙龈","大大有害","。",
            "而就","民生经济","而言","，","小麦","也并未","带来","经济安全","。",
            "一直到","最近为止","，","农业社会","绝大多数","饮食","靠的还是","寥寥无几的","少数几种","农业作物","，","很多地区","甚至只有","一种主食","，","例如","小麦、","马铃薯","或稻米","。",
            "所以","，","如果","缺水、","来了蝗灾","又或是","爆发","真菌感染","，","贫农","死亡人数","甚至有可能","达到百万","。",
            "再就","人类暴力","而言","，","小麦","也没办法","提供","人身安全","。",
            "过去","，","如果","采集者的","部落","遇到","比较强的","对手","，","只要","撤退","搬家","就能解决","。",
            "虽然说","有些困难","和危险","，","但至少是个","可行的","选项","。",
            "但如果是","农民","遇到了","强敌","，","撤退","就代表着","得放弃田地、","房屋","和存粮","。",
            "很多时候","这几乎","就注定了","饿死一途","。",
            "因此","，","农民","常常得","死守田地","，","双方","拼个","你死我活","。",
            "慢慢地","，","人类","发展出","进阶的","社会结构","，","如城市、","王国、","国家","，","于是","人类的","暴力","也得到了","控制","。",
            "不过","，","这样庞大","而有效的","政治结构","可是","足足花了","数千年","，","才终于","建立起来","。",
            "当然","，","农村生活","确实为","第一代农民","带来了一些","直接的","利益","，","像是","比较不需要","担心","野兽袭击、","风吹雨淋","，","但","对一般人","来说","，","可能其实","弊大于利","。",
            "纵观历史","，","对于","个人来说","，","小麦","根本","算不上","给了什么","。",
            "但对于","智人","这个物种","整体来说","，","小麦的","影响","就十分深远","。",
            "种植小麦","，","每单位土地","就能提供","更多食物","，","于是","智人的","数量","也呈指数","成长","。",
            "但人口密度","也因此","增大","，","也会","因此产生","一系列","负面影响","。",
            "如果要","衡量","某种物种","演化","成功与否","，","评断标准","就在于","世界上","其DNA螺旋的","拷贝数的","多寡","。",
            "如果","世界上","不再有","某物种的","DNA拷贝","，","就代表","该物种","已经绝种","，","而如果","某个物种","还有","许多个体","带着它的","DNA拷贝","存在","这个世上","，","就代表着","这个物种","演化成功、","欣欣向荣","。",
            "从这种角度","看来","，","1000份","DNA拷贝","永远都","强过","100份","。",
            "这正是","农业革命","真正的","本质","：","让更多的人","却以","更糟的","状况","活下去","。",
            "但是","，","身为","个人","，","为什么","要管这种","演化问题","？",
            "如果","有人说","，","为了","增加","智人基因组","在世界上的","拷贝数","，","希望你","降低","自己的","生活水平","，","你会","同意","吗","？",
            "没有人会","同意","这笔交易","。",
            "简单说来","，","农业革命","就是","一个陷阱","。"},{"测试"},{"测试"},{"测试"}},
            {{"测试"},{"测试"},{"测试"},{"测试"},{"测试"}},
            {{"小标题","：","不知为不知","。",
                    "至少在","认知革命","之后","，","人类","就很希望","能了解","这个世界","。",
                    "我们的","祖先","投入","大量时间","和精力","，","希望能找出","支配","自然界的","法则","。",
                    "然而","，","现代科学","与先前的","知识体系","有三大不同之处","：","1","，","愿意承认","自己的","无知","。",
                    "现代科学的","基础","就是","承认无知","。",
                    "从这种立场","，","我们承认了","自己","并非","无所不知","。",
                    "更重要的是","，","我们","也愿意","在","知识进展","之后","，","承认","过去相信的","可能是","错的","。",
                    "于是","，","再也没有","什么概念、","想法","或理论","是神圣不可挑战的","。",
                    "2","，","以观察","和数学","为中心","。",
                    "承认无知","之后","，","现代科学","还希望能","获得","新知","。",
                    "方式","则是通过","收集","各种观察值","，","再用","数学工具","整理连接","，","形成","全面的","理论","。",
                    "3","，","取得","新能力","。",
                    "光是","创造理论","，","对现代科学来说","还不够","。",
                    "它希望","能够运用","这些理论","来取得","新的能力","，","特别是","发展出","新的科技","。",
                    "科学革命","并不是","知识的革命","，","而是","无知的革命","。",
                    "真正让","科学革命","起步的","伟大发现","，","就是发现","：","人类对于","最重要的","问题","其实","毫无所知","。",
                    "对于","像是","伊斯兰教、","基督教、","佛教、","儒教","这些","前现代","知识体系","来说","，","它们假设","世上","所有重要的","事情","都已经","为人","或为神所知","。",
                    "这些全知者","可能是","某些","伟大的神、","某个","全能的神","或是某些","过去的智者","，","通过","经典","或口传","，","将这些","智慧","传给后人","。",
                    "而对于","平民百姓而言","，","重点就是要","钻研","这些古籍","和传统","，","正确","加以理解","，","就能","获得知识","。",
                    "在当时","，","如果说","圣经、","古兰经","或吠陀经","居然漏了","某些","宇宙的","重大秘密","，","而这个秘密","又居然能被","一般血肉之躯的人","给发现","，","这简直是","不可思议的事","。",
                    "对古老的","知识体系","来说","，","只会","承认","两种","无知的","可能","。",
                    "第一种","，","个人","可能","不知道","某些","重要的事","。",
                    "要取得","必要的","知识","，","他该做的","就是去","问那些","更聪明的人","，","而不是","去寻找","什么","还没有人","知道的事","。",
                    "例如","，","如果","有一位","13世纪的","英格兰农夫","，","想知道","人类","究竟是","怎么来的","，","他会认为","基督教","知识体系","一定能有","明确的","答案","。",
                    "所以","，","他该做的","就是","去请教","当地的","牧师","。",
                    "第二种","，","整个知识体系","可能","不知道","一些","不重要的事","。",
                    "就当时的","定义来说","，","伟大的","神祇","或智者","都懒得","告诉我们的事","，","一定是","不重要的","。",
                    "例如","，","假设","我们这位","英格兰农民","又想知道","蜘蛛是","怎么结网的","，","他去","问牧师","也没用","，","因为","任何的","基督教经典","都不会","提到","这个问题的","答案","。",
                    "然而","，","这绝对","不代表","基督教","有什么缺陷","。",
                    "反而是","代表","蜘蛛","怎么结网","这件事","根本不重要","，","人类","无须知道","。",
                    "毕竟","，","上帝","一定知道","蜘蛛","怎么结网","，","而如果","这件事","这么重要、","会影响到","人类的","繁荣","和救赎","，","上帝","怎么可能","不在","圣经里面","有完整的","解释","？",
                    "基督教","并不会","禁止民众","研究蜘蛛","。",
                    "但","研究蜘蛛的","学者","（","如果","中世纪欧洲","真的有人","研究蜘蛛","的话","）","就必须","有心理准备","，","知道","自己","在社会","就是处于","边缘角色","，","而且不管","研究结果","为何","，","基督教","永远都是","对的","。",
                    "所以","，","不管","学者","研究的是","蜘蛛、","蝴蝶","，","还是加拉帕戈斯雀","，","都只会被","视为是","无关痛痒的事","，","不会","影响到","社会、","政治","和经济的","基本真理","。",
                    "事实上","，","事情","永远","没那么简单","。",
                    "就算是","最虔诚、","最保守的","时代","，","还是","会有人","认为","，","一定","有什么","重要的事","，","是整个","知识体系","所不知道的","，","但这种人","常常就会被","边缘化","或遭受迫害","；",
                    "但也有可能","，","他们就会","开创一个","新的体系","，","开始宣称","只有他们","才知道","所有","该知道的事","。",
                    "举例来说","，","穆罕默德","宗教生涯的","第一步","，","就是","谴责","他的","阿拉伯同胞","，","说","他们对于","真正神圣的","真理","一无所知","。",
                    "穆罕默德","很快","就宣称","只有自己","知道","全部的","真相","，","而信众","也开始","称呼他为","先知的","封印","（","意为","所有先知","到此为","终结","）","。",
                    "于是","，","所有的","启示","当然","也就是","到了穆罕默德","为止","，","再也没什么","重要的了","。",
                    "现代科学","是一套","独特的","知识体系","，","独特之处","也就在于","公开承认","这整套体系","都对一些","最重要的","问题","一无所知","。",
                    "达尔文","从来没有","说过","自己是","生物学家的","封印","，","说自己","已经","完全解开了","生命的","谜团","。",
                    "经过","几个世纪的","大规模","科学研究","，","生物学家","承认","，","他们","还是无法","完整解释","为什么","大脑","能够产生","意识","。",
                    "物理学家","也承认","，","他们","不知道","什么","引起了","宇宙大爆炸","，","也不知道","如何让","量子力学","与广义相对论","结合起来","。",
                    "也有些时候","，","因为","不断有","新证据","出现","，","各种","科学理论","也就互相交锋、","战火热烈","。",
                    "一个典型的","例子","，","就是","究竟哪种","经济模式","最好","。",
                    "虽然","每个经济学家","都可能会说","自己的","模式","最恰当","，","但每次","出现","金融危机","和股市泡沫","，","我们就会","看到","主流改变","；",
                    "目前","一般公认","，","我们","还是不知道","最佳的","经济模式","究竟为何","。",
                    "还有些时候","，","因为","现有的","证据","强力支持","某些理论","形成主流","，","于是","其他理论","就被冷落","。",
                    "虽然","我们一般","认定","主流理论","为真","，","但每个人","也都同意","，","如果","新证据","出现","而与主流理论","相违背","，","主流理论","也就需要","修正","甚至是","淘汰","。",
                    "像是","板块构造理论","和演化论","就属于","这种例子","。",
                    "现代科学","愿意承认","自己的","无知","，","就让它","比所有先前的","知识体系","更具活力、","更有弹性","，","也更有","求知欲","。",
                    "这一点","大幅提升了","人类","理解世界","如何运作的","能力","，","以及","创造新科技的","能力","。",
                    "然而","，","这也给人类","带来","祖先","多半","无须面对的","一个严重问题","。",
                    "就现在","这个体系","而言","，","我们假设","自己并非","无所不知","，","现有的","知识","也并未","定案","，","但这也","同样","适用于那些","让数百万人","得以有效合作的","虚构故事","。",
                    "如果","证据显示","许多","这些故事","都大有问题","，","社会","岂不是","要崩溃了","？",
                    "要怎样","才能让社会、","国家","和国际体系","继续","维持运作","？",
                    "正因如此","，","现代","想要维持","社会政治秩序","稳定","，","只能靠着","两种","不科学的","方法","，","其他","别无选择","。",
                    "1","，","虽然","采用","科学理论","，","但","必须违反","一般科学做法","：","宣称","这就是","绝对的","真理","。",
                    "纳粹","就是采用","这种方式","，","声称","他们的","种族政策是","来自","生物事实的","推论","。",
                    "2","，","不要采取","科学方法","，","而诉诸","非科学的","绝对真理","。",
                    "这一直是","自由人文主义的","策略","。",
                    "自由人文主义的","基础在于","坚持主张","人类的","特殊价值","和权利","，","但很尴尬的是","，","对智人的","科学研究","并不认同","这种看法","。",
                    "但我们","也不该","太过惊讶","。",
                    "毕竟","，","科学","还是得倚靠着","种种宗教","和意识形态信仰","，","才能","取得经费","，","并将研究","正当化","。",
                    "不论如何","，","现代文化","已经","比过去","任何文化","都更愿意","承认","自己的","无知","。",
                    "而现代社会","之所以","还能够维系","，","原因之一","就在于对","科技","和科学研究方法的","信任","，","这几乎成了","类似宗教的","信仰","，","甚至在","一定程度上","也取代了","对绝对真理的","信念","。"},
            {"测试"},{"测试"},{"工业革命","为人类","带来了","前所未有的","种种能源","和原料","，","不仅","种类丰富","，","而且","价格低廉","。",
                    "结果就是","人类的","生产力","有了","爆炸性的","发展","。",
                    "首先","引爆、","影响也","最深的","就是农业","。",
                    "一般情况下","，","我们想到","工业革命","，","脑中浮现的","画面","就是一片","都市景象、","冒着烟的","烟囱","，","或者是","一群","煤矿工人","汗流浃背","，","深入地底","辛苦工作","。",
                    "然而","，","工业革命","最重要的一点","，","其实在于","它就是","第二次的","农业革命","。",
                    "过去","两百年间","，","工业化生产","成了","农业的","支柱","。",
                    "过去","得靠","肌肉力量","或根本","做不到的","事情","，","现在都由","像是","曳引机之类的","机器","接手","。",
                    "由于有了","化学肥料、","工业杀虫剂","和各种激素","及药物","，","无论是","农地","还是","家禽家畜的","产量","都大幅跃进","。",
                    "而有了","冰箱、","船舶","和飞机","之后","，","各种农产品","能够保存","长达","数个月","，","而且","也能","快速、","廉价地","运送到","世界的","另一头","。",
                    "欧洲人","开始能够","大啖","新鲜美味的","阿根廷牛肉","和日本寿司","。",
                    "如果","将所有","数字","加总","，","全球","随时都有","数十亿只","家禽家畜","就像","活在","工厂","生产线上","，","而每年","宰杀总数","更达到","百亿","。",
                    "采用","工业化的","禽畜","饲养方式后","，","农业生产量","和人类粮食","储备量","大幅增长","。",
                    "像这种","工业化的","畜牧业","，"," ","再加上","农作物","种植的","机械化","，","就成了","整个","现代社会","经济秩序的","基础","。",
                    "随着","农业","工业化","，","只需要","越来越少的","农民数量","，","就足以","养活","越来越多的","办公","或工厂","人口","。",
                    "例如","现在的","美国","，","只有","2%的人口","以农业","为生","，","但","仅仅就是","这2%","，","不仅","养活了","整个美国的","人口","，","还有","剩余粮食","可以","出口到","世界各地","。",
                    "如果没有","农业","工业化","，","就不会有","足够的","人力","来办公","思考","和从事","工厂劳动","，","也就","不可能有","都市里的","工业革命","。",
                    "正是因为","农业","释放出了","数十亿的","人力","，","由工厂","和办公室","吸纳","，","才开始像","雪崩一样","有各种","新产品","倾泻而出","。",
                    "比起以前","，","人类","生产出","更多","钢铁","，","制作出","更多","服装","，","兴建出","更多","建筑","，","还制造出","令人","瞠目结舌、","超出想象的","各种产品","，","像是灯泡、","手机、","数码相机","和洗碗机","。",
                    "人类","有史以来","第一次","，","生产","超出了","需求","。",
                    "也是","因为如此","，","产生了","一个全新的","问题","：","谁要来","买","这些产品","？",
                    "小标题","：","血拼的","年代","。",
                    "现代","资本主义经济","如果","想要存活","，","就得不断","提高产量","。",
                    "然而","，","光是","生产","还不够","。",
                    "生产出来","之后","，","还得","有人买","，","否则","业者","或投资人","都得","关门大吉","。",
                    "为了","避免","这种灾难","，","确保","不管什么","新产品","都有人","买账","，","就出现了","一种新的","伦理观","：","消费主义","。",
                    "有史以来","，","人类的","生活","多半","颇为困窘","，","因此","节俭","就成了","过去","所高喊的","口号","，","像是","清教徒","或","斯巴达人","，","都以","简朴","律己","而闻名","。",
                    "所以","，","如果是","正直的人","，","就该","避免","奢侈、","从来不","浪费","食物","，","裤子破了","该缝缝补补","，","而不是去","买条新的","。",
                    "然而","，","消费主义的","美德","就是","消费更多的","产品","和服务","，","鼓励","所有人","应该","善待自己、","宠爱自己","，","就算因为","过度消费","而慢慢","走上绝路","，","也是","在所不惜","。",
                    "在这里","，","节俭","就像是一种","该赶快治疗的","疾病","。",
                    "现在","我们","很容易","在身边","找到","各种","鼓励消费的","广告","。",
                    "在历史上的","大多数时候","，","各种","鼓励","消费伦理的","文案","不但","无法引起","消费欲望","，","反而还会","激起","极度的","反感","。",
                    "在","过去的人","眼中","，","这种内容","真是","自私、","堕落、","道德沦丧","！",
                    "消费主义","除了","自身","非常努力","，","还在","大众心理学的","推波助澜之下","，","不断","说服","大众","：","放纵","对你有益","，","而节俭是","自我压抑","。",
                    "而且","，","这套理论","已经","成功了","。",
                    "我们","都成了","乖巧的","消费者","，","买了","无数种","我们","并不真正","需要的","产品","，","而且","有的","根本就是","昨天才","知道的","。",
                    "制造商","设计","产品的","时候","，","刻意","让它","在一段","短时间后","就被淘汰","；",
                    "而且","就算","旧型号","明明","就足以","满足","各种需求","，","厂商","还是会","不断推出","新型号","，","我们","如果","不跟进","，","就仿佛","显得","落伍","。",
                    "购物","已成为","人类最喜爱的","消遣","，","而且","消费性产品","也成了","家人、","朋友、","配偶之间","不可或缺的","中介","。",
                    "各种","宗教节日","，","例如","圣诞节","，","都已经","成了","购物节","。",
                    "消费主义","伦理","开枝散叶","，","在食品市场","表现得","最为明显","。",
                    "在过去的","传统农业社会","，","饥荒的","阴影","总是","挥之不去","。",
                    "但到了","今日的","富裕世界","，","一大","健康问题","却成了","肥胖","，","而且","对穷人的","冲击","更大于","富人","。",
                    "因为","富人","懂得选择","有机沙拉","和水果奶昔","，","但穷人","常常是","大啖","汉堡、","比萨","。",
                    "美国","每年","为了节食","所花的钱","，","已经","足以养活","其他地方","所有","正在挨饿的人","。",
                    "肥胖","这件事","，","可以说是","消费主义的","双重胜利","。",
                    "一方面","，","如果大家","吃得太少","，","就会导致","经济萎缩","，","这可不妙","；",
                    "另一方面","，","大家","吃多了","之后","，","就得购买","减肥产品","，","再次","促进","经济成长","。",
                    "然而","，","如果","根据","商人的","资本主义","伦理","，","所有的","利润","都该","再投入","生产","而不是","白白浪费","，","这样一来","，","消费主义","伦理","和资本主义","道德","该如何","共存","？",
                    "没问题","！",
                    "就像","过去的","年代","，","今天也有","精英分子","和一般大众的","劳力分工","。",
                    "在","中世纪","欧洲","，","贵族","浪掷千金、","尽享奢华","，","而农民","则是","省吃俭用、","锱铢必较","。",
                    "但今天","情况","正相反","。",
                    "大富豪","管理资产","和投资","非常谨慎","，","反而是","没那么","有钱的人","，","买起","没那么","需要的","汽车","和电视机","却毫不手软","。",
                    "资本主义","和消费主义的","伦理","可以说是","一枚硬币的","正反两面","，","将这","两种秩序","合而为一","。",
                    "有钱人的","最高","指导原则是","投资","，","而我们这些","其他人的","最高","指导原则","则是","购买","。",
                    "这种","资本","/","消费主义的","伦理","，","还有","另一个","革命性的","意义","。",
                    "过去的","伦理体系","，","常常要求","人类","做些","难如登天的事","，","告诉他们","照做","就能","上天堂","。",
                    "但","总是要求","他们","慈悲、","宽容","，","克服","各种欲望","和愤怒","，","还得","放下","己身的","私利","。",
                    "这对","大多数人","来说","实在太过","强人所难","。",
                    "所以","翻开","伦理道德的","历史","，","虽然","会看到","许多美妙的","理想","，","但","遗憾的是","几乎","没人能","做到","。",
                    "大多数","基督徒的","作为","不像","基督","，","大多数","佛教徒","没听","佛陀的话","，","大多数","儒家子弟","可能会","让孔子","频频摇头","。",
                    "但今天的","情况","有所不同了","，","大多数人","都能","轻松达到","资本","/","消费主义的","理想","。",
                    "想要","进入","这种","新伦理","所承诺的","天堂","，","条件就是","有钱人","应该","继续","贪婪下去","，","把时间","投入","赚更多的钱","，","至于","一般大众","则是要","尽情满足","自己的","欲望","和热情","，","想要什么","就买什么","。",
                    "这是人类","有史以来","第一次","，","信众","终于","真的能够","做到","宗教要求的","条件","。",
                    "只不过","，","我们","又怎么","知道","它承诺的","天堂是","什么样子","？",
                    "答案是","：","看看电视","，","你就知道","。"},{"测试"},{"测试"},{"测试"}}
    };
    /* public String[] word_text = {"理想国","涉及","柏拉图","思想体系的","各个方面","，","包括哲学、","伦理、","教育、","文艺、","政治等内容","，","主要是","探讨","理想国家的","问题","。",
            "理想国一书","是柏拉图的","一篇","重要对话录","，","对话录里","柏拉图","以苏格拉底之口","通过","与其他人","对话的方式","设计了一个","真、善、美","相统一的政体","，","即可以","达到","公正的","理想国","。",
            "柏拉图的","理想国","是人类历史上","最早的","乌托邦","。",
            "在他的理想国里","统治者","必须是","哲学家","，","他认为","现存的","政治","都是坏的","，","人类的","真正出路","在于","哲学家","掌握政权","也只有","真正的","哲学家","才能拯救","当时","城邦所处的","危机","。",
            "这种信念","构成了","柏拉图","成熟的","政治哲学体系的","核心","。",
            "在他的眼里","“哲学家”","有着","特殊的内涵","。",
            "他认为","哲学家是","最高尚、","最有学识的人","，","而这种","贤人统治下的","贤人政体","就是","最好的政体","。",
            "所以","，","只有","建立","以哲学家","为国王的","国家","才是","最理想的","国家","。",
            "这个国家","就是","存在于","天上的","模范国家","。"};*/
    public int[][][] num_words_in_sentence = {{{1},{1},{1},{1}},
    {{13, 21, 17, 15, 16, 8, 18, 10, 11, 13, 19, 3, 6, 14, 11, 22, 11, 5, 2, 11, 12, 9, 21, 9, 15, 8, 7, 21, 16, 6, 16, 18, 11, 21, 14, 12, 18, 10, 15, 12, 4, 11, 8, 8, 15, 4, 8, 11, 11, 15, 9, 20, 14, 9, 14, 8, 11, 5, 10, 17, 12, 22, 10, 9, 12, 9, 13, 24, 9, 11, 9, 18, 4, 6},
            {1},{1},{1}},
            {{1},{1},{1},{1},{1}},
            {{4, 9, 11, 13, 5, 7, 13, 8, 6, 8, 13, 5, 6, 10, 7, 13, 19, 17, 14, 19, 10, 8, 15, 19, 8, 8, 12, 21, 7, 10, 22, 5, 27, 21, 6, 22, 12, 17, 20, 12, 14, 13, 16, 15, 12, 8, 16, 9, 13, 21, 6, 14, 11, 9, 20, 10, 7, 15, 15, 11, 9, 4, 14, 4, 13, 11, 20},
                    {1},{1},{13, 7, 6, 20, 10, 8, 13, 13, 19, 7, 19, 10, 16, 15, 24, 17, 16, 26, 8, 11, 5, 8, 6, 12, 16, 24, 18, 23, 7, 9, 16, 10, 19, 6, 18, 11, 21, 14, 10, 8, 8, 15, 12, 11, 7, 10, 13, 25, 2, 9, 13, 4, 16, 11, 12, 11, 13, 15, 6, 16, 17, 12, 28, 11, 9, 6},{1},{1},{1}}};
    /*public int[] num_words_in_sentence = {17, 20, 6, 23, 7, 5, 11, 11, 6};*/
    public int[][] num_page() {
        int[][] result = new int[rawtext.length][];
        for (int i = 0; i < result.length; i++) {
            result[i] = new int[rawtext[i].length];
            for (int j = 0; j < result[i].length; j++) {
                int sum = Arrays.stream(num_words_in_sentence[i][j]).sum();
                int page_c = ((sum-1)/ (MyView.num_row * MyView.num_col)) +1;
                if (page_c < 0) {
                    page_c = 0;
                }
                result[i][j] = page_c;
            }
        }
        return result;
    }

    public void punc_word_text(String[] text) {
        for (int i = 0; i < text.length; i++) {
            text[i] = text[i].replaceAll("，","逗号");
            text[i] = text[i].replaceAll("。","句号");
            text[i] = text[i].replaceAll("!","感叹号");
            text[i] = text[i].replaceAll("？","问号");
            text[i] = text[i].replaceAll("；","分号");
            text[i] = text[i].replaceAll("（","括号");
            text[i] = text[i].replaceAll("）","括号");
            text[i] = text[i].replaceAll("：","冒号");
        }
    }
}
