package com.blindreader;

import android.util.Log;

import java.util.Arrays;
import java.util.stream.IntStream;

public class Text {
    private static final String TAG = "order";
    /*public String[][] title = {{"人类：一种也没什么特别的动物","知善恶树","亚当和夏娃的一天","毁天灭地的人类洪水"},
            {"史上最大骗局","盖起金字塔","记忆过载","历史从无正义"},
            {"历史的方向","金钱的味道","帝国的愿景","宗教的法则","成功的秘密"},
            {"发现自己的无知","科学与帝国的联姻","资本主义教条","工业的巨轮","一场永远的革命","从此过着幸福快乐的日子","智人末日"}
    };*/
    //public String[] chap_title = {"认知革命","农业革命","人类的融合统一","科学革命"};

    public String[] chap_title = {
            "刑法基础知识",
            "犯罪",
            "刑罚"};

    public String[][] title = {
            {"刑法的起源",
            "刑法是道德伦理的最低要求",
            "不受约束的刑罚权，比犯罪更可怕",
            "四",
            "五",
            "六",
            "七","八","九","十","十一","十二","十三"},
            {Integer.toString(14),
                    Integer.toString(15),
                    Integer.toString(16),
                    Integer.toString(17),
                    Integer.toString(18),
                    Integer.toString(19),
                    Integer.toString(20),
                    Integer.toString(21),
                    Integer.toString(22),
                    Integer.toString(23),
                    Integer.toString(24),
                    Integer.toString(25),
                    Integer.toString(26),
                    Integer.toString(27),
                    Integer.toString(28),
                    Integer.toString(29),
                    Integer.toString(30),
                    Integer.toString(31),
                    Integer.toString(32)
            },
            {
                "刑罚体系",
                    Integer.toString(34),
                    Integer.toString(35),
                    Integer.toString(36),
                    Integer.toString(37),
                    Integer.toString(38),
                    Integer.toString(39),
                    Integer.toString(40),
                    Integer.toString(41)
            }
    };
    /*
    public String[][] rawtext = {{"测试","测试","测试","测试"},{"人类曾有长达250万年的时间靠采集及狩猎维生，并不会特别干预动植物的生长情形。" +
            "虽然智人从东非来到中东、欧洲、亚洲，最后到了澳大利亚和美洲，但不管他们到了什么地方，仍然就是靠野生的动植物维生。" +
            "毕竟，如果现在的生活方式就吃得饱，社会结构、宗教信仰、政治情况也都稳定多元，何必自找麻烦改来改去/？" +
            "这一切在大约1万年前全然改观，人类开始投入几乎全部的心力，操纵着几种动植物的生命。" +
            "从日升到日落，人类忙着播种、浇水、除草、牧羊，一心以为这样就能得到更多的水果、谷物和肉类。" +
            "这是一场关于人类生活方式的革命：农业革命/。" +
            "学者曾经以为农业就是起源于中东，再传布到全球各地，但现在则认为农业是同时间在各地独自发展而开花结果。" +
            "到了公元1世纪，全球大多数地区的绝大多数人口都从事农业/。" +
            "学者曾宣称农业革命是人类的大跃进，是由人类脑力所推动的进步故事。" +
            "他们说演化让人越来越聪明，解开了大自然的秘密，于是能够驯化绵羊、种植小麦。" +
            "等到这件事发生，人类就开开心心地放弃了狩猎采集的艰苦、危险、简陋，安定下来，享受农民愉快而饱足的生活/。" +
            "这个故事只是幻想。" +
            "并没有任何证据显示人类越来越聪明。" +
            "农业革命所带来的非但不是轻松生活的新时代，反而让农民过着比采集者更辛苦、更不满足的生活。" +
            "狩猎采集者的生活其实更为丰富多变，也比较少会碰上饥饿和疾病的威胁。" +
            "确实，农业革命让人类的食物总量增加，但量的增加并不代表吃得更好、过得更悠闲，反而只是造成人口爆炸，而且产生一群养尊处优、娇生惯养的精英分子。" +
            "普遍来说，农民的工作要比采集者更辛苦，而且到头来的饮食还要更糟。" +
            "农业革命可说是史上最大的一桩骗局/。" +
            "谁该负责？" +
            "这背后的主谋，既不是国王，不是牧师，也不是商人。" +
            "真正的主要嫌疑人，就是那极少数的植物物种，其中包括小麦、稻米和马铃薯。" +
            "人类以为自己驯化了植物，但其实是植物驯化了智人/。" +
            "如果我们用小麦的观点来看看农业革命这件事，在1万年前，小麦也不过就是许多野草当中的一种，只出现在中东一个很小的地区。" +
            "但就在短短1000年内，小麦突然就传遍了世界各地。" +
            "生存和繁衍正是最基本的演化标准，而根据这个标准，小麦可以说是地球史上最成功的植物。" +
            "究竟，这种野草是怎么从无足轻重变成无所不在/？" +
            "小麦的秘诀就在于操纵智人、为其所用。" +
            "智人这种猿类，原本靠着狩猎和采集过着颇为舒适的生活，直到大约1万年前，才开始投入越来越多的精力来培育小麦。" +
            "而在接下来的几千年间，全球许多地方的人类都开始种起小麦，从早到晚只忙这件事就已经焦头烂额。" +
            "种小麦可不容易，照顾起来处处麻烦。" +
            "第一，小麦不喜欢大小石头，所以智人得把田地里的石头捡干净搬出去，搞得腰酸背痛。" +
            "第二，小麦不喜欢与其他植物分享空间、水和养分，所以我们看到男男女女在烈日下整天除草。" +
            "第三，小麦会得病，所以智人得帮忙驱虫防病。" +
            "第四，不论是蝗虫还是兔子，都不排斥饱尝一顿小麦大餐，但小麦完全无力抵抗，所以农民又不得不守卫保护。" +
            "最后，小麦会渴，所以人类得从涌泉或溪流大老远把水引来，为它止渴；" +
            "小麦也会饿，所以智人甚至得收集动物粪便，用来滋养小麦生长的土地/。" +
            "智人的身体演化目的并不是为了从事这些活动，我们适应的活动是爬爬果树、追追瞪羚，而不是弯腰清石块、努力挑水桶。" +
            "于是，人类的脊椎、膝盖、脖子和脚底就得付出代价。" +
            "研究古代骨骼发现，人类进到农业时代后出现了大量疾病，例如椎间盘突出、关节炎和疝气。" +
            "此外，新的农业活动得花上大把时间，人类就只能被迫永久定居在麦田旁边。" +
            "这彻底改变了人类的生活方式。" +
            "其实不是我们驯化了小麦，而是小麦驯化了我们。" +
            "驯化一词来自拉丁文，意思就是房子。" +
            "但现在关在房子里的可不是小麦，而是智人/。" +
            "小麦究竟做了什么，才让智人放弃了本来很不错的生活，换成另一种悲惨的生活方式？" +
            "它提供了什么报酬？" +
            "就智人的饮食来说，其实并没有更好。" +
            "别忘了，人类原本就是种杂食的猿类，吃的是各式各样的食物。" +
            "在农业革命之前，谷物不过是人类饮食的一小部分罢了。" +
            "而且，以谷物为主的食物不仅矿物质和维生素含量不足、难以消化，还对牙齿和牙龈大大有害/。" +
            "而就民生经济而言，小麦也并未带来经济安全。" +
            "一直到最近为止，农业社会绝大多数饮食靠的还是寥寥无几的少数几种农业作物，很多地区甚至只有一种主食，例如小麦、马铃薯或稻米。" +
            "所以，如果缺水、来了蝗灾又或是爆发真菌感染，贫农死亡人数甚至有可能达到百万/。" +
            "再就人类暴力而言，小麦也没办法提供人身安全。" +
            "过去，如果采集者的部落遇到比较强的对手，只要撤退搬家就能解决。" +
            "虽然说有些困难和危险，但至少是个可行的选项。" +
            "但如果是农民遇到了强敌，撤退就代表着得放弃田地、房屋和存粮。" +
            "很多时候这几乎就注定了饿死一途。" +
            "因此，农民常常得死守田地，双方拼个你死我活/。" +
            "慢慢地，人类发展出进阶的社会结构，如城市、王国、国家，于是人类的暴力也得到了控制。" +
            "不过，这样庞大而有效的政治结构可是足足花了数千年，才终于建立起来/。" +
            "当然，农村生活确实为第一代农民带来了一些直接的利益，像是比较不需要担心野兽袭击、风吹雨淋，但对一般人来说，可能其实弊大于利。" +
            "纵观历史，对于个人来说，小麦根本算不上给了什么。" +
            "但对于智人这个物种整体来说，小麦的影响就十分深远。" +
            "种植小麦，每单位土地就能提供更多食物，于是智人的数量也呈指数成长。" +
            "但人口密度也因此增大，也会因此产生一系列负面影响/。" +
            "如果要衡量某种物种演化成功与否，评断标准就在于世界上其DNA螺旋的拷贝数的多寡。" +
            "如果世界上不再有某物种的DNA拷贝，就代表该物种已经绝种，而如果某个物种还有许多个体带着它的DNA拷贝存在这个世上，就代表着这个物种演化成功、欣欣向荣。" +
            "从这种角度看来，1000份DNA拷贝永远都强过100份。" +
            "这正是农业革命真正的本质：让更多的人却以更糟的状况活下去/。" +
            "但是，身为个人，为什么要管这种演化问题？" +
            "如果有人说，为了增加智人基因组在世界上的拷贝数，希望你降低自己的生活水平，你会同意吗？" +
            "没有人会同意这笔交易。" +
            "简单说来，农业革命就是一个陷阱/。","测试","测试","测试"},
            {"测试","测试","测试","测试","测试"},
            {"小标题：不知为不知。" +
                    "至少在认知革命之后，人类就很希望能了解这个世界。" +
                    "我们的祖先投入大量时间和精力，希望能找出支配自然界的法则。" +
                    "然而，现代科学与先前的知识体系有三大不同之处：1，愿意承认自己的无知。" +
                    "现代科学的基础就是承认无知。" +
                    "从这种立场，我们承认了自己并非无所不知。" +
                    "更重要的是，我们也愿意在知识进展之后，承认过去相信的可能是错的。" +
                    "于是，再也没有什么概念、想法或理论是神圣不可挑战的。" +
                    "2，以观察和数学为中心。" +
                    "承认无知之后，现代科学还希望能获得新知。" +
                    "方式则是通过收集各种观察值，再用数学工具整理连接，形成全面的理论。" +
                    "3，取得新能力。" +
                    "光是创造理论，对现代科学来说还不够。" +
                    "它希望能够运用这些理论来取得新的能力，特别是发展出新的科技。" +
                    "科学革命并不是知识的革命，而是无知的革命。" +
                    "真正让科学革命起步的伟大发现，就是发现：人类对于最重要的问题其实毫无所知/。" +
                    "对于像是伊斯兰教、基督教、佛教、儒教这些前现代知识体系来说，它们假设世上所有重要的事情都已经为人或为神所知。" +
                    "这些全知者可能是某些伟大的神、某个全能的神或是某些过去的智者，通过经典或口传，将这些智慧传给后人。" +
                    "而对于平民百姓而言，重点就是要钻研这些古籍和传统，正确加以理解，就能获得知识。" +
                    "在当时，如果说圣经、古兰经或吠陀经居然漏了某些宇宙的重大秘密，而这个秘密又居然能被一般血肉之躯的人给发现，这简直是不可思议的事/。" +
                    "对古老的知识体系来说，只会承认两种无知的可能。" +
                    "第一种，个人可能不知道某些重要的事。" +
                    "要取得必要的知识，他该做的就是去问那些更聪明的人，而不是去寻找什么还没有人知道的事。" +
                    "例如，如果有一位13世纪的英格兰农夫，想知道人类究竟是怎么来的，他会认为基督教知识体系一定能有明确的答案。" +
                    "所以，他该做的就是去请教当地的牧师/。" +
                    "第二种，整个知识体系可能不知道一些不重要的事。" +
                    "就当时的定义来说，伟大的神祇或智者都懒得告诉我们的事，一定是不重要的。" +
                    "例如，假设我们这位英格兰农民又想知道蜘蛛是怎么结网的，他去问牧师也没用，因为任何的基督教经典都不会提到这个问题的答案。" +
                    "然而，这绝对不代表基督教有什么缺陷。" +
                    "反而是代表蜘蛛怎么结网这件事根本不重要，人类无须知道。" +
                    "毕竟，上帝一定知道蜘蛛怎么结网，而如果这件事这么重要、会影响到人类的繁荣和救赎，上帝怎么可能不在圣经里面有完整的解释/？" +
                    "基督教并不会禁止民众研究蜘蛛。" +
                    "但研究蜘蛛的学者（如果中世纪欧洲真的有人研究蜘蛛的话）就必须有心理准备，知道自己在社会就是处于边缘角色，而且不管研究结果为何，基督教永远都是对的。" +
                    "所以，不管学者研究的是蜘蛛、蝴蝶，还是加拉帕戈斯雀，都只会被视为是无关痛痒的事，不会影响到社会、政治和经济的基本真理/。" +
                    "事实上，事情永远没那么简单。" +
                    "就算是最虔诚、最保守的时代，还是会有人认为，一定有什么重要的事，是整个知识体系所不知道的，但这种人常常就会被边缘化或遭受迫害；" +
                    "但也有可能，他们就会开创一个新的体系，开始宣称只有他们才知道所有该知道的事。" +
                    "举例来说，穆罕默德宗教生涯的第一步，就是谴责他的阿拉伯同胞，说他们对于真正神圣的真理一无所知。" +
                    "穆罕默德很快就宣称只有自己知道全部的真相，而信众也开始称呼他为先知的封印（意为所有先知到此为终结）。" +
                    "于是，所有的启示当然也就是到了穆罕默德为止，再也没什么重要的了/。" +
                    "现代科学是一套独特的知识体系，独特之处也就在于公开承认这整套体系都对一些最重要的问题一无所知。" +
                    "达尔文从来没有说过自己是生物学家的封印，说自己已经完全解开了生命的谜团。" +
                    "经过几个世纪的大规模科学研究，生物学家承认，他们还是无法完整解释为什么大脑能够产生意识。" +
                    "物理学家也承认，他们不知道什么引起了宇宙大爆炸，也不知道如何让量子力学与广义相对论结合起来/。" +
                    "也有些时候，因为不断有新证据出现，各种科学理论也就互相交锋、战火热烈。" +
                    "一个典型的例子，就是究竟哪种经济模式最好。" +
                    "虽然每个经济学家都可能会说自己的模式最恰当，但每次出现金融危机和股市泡沫，我们就会看到主流改变；" +
                    "目前一般公认，我们还是不知道最佳的经济模式究竟为何/。" +
                    "还有些时候，因为现有的证据强力支持某些理论形成主流，于是其他理论就被冷落。" +
                    "虽然我们一般认定主流理论为真，但每个人也都同意，如果新证据出现而与主流理论相违背，主流理论也就需要修正甚至是淘汰。" +
                    "像是板块构造理论和演化论就属于这种例子/。" +
                    "现代科学愿意承认自己的无知，就让它比所有先前的知识体系更具活力、更有弹性，也更有求知欲。" +
                    "这一点大幅提升了人类理解世界如何运作的能力，以及创造新科技的能力。" +
                    "然而，这也给人类带来祖先多半无须面对的一个严重问题。" +
                    "就现在这个体系而言，我们假设自己并非无所不知，现有的知识也并未定案，但这也同样适用于那些让数百万人得以有效合作的虚构故事。" +
                    "如果证据显示许多这些故事都大有问题，社会岂不是要崩溃了？" +
                    "要怎样才能让社会、国家和国际体系继续维持运作/？" +
                    "正因如此，现代想要维持社会政治秩序稳定，只能靠着两种不科学的方法，其他别无选择。" +
                    "1，虽然采用科学理论，但必须违反一般科学做法：宣称这就是绝对的真理。" +
                    "纳粹就是采用这种方式，声称他们的种族政策是来自生物事实的推论。" +
                    "2，不要采取科学方法，而诉诸非科学的绝对真理。" +
                    "这一直是自由人文主义的策略。" +
                    "自由人文主义的基础在于坚持主张人类的特殊价值和权利，但很尴尬的是，对智人的科学研究并不认同这种看法。" +
                    "但我们也不该太过惊讶。" +
                    "毕竟，科学还是得倚靠着种种宗教和意识形态信仰，才能取得经费，并将研究正当化/。" +
                    "不论如何，现代文化已经比过去任何文化都更愿意承认自己的无知。" +
                    "而现代社会之所以还能够维系，原因之一就在于对科技和科学研究方法的信任，这几乎成了类似宗教的信仰，甚至在一定程度上也取代了对绝对真理的信念/。",
            "测试","测试",
                    "工业革命为人类带来了前所未有的种种能源和原料，不仅种类丰富，而且价格低廉。" +
                    "结果就是人类的生产力有了爆炸性的发展。" +
                    "首先引爆、影响也最深的就是农业。" +
                    "一般情况下，我们想到工业革命，脑中浮现的画面就是一片都市景象、冒着烟的烟囱，或者是一群煤矿工人汗流浃背，深入地底辛苦工作。" +
                    "然而，工业革命最重要的一点，其实在于它就是第二次的农业革命/。" +
                    "过去两百年间，工业化生产成了农业的支柱。" +
                    "过去得靠肌肉力量或根本做不到的事情，现在都由像是曳引机之类的机器接手。" +
                    "由于有了化学肥料、工业杀虫剂和各种激素及药物，无论是农地还是家禽家畜的产量都大幅跃进。" +
                    "而有了冰箱、船舶和飞机之后，各种农产品能够保存长达数个月，而且也能快速、廉价地运送到世界的另一头。" +
                    "欧洲人开始能够大啖新鲜美味的阿根廷牛肉和日本寿司/。" +
                    "如果将所有数字加总，全球随时都有数十亿只家禽家畜就像活在工厂生产线上，而每年宰杀总数更达到百亿。" +
                    "采用工业化的禽畜饲养方式后，农业生产量和人类粮食储备量大幅增长。" +
                    "像这种工业化的畜牧业， 再加上农作物种植的机械化，就成了整个现代社会经济秩序的基础。" +
                    "随着农业工业化，只需要越来越少的农民数量，就足以养活越来越多的办公或工厂人口。" +
                    "例如现在的美国，只有2%的人口以农业为生，但仅仅就是这2%，不仅养活了整个美国的人口，还有剩余粮食可以出口到世界各地。" +
                    "如果没有农业工业化，就不会有足够的人力来办公思考和从事工厂劳动，也就不可能有都市里的工业革命/。" +
                    "正是因为农业释放出了数十亿的人力，由工厂和办公室吸纳，才开始像雪崩一样有各种新产品倾泻而出。" +
                    "比起以前，人类生产出更多钢铁，制作出更多服装，兴建出更多建筑，还制造出令人瞠目结舌、超出想象的各种产品，像是灯泡、手机、数码相机和洗碗机。" +
                    "人类有史以来第一次，生产超出了需求。" +
                    "也是因为如此，产生了一个全新的问题：谁要来买这些产品/？" +
                    "小标题：血拼的年代。" +
                    "现代资本主义经济如果想要存活，就得不断提高产量。" +
                    "然而，光是生产还不够。" +
                    "生产出来之后，还得有人买，否则业者或投资人都得关门大吉。" +
                    "为了避免这种灾难，确保不管什么新产品都有人买账，就出现了一种新的伦理观：消费主义/。" +
                    "有史以来，人类的生活多半颇为困窘，因此节俭就成了过去所高喊的口号，像是清教徒或斯巴达人，都以简朴律己而闻名。" +
                    "所以，如果是正直的人，就该避免奢侈、从来不浪费食物，裤子破了该缝缝补补，而不是去买条新的。" +
                    "然而，消费主义的美德就是消费更多的产品和服务，鼓励所有人应该善待自己、宠爱自己，就算因为过度消费而慢慢走上绝路，也是在所不惜。" +
                    "在这里，节俭就像是一种该赶快治疗的疾病/。" +
                    "现在我们很容易在身边找到各种鼓励消费的广告。" +
                    "在历史上的大多数时候，各种鼓励消费伦理的文案不但无法引起消费欲望，反而还会激起极度的反感。" +
                    "在过去的人眼中，这种内容真是自私、堕落、道德沦丧！" +
                    "消费主义除了自身非常努力，还在大众心理学的推波助澜之下，不断说服大众：放纵对你有益，而节俭是自我压抑/。" +
                    "而且，这套理论已经成功了。" +
                    "我们都成了乖巧的消费者，买了无数种我们并不真正需要的产品，而且有的根本就是昨天才知道的。" +
                    "制造商设计产品的时候，刻意让它在一段短时间后就被淘汰；" +
                    "而且就算旧型号明明就足以满足各种需求，厂商还是会不断推出新型号，我们如果不跟进，就仿佛显得落伍。" +
                    "购物已成为人类最喜爱的消遣，而且消费性产品也成了家人、朋友、配偶之间不可或缺的中介。" +
                    "各种宗教节日，例如圣诞节，都已经成了购物节/。" +
                    "消费主义伦理开枝散叶，在食品市场表现得最为明显。" +
                    "在过去的传统农业社会，饥荒的阴影总是挥之不去。" +
                    "但到了今日的富裕世界，一大健康问题却成了肥胖，而且对穷人的冲击更大于富人。" +
                    "因为富人懂得选择有机沙拉和水果奶昔，但穷人常常是大啖汉堡、比萨。" +
                    "美国每年为了节食所花的钱，已经足以养活其他地方所有正在挨饿的人。" +
                    "肥胖这件事，可以说是消费主义的双重胜利。" +
                    "一方面，如果大家吃得太少，就会导致经济萎缩，这可不妙；" +
                    "另一方面，大家吃多了之后，就得购买减肥产品，再次促进经济成长/。" +
                    "然而，如果根据商人的资本主义伦理，所有的利润都该再投入生产而不是白白浪费，这样一来，消费主义伦理和资本主义道德该如何共存？" +
                    "没问题！" +
                    "就像过去的年代，今天也有精英分子和一般大众的劳力分工。" +
                    "在中世纪欧洲，贵族浪掷千金、尽享奢华，而农民则是省吃俭用、锱铢必较。" +
                    "但今天情况正相反。" +
                    "大富豪管理资产和投资非常谨慎，反而 是没那么有钱的人，买起没那么需要的汽车和电视机却毫不手软/。" +
                    "资本主义和消费主义的伦理可以说是一枚硬币的正反两面，将这两种秩序合而为一。" +
                    "有钱人的最高指导原则是投资，而我们这些其他人的最高指导原则则是购买/。" +
                    "这种资本/消费主义的伦理，还有另一个革命性的意义。" +
                    "过去的伦理体系，常常要求人类做些难如登天的事，告诉他们照做就能上天堂。" +
                    "但总是要求他们慈悲、宽容，克服各种欲望和愤怒，还得放下己身的私利。" +
                    "这对大多数人来说实在太过强人所难。" +
                    "所以翻开伦理道德的历史，虽然会看到许多美妙的理想，但遗憾的是几乎没人能做到。" +
                    "大多数基督徒的作为不像基督，大多数佛教徒没听佛陀的话，大多数儒家子弟可能会让孔子频频摇头/。" +
                    "但今天的情况有所不同了，大多数人都能轻松达到资本/消费主义的理想。" +
                    "想要进入这种新伦理所承诺的天堂，条件就是有钱人应该继续贪婪下去，把时间投入赚更多的钱，至于一般大众则是要尽情满足自己的欲望和热情，想要什么就买什么。" +
                    "这是人类有史以来第一次，信众终于真的能够做到宗教要求的条件。" +
                    "只不过，我们又怎么知道它承诺的天堂是什么样子？" +
                    "答案是：看看电视，你就知道/。","测试","测试","测试"}};
    */

    public String[][] rawtext = {
            {
                    "测试",
                    "测试",
                    "不受约束的刑罚权，比犯罪更可怕/。" +
                    "刑法规定了犯罪和刑罚，刑罚是对犯罪的惩罚，而刑法则是对刑罚的约束/。" +
                    "从表面上看，“刑”字从刀，拿人开刀，把开刀的依据合法化就叫刑法，但是如果只是为了惩罚犯罪，真的需要刑法吗/？" +
                    "有一位女士网上发帖，说有两个同村的村民，在她小学7岁的时候就强暴她，现在她才敢出来向公安机关举报。" +
                    "这两个男子在公安机关也承认有过强奸行为，但这个案件已经过了21年，公安机关会处理此案吗/？" +
                    "如果没有刑法，该案能够打击吗？" +
                    "当然可以，法官拍案而起，下令把这种人渣拖出去，犬决。" +
                    "但有了刑法，该案却无法处理，因为现行刑法规定追诉时效最长是20年，只有可能判死刑和无期徒刑的犯罪才可以报最高人民检察院核准追诉。" +
                    "而本案并不属于可以核准追诉的情节，按照刑法规定，它的追诉时效是15年/。" +
                    "可见，如果只想惩罚犯罪的话，根本没必要制定刑法，刑法往往束缚了国家打击犯罪的手脚/。" +
                    "另外一个更经典的案件是1998年深圳的邓某驹案。" +
                    "邓某驹年轻有为，30多岁就当上了深圳沙井农村信用合作社主任，不到3年贪污公款2.3亿，包养了5个情妇。" +
                    "凭借我们朴素的情感，对邓某驹应该判处什么刑/？" +
                    "你可能想到了死刑，不杀不足以平民愤。" +
                    "但是邓某驹是农村信用合作社主任，按照刑法规定，他不属于国家工作人员，不构成贪污罪，只能构成职务侵占罪，而职务侵占罪的最高刑是15年有期徒刑，最终邓某驹也确实被判处了15年有期徒刑/。" +
                    "你觉得，刑法是惩罚了邓某驹，还是保护了邓某驹/？" +
                    "刑法，不仅惩罚罪犯，也保护罪犯/。" +
                    "刑法的机能不是一元的，而是二元的。" +
                    "刑法既要实现惩罚犯罪的保护机能，也要恪守保障罪犯人权的保障机能/。" +
                    "古话说，“刑不可知，威不可测，则民畏上也”。" +
                    "如果刑法的使命只是打击犯罪，其实没有必要制定成文刑法。" +
                    "它只需存于统治者的内心深处，一种秘而不宣的刑法较之公开明示的法律，更能打击一切所谓危害社会的行为。" +
                    "刑法理论也是简单明快的：因为你实施了危害社会的行为，所以你犯罪了，那么你就要接受包括死刑在内的一切刑罚，至于具体处何刑罚与你无关，这要看法官的心情。" +
                    "这样的话，一切有关谁应该构成犯罪，谁不应该构成犯罪，也就只能依赖于权力者的个人偏好。" +
                    "正如有学者指出，一个国家对付犯罪并不需要刑事法律，没有刑法并不妨碍国家对犯罪的有效打击和镇压。" +
                    "而且没有立法的犯罪打击可能是更加灵活、有效、及时与便利的。" +
                    "如果从这个角度讲，刑法本身是多余和伪善的，它除了在宣传上有美化国家权力的作用外，反而束缚了国家机器面对犯罪的反应速度与灵敏度/。" +
                    "那么，人类为什么要有刑法？" +
                    "这个问题在300年前，欧洲启蒙思想家们作出了回答：刑事法律要遏制的不是犯罪人，而是国家。" +
                    "也就是说，尽管刑法规范的是犯罪及其刑罚，但它针对的对象却是国家/。" +
                    "刑杀之权是一种由国家垄断的暴力。" +
                    "权力导致腐败，绝对权力导致绝对腐败。" +
                    "无论哪种政治体制下的国家权力，都有滥用的可能，至善至美的权力只存在幻想之国，世俗的任何权力都不可能没有瑕疵/。" +
                    "莫须有的岳飞案/。" +
                    "南宋绍兴十一年（1142）除夕，年仅39岁的岳飞被宋高宗赐死，罪名为谋反。" +
                    "岳飞被捕时，有人劝他向高宗求情，为岳飞所拒。" +
                    "他说：“上苍有眼，就不会陷忠臣于不义，否则，又能往哪里逃呢？" +
                    "”同为抗金名将的韩世忠一改往日的圆滑与世故，面诘秦桧，认为谋反一事子虚乌有。" +
                    "秦桧支吾其词：“其事体莫须有。" +
                    "”韩世忠怒斥道：“莫须有三字，何以服天下？" +
                    "”岳飞父子后均被处死，遇害之前，岳飞手书八个大字“天日昭昭，天日昭昭”/！" +
                    "在不受约束的国家权力面前，公道正义多么苍白无力。" +
                    "岳飞父子行刑之日，杭州城凄风苦雨，天下冤之，无数人为之泪下。" +
                    "但有冤，又往何申/？" +
                    "如果刑罚权不受法律约束，极度膨胀如利维坦，虽然某些重犯可被处极刑，满足人们刹那的快意，但从此却埋下了一颗定时炸弹，无数良善公民都有可能遭受刑罚，无端罹祸/。" +
                    "欲加之罪，何患无辞，这是一个民族用血和泪换来的对刑法使命的经验总结。" +
                    "岳飞的冤屈告诉我们，比犯罪更可怕的是不受限制的国家权力。" +
                    "在所有的国家权力中，刑罚最为可怕，它直接针对公民的人身、财产和自由，甚至生命，如果这种权力腐化滥用，后果不堪设想。" +
                    "如培根所言，一次犯罪不过是污染了水流，而一次不公正的司法却是污染的水源。" +
                    "在法治社会，刑法不再是刀把子，而是双刃剑，一刃针对犯罪，一刃针对国家权力/。" +
                    "德国法学家拉德布鲁赫，最初是法律实证主义者，认为法律就是人定的规则，不要讨论虚伪缥缈的正义。" +
                    "但是他后来慢慢抛弃了最初的观点，因为他经历了德国第三帝国，也就是纳粹。" +
                    "他深刻地意识到恶法非法，严重偏离正义的人定的规则不能算是法律。" +
                    "他反思刑法，最后留下一句话：“自从有刑法存在，国家代替受害人施行报复时开始，国家就承担着双重责任：正如国家在采取任何行为时，不仅要为社会利益反对犯罪者，也要保护犯罪人不受被害人的报复。" +
                    "现在刑法同样不只反对犯罪人，也保护犯罪人，它的目的不仅在于设立国家刑罚权力，同时也要限制这一权力，它不只是可罚性的缘由，也是它的界限，因此表现出悖论性：刑法不仅要面对犯罪人保护国家，也要面对国家保护犯罪人，不单面对犯罪人，也要面对检察官保护市民，成为公民反对司法专横和错误的大宪章。",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试"
            },
            {
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试"
            },
            {
                    "刑罚体系/。" +
                    "刑罚是人民法院，也就是审判机关，依法对罪犯适用的限制和剥夺其某种权益的最严厉的强制措施/。" +
                    "刑罚是犯罪行为最主要的法律后果，无罪不罚是刑罚的底线。" +
                    "刑罚作为一种最严厉的惩罚措施，不到万不得已不应该轻易使用/。" +
                    "刑罚为何存在/。" +
                    "人类社会，为什么需要刑罚？" +
                    "历来有两种针锋相对的观点，一种观点认为，因为有犯罪所以需要刑罚；" +
                    "而另一种观点认为，为了没有犯罪所以需要刑罚/。" +
                    "前者立足既往，认为罪犯实施犯罪，本身就应受到惩罚，惩罚具有道德上的正当性，即报应主义思想。" +
                    "而后者关注将来，认为惩罚是为了预防犯罪，对社会有积极的作用，此乃功利主义思想/。" +
                    "报应主义的代表人物是德国哲学家康德。" +
                    "他认为人在自由意志的选择下，避善从恶实施犯罪，从道义的立场上必须承担责任。" +
                    "因为理性的人必须接受内心道德法则的自律，自律是理性自己给自己下达的命令，是一种不可违背的绝对命令，违反绝对命令，必须要承担道义上的责任。" +
                    "这位终身未婚的大哲学家，行动如同时钟一样规律。" +
                    "在他墓碑上铭刻着这样一段话：有两种东西，我们愈是时常愈加反复地思索，它们就愈是给人的心灵灌注了时时翻新，有加无已的赞叹和敬畏——我们头上的无比灿烂星空和心中神圣的道德法则/。" +
                    "对犯罪的惩罚是一种不可违背的绝对命令，为了申明这种报应主义立场，康德举了一个例子。" +
                    "假定在海岛上有一个公民社会，经过所有成员的同意，决定解散，彼此分开，散居世界各地。" +
                    "但如果监狱里还有最后一名谋杀犯，那必须在处死他以后，才能执行解散决定。" +
                    "因为必须让每个人都知道自己言行有应得的报应，也不应把有血债的人留给人民。" +
                    "如果不这样做，所有人将被认为共同参与了谋杀，是对正义的公开违反/。" +
                    "有很多人认为报应主义太野蛮，可能导致刑罚权的滥用，但仔细想一想你会发现，以牙还牙、以眼还眼的这种报应其实是限制了刑罚权，因为你打掉别人一颗牙齿，只能让其打掉一颗牙，你弄瞎他人一只眼，也只用赔上一只眼。" +
                    "在报应主义看来，如果赔上两只眼，刑罚就是过度的。" +
                    "所以，报应主义是限制了刑罚权/。" +
                    "杀人偿命，只有杀人者的生命需要被剥夺，无须株连家人，但是按照预防主义的思路，其实斩草是要除根，以绝后患/。" +
                    "假设某地发生连环杀人案，人心惶惶，领导批示三个月内一定要破案，明天是截止期限，一点线索都没有，怎么办？" +
                    "我们可不可以到死囚库中随便找一个人，让他顶包，换取他家人的荣华富贵。" +
                    "司法机关开出的条件是，让他高考没上线的孩子上名校，让他没工作的老婆当领导。" +
                    "这个死囚难以拒绝这种条件，第二天当着全国民众认罪。" +
                    "这个案件显然起到了震慑民众的效果，很好地预防了犯罪。" +
                    "但这公平吗？" +
                    "不公平，因为它违反了一个基本的铁律，那就是无罪不罚/。" +
                    "刑罚要追求积极的目的/。" +
                    "我国刑法的通说历来是折中说，我们既要向后看，又要向前看，一个是根据，一个是目的/。" +
                    "刑罚的根据一定是已然之罪，因为犯了罪所以受惩罚，重罪重刑，轻罪轻刑，无罪不刑，这是最基本的底线。" +
                    "在一个人没有犯罪的情况下，无论为了达到多美好的目标，都不能惩罚他/。" +
                    "在这个基础上，刑罚追求积极的目的，即犯罪的预防，包括一般预防和特殊预防。" +
                    "一般预防针对普罗大众，要威慑所有人，通俗讲就是杀鸡给猴看；" +
                    "而特殊预防针对犯罪人，剥夺其再犯能力，让他不再犯罪，比如把他关进深牢大狱，这是消极的特殊预防，而积极的特殊预防就是对罪犯进行教育改造，成为守法公民/。" +
                    "刑罚应当在报应基础上追求预防。" +
                    "即便罪犯丧失犯罪能力，他也应该受到最低限度的惩罚。" +
                    "比如张三因为生计抢劫，在被捕前抽中巨奖，又如李四性欲亢奋，实施强奸，后来遭遇车祸，丧失性功能。" +
                    "按照特殊预防的思路，这些人今后可能不会再实施类似犯罪，没有必要浪费刑罚；" +
                    "按照一般预防的思路，完全可以假装宣判，向社会公示这些人已经受到惩罚，而实际上让他们远走高飞，这也可起到威慑作用。" +
                    "但这些做法显然不当，因为它违反了正义的基本要求/。" +
                    "刑罚起源于远古时代的同态复仇，必然带有感性成分。" +
                    "虽说它需要理性的补充，但并不意味着感性就毫无意义。" +
                    "惩罚必须要满足社会公众最基本的正义情感，绝不能让无辜者含冤受屈，让有罪者逍遥法外。" +
                    "民众朴素的正义情感，是刑罚的首要基石/。" +
                    "今天有许多刑法学者，倡导人道主义的刑罚理论，认为报应主义是一种复仇，是野蛮和不道德的。" +
                    "该理论认为，罪犯只是一种病态，需要接受治疗，惩罚变成了治疗。" +
                    "然而，对犯罪人施加的措施，即便称为“治疗”，也和以往称为刑罚的措施具有同样的强制性。" +
                    "在人道主义刑罚理论看来，“应受惩罚性”这个概念应当从刑罚中剥离。" +
                    "我们只需考虑如何矫正罪犯或者制止他人犯罪/。" +
                    "当我们根据应受惩罚性来考量刑罚的正当性，那么刑罚就是一个道德问题，法学也是一种关于权利与义务的科学，法律在原则上不能超越社会良知的约束，每个人都有权利发表看法。" +
                    "但是，当我们以“预防”和“矫正”来替换应受惩罚性的概念，那么，也只有技术专家可以对此做出判断。" +
                    "于是，人道主义刑罚理论将审判从法官转移至技术专家之手。" +
                    "公众朴素的良知有权对法官进行批评，却对这些专家无能为力。" +
                    "专家根本不使用诸如权利或正义这些范畴。" +
                    "他们认为，既然古老的惩罚观念已被抛弃，那么所有报复性动机也应剔除/。" +
                    "犯罪和疾病被等量齐观，意味着专家冠之以“疾病”的心理情况能以犯罪对待，并对其实施强制性的治疗措施。" +
                    "因此，如果一种让政府不满的行为，即便与道德罪性无关，本不应被剥夺自由，政府也可对其“治疗”，而人却无法辩解。" +
                    "比如，有一些心理学专家将宗教视为精神疾病。" +
                    "当这种特别的精神疾病让政府觉得不爽，如何阻止政府实施“矫正”呢？" +
                    "虽然这种矫正明显是强制性的，却披着人道主义的外衣，并不使用让人胆战心惊的“逮捕”之名，而使用“治疗”这种“优雅”的手段。" +
                    "事实上，在德国和意大利，这两个“预防刑”和“矫正刑”的诞生之地，法西斯专政曾经极大地利用了这种所谓的“科学”大行残暴/。" +
                    "“预防刑”的后果更为可怕。" +
                    "当惩罚一个人是为了将其作为对其他人进行威慑的范例，你只是把他作为实现他人目的的工具。" +
                    "这本身就是一件非常邪恶的事情。" +
                    "如果刑罚的正当化基础不再是应受惩罚性，而是预防的有效性，那么惩罚罪犯也就不必要求他真的实施犯罪。" +
                    "正如C.S.刘易斯所言：仁慈只有当其生长于正义岩石的缝隙中，才能开花。" +
                    "若将其移植到人道主义的泥沼，它将变成食人草，而其可怕之处更甚，因为它依然顶着可爱绿植的名字/。" +
                    "因此，刑罚的根据只能是报应，否则刑罚的道德基础将完全坍塌。" +
                    "但是，在这个基础之上，刑罚可以追求积极的目的，在报应的基础上，刑罚是可以具有预防和改造的目的/。",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试",
                    "测试"
            }
    };

    public String[][][] word_text = {
            {
                    {"测试"},
                    {"测试"},
                    {"不受约束的","刑罚权","，","比犯罪","更可怕","。",
                            "刑法","规定了","犯罪","和刑罚","，","刑罚是对","犯罪的","惩罚","，","而刑法","则是对","刑罚的","约束","。",
                            "从","表面上","看","，","刑","字","从","刀","，","拿人","开刀","，","把开刀的","依据","合法化","就叫","刑法","，","但是","如果只是","为了","惩罚","犯罪","，","真的","需要","刑法吗","？",
                            "有一位","女士","网上","发帖","，","说有","两个","同村的","村民","，","在她","小学","7岁的","时候","就强暴她","，","现在","她才敢","出来","向公安机关","举报","。",
                            "这两个","男子","在公安机关","也承认","有过","强奸行为","，","但这个","案件","已经过了","21年","，","公安机关","会处理","此案吗","？",
                            "如果没有","刑法","，","该案","能够","打击吗","？",
                            "当然可以","，","法官","拍案而起","，","下令","把这种","人渣","拖出去","，","犬决","。",
                            "但有了","刑法","，","该案","却无法","处理","，","因为","现行刑法","规定","追诉时效","最长是","20年","，","只有","可能","判死刑","和无期徒刑的","犯罪","才可以","报最高人民检察院","核准","追诉","。",
                            "而本案","并不属于","可以","核准追诉的","情节","，","按照","刑法","规定","，","它的","追诉时效是","15年","。",
                            "可见","，","如果只想","惩罚","犯罪","的话","，","根本","没必要","制定","刑法","，","刑法","往往","束缚了","国家","打击犯罪的","手脚","。",
                            "另外一个","更经典的","案件是","1998年","深圳的","邓某驹案","。",
                            "邓某驹","年轻有为","，","30多岁","就当上了","深圳","沙井","农村信用","合作社","主任","，","不到3年","贪污","公款","2.3亿","，","包养了","5个情妇","。",
                            "凭借","我们","朴素的","情感","，","对邓某驹","应该","判处","什么刑","？",
                            "你可能","想到了","死刑","，","不杀","不足以","平民愤","。",
                            "但是","邓某驹是","农村信用","合作社","主任","，","按照","刑法","规定","，","他不属于","国家","工作人员","，","不构成","贪污罪","，","只能","构成","职务侵占罪","，","而职务侵占罪的","最高刑","是15年","有期徒刑","，","最终","邓某驹","也确实","被判处了","15年","有期徒刑","。",
                            "你觉得","，","刑法是","惩罚了","邓某驹","，","还是","保护了","邓某驹","？",
                            "刑法","，","不仅","惩罚","罪犯","，","也保护","罪犯","。",
                            "刑法的","机能","不是","一元的","，","而是","二元的","。",
                            "刑法","既要","实现","惩罚","犯罪的","保护","机能","，","也要","恪守","保障","罪犯","人权的","保障","机能","。",
                            "古话说","，","“","刑","不可知","，","威","不可测","，","则","民畏上也","”","。",
                            "如果","刑法的","使命","只是","打击犯罪","，","其实","没有必要","制定","成文","刑法","。",
                            "它只需","存于","统治者的","内心深处","，","一种","秘而不宣的","刑法","较之","公开明示的","法律","，","更能打击","一切","所谓","危害","社会的","行为","。",
                            "刑法","理论","也是","简单","明快的","：","因为你","实施了","危害","社会的","行为","，","所以你","犯罪了","，","那么你","就要","接受","包括","死刑","在内的","一切刑罚","，","至于","具体处","何刑罚","与你","无关","，","这要看","法官的","心情","。",
                            "这样的话","，","一切有关","谁应该","构成犯罪","，","谁不应该","构成犯罪","，","也就只能","依赖于","权力者的","个人","偏好","。",
                            "正如","有学者","指出","，","一个国家","对付","犯罪","并不需要","刑事法律","，","没有","刑法","并不妨碍","国家","对犯罪的","有效","打击","和镇压","。",
                            "而且","没有","立法的","犯罪","打击","可能是","更加灵活、","有效、","及时","与便利的","。",
                            "如果","从这个","角度讲","，","刑法","本身是","多余","和伪善的","，","它除了","在宣传上","有美化","国家权力的","作用外","，","反而","束缚了","国家机器","面对","犯罪的","反应速度","与灵敏度","。",
                            "那么","，","人类","为什么","要有","刑法","？",
                            "这个问题","在 300年前","，","欧洲","启蒙思想家们","作出了","回答","：","刑事法律","要","遏制的","不是","犯罪人","，","而是","国家","。",
                            "也就是说","，","尽管","刑法","规范的是","犯罪","及其刑罚","，","但它针对的","对象","却是","国家","。",
                            "刑杀之权","是一种","由国家","垄断的","暴力","。",
                            "权力","导致","腐败","，","绝对权力","导致","绝对腐败","。",
                            "无论哪种","政治体制下的","国家权力","，","都有","滥用的","可能","，","至善至美的","权力","只存在","幻想之国","，","世俗的","任何","权力","都不可能","没有","瑕疵","。",
                            "莫须有的","岳飞案","。",
                            "南宋","绍兴","十一年","（","1142","）","除夕","，","年仅","39岁的","岳飞","被宋高宗","赐死","，","罪名为","谋反","。",
                            "岳飞","被捕时","，","有人劝他","向高宗","求情","，","为岳飞","所拒","。",
                            "他说","：","“","上苍","有眼","，","就不会","陷忠臣于","不义","，","否则","，","又能","往哪里","逃呢","？",
                            "”","同为","抗金名将的","韩世忠","一改往日的","圆滑","与世故","，","面诘","秦桧","，","认为","谋反一事","子虚乌有","。",
                            "秦桧","支吾其词","：","“","其事体","莫须有","。",
                            "”","韩世忠","怒斥道","：","“","莫须有","三字","，","何以","服天下","？",
                            "”","岳飞父子","后均被","处死","，","遇害","之前","，","岳飞","手书","八个大字","“","天日昭昭","，","天日昭昭","”","！",
                            "在不受约束的","国家权力","面前","，","公道","正义","多么","苍白无力","。",
                            "岳飞父子","行刑","之日","，","杭州城","凄风苦雨","，","天下","冤之","，","无数人","为之泪下","。",
                            "但有冤","，","又往","何申","？",
                            "如果","刑罚权","不受","法律","约束","，","极度","膨胀","如利维坦","，","虽然","某些重犯","可被处","极刑","，","满足","人们","刹那的","快意","，","但从此","却埋下了","一颗","定时炸弹","，","无数","良善","公民","都有可能","遭受","刑罚","，","无端","罹祸","。",
                            "欲加之罪","，","何患无辞","，","这是","一个民族","用血","和泪","换来的","对刑法","使命的","经验总结","。",
                            "岳飞的","冤屈","告诉","我们","，","比犯罪","更可怕的是","不受限制的","国家","权力","。",
                            "在所有的","国家","权力中","，","刑罚","最为","可怕","，","它直接","针对","公民的","人身、","财产","和自由","，","甚至","生命","，","如果","这种权力","腐化","滥用","，","后果","不堪设想","。",
                            "如培根","所言","，","一次犯罪","不过是","污染了","水流","，","而一次","不公正的","司法","却是","污染的","水源","。",
                            "在法治","社会","，","刑法","不再是","刀把子","，","而是","双刃剑","，","一刃","针对","犯罪","，","一刃","针对","国家权力","。",
                            "德国","法学家","拉德布鲁赫","，","最初是","法律","实证主义者","，","认为","法律就是","人定的","规则","，","不要","讨论","虚伪","缥缈的","正义","。",
                            "但是","他后来","慢慢","抛弃了","最初的","观点","，","因为他","经历了","德国第三帝国","，","也就是","纳粹","。",
                            "他深刻地","意识到","恶法","非法","，","严重","偏离","正义的","人定的","规则","不能算是","法律","。",
                            "他反思","刑法","，","最后","留下","一句话","：","“","自从","有刑法","存在","，","国家","代替","受害人","施行","报复时","开始","，","国家","就承担着","双重","责任","：","正如","国家在","采取任何","行为时","，","不仅要","为社会","利益","反对","犯罪者","，","也要","保护","犯罪人","不受","被害人的","报复","。",
                            "现在","刑法","同样","不只反对","犯罪人","，","也保护","犯罪人","，","它的","目的","不仅在于","设立","国家","刑罚","权力","，","同时","也要","限制","这一权力","，","它不只是","可罚性的","缘由","，","也是它的","界限","，","因此","表现出","悖论性","：","刑法","不仅要","面对","犯罪人","保护","国家","，","也要","面对","国家","保护","犯罪人","，","不单","面对","犯罪人","，","也要","面对","检察官","保护","市民","，","成为","公民","反对","司法专横","和错误的","大宪章","。"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"}
            },
            {
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"}
            },
            {
                    {"刑罚","体系","。",
                    "刑罚是","人民法院","，","也就是","审判机关","，","依法","对罪犯","适用的","限制","和剥夺","其某种","权益的","最严厉的","强制措施","。",
                    "刑罚是","犯罪行为","最主要的","法律","后果","，","无罪不罚","是刑罚的","底线","。",
                    "刑罚","作为一种","最严厉的","惩罚","措施","，","不到","万不得已","不应该","轻易","使用","。",
                    "刑罚","为何","存在","。",
                    "人类社会","，","为什么","需要","刑罚","？",
                    "历来","有两种","针锋相对的","观点","，","一种观点","认为","，","因为有","犯罪","所以需要","刑罚","；",
                    "而另一种","观点","认为","，","为了","没有","犯罪","所以","需要","刑罚","。",
                    "前者","立足","既往","，","认为","罪犯","实施","犯罪","，","本身","就应受到","惩罚","，","惩罚","具有","道德上的","正当性","，","即","报应主义","思想","。",
                    "而后者","关注","将来","，","认为","惩罚是","为了","预防犯罪","，","对社会有","积极的","作用","，","此乃","功利主义","思想","。",
                    "报应主义的","代表人物是","德国","哲学家","康德","。",
                    "他认为","人在","自由意志的","选择下","，","避善","从恶","实施","犯罪","，","从道义的","立场上","必须","承担责任","。",
                    "因为","理性的人","必须","接受","内心","道德法则的","自律","，","自律是","理性","自己","给自己","下达的","命令","，是一种","不可违背的","绝对","命令","，","违反","绝对","命令","，","必须要","承担","道义上的","责任","。",
                    "这位","终身未婚的","大哲学家","，","行动","如同","时钟","一样","规律","。",
                    "在他","墓碑上","铭刻着","这样","一段话","：","有两种","东西","，","我们","愈是","时常","愈加","反复地","思索","，","它们","就愈是","给人的","心灵","灌注了","时时","翻新","，","有加无已的","赞叹","和敬畏","—","我们","头上的","无比灿烂","星空","和心中","神圣的","道德","法则","。",
                    "对犯罪的","惩罚是","一种","不可违背的","绝对","命令","，","为了","申明","这种","报应主义","立场","，","康德","举了","一个例子","。",
                    "假定","在海岛上","有一个","公民","社会","，","经过","所有成员的","同意","，","决定","解散","，","彼此","分开","，","散居","世界各地","。",
                    "但如果","监狱里","还有","最后一名","谋杀犯","，","那必须在","处死他","以后","，","才能","执行","解散","决定","。",
                    "因为","必须让","每个人","都知道","自己","言行","有应得的","报应","，","也不应把","有血债的人","留给","人民","。",
                    "如果","不这样做","，","所有人","将被认为","共同","参与了","谋杀","，","是对","正义的","公开","违反","。",
                    "有很多人","认为","报应主义","太野蛮","，","可能","导致","刑罚权的","滥用","，","但","仔细","想一想","你会","发现","，","以牙还牙、","以眼还眼的","这种","报应","其实是","限制了","刑罚权","，","因为你","打掉","别人","一颗","牙齿","，","只能","让其","打掉","一颗牙","，","你","弄瞎","他人","一只眼","，","也只用","赔上","一只眼","。",
                    "在","报应主义","看来","，","如果","赔上","两只眼","，","刑罚","就是","过度的","。",
                    "所以","，","报应主义是","限制了","刑罚权","。",
                    "杀人偿命","，","只有","杀人者的","生命","需要","被剥夺","，","无须","株连","家人","，","但是","按照","预防主义的","思路","，","其实","斩草是要","除根","，","以绝后患","。",
                    "假设","某地","发生","连环杀人案","，","人心惶惶","，","领导批示","三个月内","一定要","破案","，","明天是","截止期限","，","一点","线索","都没有","，","怎么办","？",
                    "我们","可不可以","到死囚库中","随便找","一个人","，","让他","顶包","，","换取","他家人的","荣华富贵","。",
                    "司法机关","开出的","条件是","，","让他","高考","没上线的","孩子","上名校","，","让他","没工作的","老婆","当领导","。",
                    "这个死囚","难以","拒绝","这种条件","，","第二天","当着","全国民众","认罪","。",
                    "这个案件","显然","起到了","震慑民众的","效果","，","很好地","预防了","犯罪","。",
                    "但这","公平吗","？",
                    "不公平","，","因为它","违反了","一个","基本的","铁律","，","那就是","无罪","不罚","。",
                    "刑罚","要追求","积极的","目的","。",
                    "我国","刑法的","通说","历来是","折中说","，","我们既要","向后看","，","又要","向前看","，","一个是","根据","，","一个是","目的","。",
                    "刑罚的","根据","一定是","已然","之罪","，","因为","犯了罪","所以受","惩罚","，","重罪","重刑","，","轻罪轻刑","，","无罪","不刑","，","这是","最基本的","底线","。",
                    "在一个人","没有","犯罪的","情况下","，","无论为了","达到","多美好的","目标","，","都不能","惩罚他","。",
                    "在这个","基础上","，","刑罚","追求","积极的","目的","，","即犯罪的","预防","，","包括","一般","预防","和特殊","预防","。",
                    "一般","预防","针对","普罗大众","，","要威慑","所有人","，","通俗讲","就是","杀鸡","给猴看","；",
                    "而特殊","预防","针对","犯罪人","，","剥夺其","再犯","能力","，","让他","不再","犯罪","，","比如","把他","关进","深牢大狱","，","这是","消极的","特殊","预防","，","而积极的","特殊","预防","就是","对罪犯","进行","教育","改造","，","成为","守法","公民","。",
                    "刑罚","应当在","报应","基础上","追求","预防","。",
                    "即便","罪犯","丧失","犯罪","能力","，","他也应该","受到","最低","限度的","惩罚","。",
                    "比如","张三","因为","生计","抢劫","，","在被捕前","抽中","巨奖","，","又如","李四","性欲亢奋","，","实施","强奸","，","后来","遭遇车祸","，","丧失","性功能","。",
                    "按照","特殊","预防的","思路","，","这些人","今后","可能","不会再","实施","类似","犯罪","，","没有必要","浪费","刑罚","；",
                    "按照","一般","预防的","思路","，","完全可以","假装","宣判","，","向社会","公示","这些人","已经","受到","惩罚","，","而实际上","让他们","远走高飞","，","这也可","起到","威慑","作用","。",
                    "但这些","做法","显然","不当","，","因为它","违反了","正义的","基本","要求","。",
                    "刑罚","起源于","远古时代的","同态复仇","，","必然带有","感性","成分","。",
                    "虽说","它需要","理性的","补充","，","但并不","意味着","感性","就毫无意义","。",
                    "惩罚","必须要","满足","社会公众","最基本的","正义","情感","，","绝不能让","无辜者","含冤受屈","，","让有罪者","逍遥法外","。",
                    "民众","朴素的","正义","情感","，","是刑罚的","首要","基石","。",
                    "今天","有许多","刑法","学者","，","倡导","人道主义的","刑罚理论","，","认为","报应主义是","一种复仇","，","是野蛮","和不道德的","。",
                    "该理论","认为","，","罪犯","只是","一种病态","，","需要","接受","治疗","，","惩罚","变成了","治疗","。",
                    "然而","，","对犯罪人","施加的","措施","，","即便","称为","“","治疗","”","，","也和以往","称为","刑罚的","措施","具有","同样的","强制性","。",
                    "在人道主义","刑罚理论","看来","，","“","应受惩罚性","”","这个","概念","应当从","刑罚中","剥离","。",
                    "我们只需","考虑","如何","矫正","罪犯","或者","制止","他人","犯罪","。",
                    "当我们","根据","应受惩罚性","来考量","刑罚的","正当性","，","那么","刑罚","就是一个","道德","问题","，","法学","也是一种","关于权利","与义务的","科学","，","法律","在原则上","不能","超越","社会良知的","约束","，","每个人","都有","权利","发表","看法","。",
                    "但是","，","当我们以","“","预防","”","和“","矫正","”","来替换","应受惩罚性的","概念","，","那么","，","也只有","技术专家","可以对此","做出","判断","。",
                    "于是","，","人道主义","刑罚理论","将审判","从法官","转移至","技术专家","之手","。",
                    "公众","朴素的","良知","有权对","法官","进行批评","，","却对这些","专家","无能为力","。",
                    "专家","根本不","使用","诸如","权利","或正义","这些","范畴","。",
                    "他们认为","，","既然","古老的","惩罚","观念","已被抛弃","，","那么","所有","报复性","动机","也应","剔除","。",
                    "犯罪","和疾病","被等量齐观","，","意味着","专家","冠之以","“","疾病","”","的心理情况","能以","犯罪","对待","，","并对其","实施","强制性的","治疗","措施","。",
                    "因此","，","如果一种","让政府","不满的","行为","，","即便","与道德罪性","无关","，","本不应","被剥夺","自由","，","政府","也可对其","“","治疗","”","，","而人","却无法","辩解","。",
                    "比如","，","有一些","心理学","专家","将宗教","视为","精神疾病","。",
                    "当这种","特别的","精神疾病","让政府","觉得","不爽","，","如何","阻止","政府","实施","“","矫正","”","呢","？",
                    "虽然","这种矫正","明显是","强制性的","，","却披着","人道主义的","外衣","，","并不","使用","让人","胆战心惊的","“","逮捕","”","之名","，","而使用","“","治疗","”","这种","“","优雅","”的","手段","。",
                    "事实上","，","在德国","和意大利","，","这两个","“","预防刑","”","和“","矫正刑","”","的诞生之地","，","法西斯","专政","曾经","极大地","利用了","这种","所谓的","“","科学","”","大行残暴","。",
                    "“","预防刑","”","的后果","更为可怕","。",
                    "当惩罚","一个人","是为了","将其作为","对其他人","进行","威慑的","范例","，","你只是","把他作为","实现","他人目的的","工具","。",
                    "这本身","就是一件","非常邪恶的","事情","。",
                    "如果","刑罚的","正当化","基础","不再是","应受惩罚性","，","而是","预防的","有效性","，","那么","惩罚","罪犯","也就不必","要求他","真的","实施","犯罪","。",
                    "正如","CS刘易斯","所言","：","仁慈","只有当其","生长于","正义","岩石的","缝隙中","，","才能","开花","。",
                    "若将其","移植到","人道主义的","泥沼","，","它将变成","食人草","，","而其","可怕之处","更甚","，","因为它","依然","顶着","可爱绿植的","名字","。",
                    "因此","，","刑罚的","根据","只能是","报应","，","否则","刑罚的","道德基础","将完全","坍塌","。",
                    "但是","，","在这个","基础之上","，","刑罚","可以","追求","积极的","目的","，","在报应的","基础上","，","刑罚是","可以具有","预防","和改造的","目的","。"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"},
                    {"测试"}
            }
    };

    /*
    public String[][][] word_text = {{{"测试"},{"测试"},{"测试"},{"测试"}},{{"人类曾有","长达","250万年的","时间","靠采集","及狩猎","维生","，","并不会","特别干预","动植物的","生长情形","。",
            "虽然","智人","从东非","来到","中东、","欧洲、","亚洲","，","最后到了","澳大利亚","和美洲","，","但不管","他们到了","什么地方","，","仍然就是","靠野生的","动植物","维生","。",
            "毕竟","，","如果","现在的","生活方式","就吃得饱","，","社会结构、","宗教信仰、","政治情况","也都","稳定多元","，","何必","自找麻烦","改来改去","？",
            "这一切在","大约","1万年前","全然改观","，","人类","开始投入","几乎全部的","心力","，","操纵着","几种","动植物的","生命","。",
            "从日升","到日落","，","人类忙着","播种、","浇水、","除草、","牧羊","，","一心以为","这样就能","得到更多的","水果、","谷物","和肉类","。",
            "这是一场","关于","人类","生活方式的","革命","：","农业革命","。",
            "学者","曾经以为","农业","就是","起源于","中东","，","再传布到","全球各地","，","但现在","则认为","农业是","同时间","在各地","独自发展","而开花结果","。",
            "到了","公元1世纪","，","全球","大多数地区的","绝大多数","人口","都从事","农业","。",
            "学者","曾宣称","农业革命是","人类的","大跃进","，","是由","人类脑力","所推动的","进步故事","。",
            "他们说","演化","让人","越来越聪明","，","解开了","大自然的","秘密","，","于是能够","驯化绵羊、","种植小麦","。",
            "等到","这件事","发生","，","人类就","开开心心地","放弃了","狩猎采集的","艰苦、","危险、","简陋","，","安定下来","，","享受","农民","愉快而饱足的","生活","。",
            "这个故事","只是幻想","。",
            "并没有","任何证据","显示","人类","越来越聪明","。",
            "农业革命","所带来的","非但不是","轻松生活的","新时代","，","反而","让农民","过着","比采集者","更辛苦、","更不满足的","生活","。",
            "狩猎采集者的","生活","其实更为","丰富多变","，","也比较少","会碰上","饥饿","和疾病的","威胁","。",
            "确实","，","农业革命","让人类的","食物总量","增加","，","但量的增加","并不代表","吃得更好、","过得更悠闲","，","反而只是","造成","人口爆炸","，","而且","产生一群","养尊处优、","娇生惯养的","精英分子","。",
            "普遍来说","，","农民的工作","要比采集者","更辛苦","，","而且","到头来的","饮食","还要更糟","。",
            "农业革命","可说是","史上最大的","一桩骗局","。",
            "谁该负责","？",
            "这背后的","主谋","，","既不是","国王","，","不是牧师","，","也不是","商人","。",
            "真正的","主要嫌疑人","，","就是那","极少数的","植物物种","，","其中包括","小麦、","稻米","和马铃薯","。",
            "人类以为","自己","驯化了植物","，","但其实是","植物","驯化了","智人","。",
            "如果","我们用","小麦的","观点","来看看","农业革命","这件事","，","在1万年前","，","小麦","也不过就是","许多野草","当中的","一种","，","只出现在","中东一个","很小的","地区","。",
            "但就在","短短","1000年内","，","小麦","突然就","传遍了","世界各地","。",
            "生存","和繁衍","正是","最基本的","演化标准","，","而根据","这个标准","，","小麦","可以说是","地球史上","最成功的","植物","。",
            "究竟","，","这种野草","是怎么从","无足轻重","变成","无所不在","？",
            "小麦的","秘诀","就在于","操纵","智人、","为其所用","。",
            "智人","这种猿类","，","原本靠着","狩猎","和采集","过着","颇为舒适的","生活","，","直到","大约","1万年前","，","才开始","投入","越来越多的","精力","来培育","小麦","。",
            "而在","接下来的","几千年间","，","全球","许多地方的","人类","都开始","种起小麦","，","从早到晚","只忙","这件事","就已经","焦头烂额","。",
            "种小麦","可不容易","，","照顾起来","处处麻烦","。",
            "第一","，","小麦","不喜欢","大小石头","，","所以","智人得","把田地里的","石头","捡干净","搬出去","，","搞得","腰酸背痛","。",
            "第二","，","小麦","不喜欢","与","其他植物","分享","空间、","水","和养分","，","所以","我们看到","男男女女","在烈日下","整天","除草","。",
            "第三","，","小麦","会得病","，","所以","智人","得帮忙","驱虫","防病","。",
            "第四","，","不论是","蝗虫","还是","兔子","，","都不排斥","饱尝一顿","小麦大餐","，","但小麦","完全","无力抵抗","，","所以","农民","又不得不","守卫","保护","。",
            "最后","，","小麦","会渴","，","所以","人类得","从涌泉","或溪流","大老远","把水引来","，","为它止渴","；",
            "小麦","也会饿","，","所以","智人甚至","得收集","动物粪便","，","用来滋养","小麦生长的","土地","。",
            "智人的","身体","演化目的","并不是","为了从事","这些活动","，","我们适应的","活动是","爬爬果树、","追追瞪羚","，","而不是","弯腰","清石块、","努力","挑水桶","。",
            "于是","，","人类的","脊椎、","膝盖、","脖子","和脚底","就得","付出代价","。",
            "研究","古代骨骼","发现","，","人类","进到","农业时代后","出现了","大量疾病","，","例如","椎间盘突出、","关节炎","和疝气","。",
            "此外","，","新的","农业活动","得花上","大把时间","，","人类就只能","被迫","永久定居在","麦田旁边","。",
            "这彻底改变了","人类的","生活方式","。",
            "其实","不是","我们","驯化了","小麦","，","而是","小麦","驯化了","我们","。",
            "驯化一词","来自","拉丁文","，","意思","就是","房子","。",
            "但现在","关在","房子里的","可不是","小麦","，","而是智人","。",
            "小麦","究竟","做了什么","，","才让智人","放弃了","本来","很不错的","生活","，","换成","另一种","悲惨的","生活方式","？",
            "它","提供了","什么报酬","？",
            "就智人的","饮食","来说","，","其实","并没有","更好","。",
            "别忘了","，","人类","原本","就是种","杂食的猿类","，","吃的是","各式各样的","食物","。",
            "在","农业革命","之前","，","谷物","不过是","人类","饮食的","一小部分","罢了","。",
            "而且","，","以谷物","为主的","食物","不仅","矿物质","和维生素","含量不足、","难以消化","，","还对牙齿","和牙龈","大大有害","。",
            "而就","民生经济","而言","，","小麦","也并未","带来","经济安全","。",
            "一直到","最近为止","，","农业社会","绝大多数","饮食","靠的还是","寥寥无几的","少数几种","农业作物","，","很多地区","甚至只有","一种主食","，","例如","小麦、","马铃薯","或稻米","。",
            "所以","，","如果","缺水、","来了蝗灾","又或是","爆发","真菌感染","，","贫农","死亡人数","甚至有可能","达到百万","。",
            "再就","人类暴力","而言","，","小麦","也没办法","提供","人身安全","。",
            "过去","，","如果","采集者的","部落","遇到","比较强的","对手","，","只要","撤退","搬家","就能解决","。",
            "虽然说","有些困难","和危险","，","但至少是个","可行的","选项","。",
            "但如果是","农民","遇到了","强敌","，","撤退","就代表着","得放弃田地、","房屋","和存粮","。",
            "很多时候","这几乎","就注定了","饿死一途","。",
            "因此","，","农民","常常得","死守田地","，","双方","拼个","你死我活","。",
            "慢慢地","，","人类","发展出","进阶的","社会结构","，","如城市、","王国、","国家","，","于是","人类的","暴力","也得到了","控制","。",
            "不过","，","这样庞大","而有效的","政治结构","可是","足足花了","数千年","，","才终于","建立起来","。",
            "当然","，","农村生活","确实为","第一代农民","带来了一些","直接的","利益","，","像是","比较不需要","担心","野兽袭击、","风吹雨淋","，","但","对一般人","来说","，","可能其实","弊大于利","。",
            "纵观历史","，","对于","个人来说","，","小麦","根本","算不上","给了什么","。",
            "但对于","智人","这个物种","整体来说","，","小麦的","影响","就十分深远","。",
            "种植小麦","，","每单位土地","就能提供","更多食物","，","于是","智人的","数量","也呈指数","成长","。",
            "但人口密度","也因此","增大","，","也会","因此产生","一系列","负面影响","。",
            "如果要","衡量","某种物种","演化","成功与否","，","评断标准","就在于","世界上","其DNA螺旋的","拷贝数的","多寡","。",
            "如果","世界上","不再有","某物种的","DNA拷贝","，","就代表","该物种","已经绝种","，","而如果","某个物种","还有","许多个体","带着它的","DNA拷贝","存在","这个世上","，","就代表着","这个物种","演化成功、","欣欣向荣","。",
            "从这种角度","看来","，","1000份","DNA拷贝","永远都","强过","100份","。",
            "这正是","农业革命","真正的","本质","：","让更多的人","却以","更糟的","状况","活下去","。",
            "但是","，","身为","个人","，","为什么","要管这种","演化问题","？",
            "如果","有人说","，","为了","增加","智人基因组","在世界上的","拷贝数","，","希望你","降低","自己的","生活水平","，","你会","同意","吗","？",
            "没有人会","同意","这笔交易","。",
            "简单说来","，","农业革命","就是","一个陷阱","。"},{"测试"},{"测试"},{"测试"}},
            {{"测试"},{"测试"},{"测试"},{"测试"},{"测试"}},
            {{"小标题","：","不知为不知","。",
                    "至少在","认知革命","之后","，","人类","就很希望","能了解","这个世界","。",
                    "我们的","祖先","投入","大量时间","和精力","，","希望能找出","支配","自然界的","法则","。",
                    "然而","，","现代科学","与先前的","知识体系","有三大不同之处","：","1","，","愿意承认","自己的","无知","。",
                    "现代科学的","基础","就是","承认无知","。",
                    "从这种立场","，","我们承认了","自己","并非","无所不知","。",
                    "更重要的是","，","我们","也愿意","在","知识进展","之后","，","承认","过去相信的","可能是","错的","。",
                    "于是","，","再也没有","什么概念、","想法","或理论","是神圣不可挑战的","。",
                    "2","，","以观察","和数学","为中心","。",
                    "承认无知","之后","，","现代科学","还希望能","获得","新知","。",
                    "方式","则是通过","收集","各种观察值","，","再用","数学工具","整理连接","，","形成","全面的","理论","。",
                    "3","，","取得","新能力","。",
                    "光是","创造理论","，","对现代科学来说","还不够","。",
                    "它希望","能够运用","这些理论","来取得","新的能力","，","特别是","发展出","新的科技","。",
                    "科学革命","并不是","知识的革命","，","而是","无知的革命","。",
                    "真正让","科学革命","起步的","伟大发现","，","就是发现","：","人类对于","最重要的","问题","其实","毫无所知","。",
                    "对于","像是","伊斯兰教、","基督教、","佛教、","儒教","这些","前现代","知识体系","来说","，","它们假设","世上","所有重要的","事情","都已经","为人","或为神所知","。",
                    "这些全知者","可能是","某些","伟大的神、","某个","全能的神","或是某些","过去的智者","，","通过","经典","或口传","，","将这些","智慧","传给后人","。",
                    "而对于","平民百姓而言","，","重点就是要","钻研","这些古籍","和传统","，","正确","加以理解","，","就能","获得知识","。",
                    "在当时","，","如果说","圣经、","古兰经","或吠陀经","居然漏了","某些","宇宙的","重大秘密","，","而这个秘密","又居然能被","一般血肉之躯的人","给发现","，","这简直是","不可思议的事","。",
                    "对古老的","知识体系","来说","，","只会","承认","两种","无知的","可能","。",
                    "第一种","，","个人","可能","不知道","某些","重要的事","。",
                    "要取得","必要的","知识","，","他该做的","就是去","问那些","更聪明的人","，","而不是","去寻找","什么","还没有人","知道的事","。",
                    "例如","，","如果","有一位","13世纪的","英格兰农夫","，","想知道","人类","究竟是","怎么来的","，","他会认为","基督教","知识体系","一定能有","明确的","答案","。",
                    "所以","，","他该做的","就是","去请教","当地的","牧师","。",
                    "第二种","，","整个知识体系","可能","不知道","一些","不重要的事","。",
                    "就当时的","定义来说","，","伟大的","神祇","或智者","都懒得","告诉我们的事","，","一定是","不重要的","。",
                    "例如","，","假设","我们这位","英格兰农民","又想知道","蜘蛛是","怎么结网的","，","他去","问牧师","也没用","，","因为","任何的","基督教经典","都不会","提到","这个问题的","答案","。",
                    "然而","，","这绝对","不代表","基督教","有什么缺陷","。",
                    "反而是","代表","蜘蛛","怎么结网","这件事","根本不重要","，","人类","无须知道","。",
                    "毕竟","，","上帝","一定知道","蜘蛛","怎么结网","，","而如果","这件事","这么重要、","会影响到","人类的","繁荣","和救赎","，","上帝","怎么可能","不在","圣经里面","有完整的","解释","？",
                    "基督教","并不会","禁止民众","研究蜘蛛","。",
                    "但","研究蜘蛛的","学者","（","如果","中世纪欧洲","真的有人","研究蜘蛛","的话","）","就必须","有心理准备","，","知道","自己","在社会","就是处于","边缘角色","，","而且不管","研究结果","为何","，","基督教","永远都是","对的","。",
                    "所以","，","不管","学者","研究的是","蜘蛛、","蝴蝶","，","还是加拉帕戈斯雀","，","都只会被","视为是","无关痛痒的事","，","不会","影响到","社会、","政治","和经济的","基本真理","。",
                    "事实上","，","事情","永远","没那么简单","。",
                    "就算是","最虔诚、","最保守的","时代","，","还是","会有人","认为","，","一定","有什么","重要的事","，","是整个","知识体系","所不知道的","，","但这种人","常常就会被","边缘化","或遭受迫害","；",
                    "但也有可能","，","他们就会","开创一个","新的体系","，","开始宣称","只有他们","才知道","所有","该知道的事","。",
                    "举例来说","，","穆罕默德","宗教生涯的","第一步","，","就是","谴责","他的","阿拉伯同胞","，","说","他们对于","真正神圣的","真理","一无所知","。",
                    "穆罕默德","很快","就宣称","只有自己","知道","全部的","真相","，","而信众","也开始","称呼他为","先知的","封印","（","意为","所有先知","到此为","终结","）","。",
                    "于是","，","所有的","启示","当然","也就是","到了穆罕默德","为止","，","再也没什么","重要的了","。",
                    "现代科学","是一套","独特的","知识体系","，","独特之处","也就在于","公开承认","这整套体系","都对一些","最重要的","问题","一无所知","。",
                    "达尔文","从来没有","说过","自己是","生物学家的","封印","，","说自己","已经","完全解开了","生命的","谜团","。",
                    "经过","几个世纪的","大规模","科学研究","，","生物学家","承认","，","他们","还是无法","完整解释","为什么","大脑","能够产生","意识","。",
                    "物理学家","也承认","，","他们","不知道","什么","引起了","宇宙大爆炸","，","也不知道","如何让","量子力学","与广义相对论","结合起来","。",
                    "也有些时候","，","因为","不断有","新证据","出现","，","各种","科学理论","也就互相交锋、","战火热烈","。",
                    "一个典型的","例子","，","就是","究竟哪种","经济模式","最好","。",
                    "虽然","每个经济学家","都可能会说","自己的","模式","最恰当","，","但每次","出现","金融危机","和股市泡沫","，","我们就会","看到","主流改变","；",
                    "目前","一般公认","，","我们","还是不知道","最佳的","经济模式","究竟为何","。",
                    "还有些时候","，","因为","现有的","证据","强力支持","某些理论","形成主流","，","于是","其他理论","就被冷落","。",
                    "虽然","我们一般","认定","主流理论","为真","，","但每个人","也都同意","，","如果","新证据","出现","而与主流理论","相违背","，","主流理论","也就需要","修正","甚至是","淘汰","。",
                    "像是","板块构造理论","和演化论","就属于","这种例子","。",
                    "现代科学","愿意承认","自己的","无知","，","就让它","比所有先前的","知识体系","更具活力、","更有弹性","，","也更有","求知欲","。",
                    "这一点","大幅提升了","人类","理解世界","如何运作的","能力","，","以及","创造新科技的","能力","。",
                    "然而","，","这也给人类","带来","祖先","多半","无须面对的","一个严重问题","。",
                    "就现在","这个体系","而言","，","我们假设","自己并非","无所不知","，","现有的","知识","也并未","定案","，","但这也","同样","适用于那些","让数百万人","得以有效合作的","虚构故事","。",
                    "如果","证据显示","许多","这些故事","都大有问题","，","社会","岂不是","要崩溃了","？",
                    "要怎样","才能让社会、","国家","和国际体系","继续","维持运作","？",
                    "正因如此","，","现代","想要维持","社会政治秩序","稳定","，","只能靠着","两种","不科学的","方法","，","其他","别无选择","。",
                    "1","，","虽然","采用","科学理论","，","但","必须违反","一般科学做法","：","宣称","这就是","绝对的","真理","。",
                    "纳粹","就是采用","这种方式","，","声称","他们的","种族政策是","来自","生物事实的","推论","。",
                    "2","，","不要采取","科学方法","，","而诉诸","非科学的","绝对真理","。",
                    "这一直是","自由人文主义的","策略","。",
                    "自由人文主义的","基础在于","坚持主张","人类的","特殊价值","和权利","，","但很尴尬的是","，","对智人的","科学研究","并不认同","这种看法","。",
                    "但我们","也不该","太过惊讶","。",
                    "毕竟","，","科学","还是得倚靠着","种种宗教","和意识形态信仰","，","才能","取得经费","，","并将研究","正当化","。",
                    "不论如何","，","现代文化","已经","比过去","任何文化","都更愿意","承认","自己的","无知","。",
                    "而现代社会","之所以","还能够维系","，","原因之一","就在于对","科技","和科学研究方法的","信任","，","这几乎成了","类似宗教的","信仰","，","甚至在","一定程度上","也取代了","对绝对真理的","信念","。"},
            {"测试"},{"测试"},{"工业革命","为人类","带来了","前所未有的","种种能源","和原料","，","不仅","种类丰富","，","而且","价格低廉","。",
                    "结果就是","人类的","生产力","有了","爆炸性的","发展","。",
                    "首先","引爆、","影响也","最深的","就是农业","。",
                    "一般情况下","，","我们想到","工业革命","，","脑中浮现的","画面","就是一片","都市景象、","冒着烟的","烟囱","，","或者是","一群","煤矿工人","汗流浃背","，","深入地底","辛苦工作","。",
                    "然而","，","工业革命","最重要的一点","，","其实在于","它就是","第二次的","农业革命","。",
                    "过去","两百年间","，","工业化生产","成了","农业的","支柱","。",
                    "过去","得靠","肌肉力量","或根本","做不到的","事情","，","现在都由","像是","曳引机之类的","机器","接手","。",
                    "由于有了","化学肥料、","工业杀虫剂","和各种激素","及药物","，","无论是","农地","还是","家禽家畜的","产量","都大幅跃进","。",
                    "而有了","冰箱、","船舶","和飞机","之后","，","各种农产品","能够保存","长达","数个月","，","而且","也能","快速、","廉价地","运送到","世界的","另一头","。",
                    "欧洲人","开始能够","大啖","新鲜美味的","阿根廷牛肉","和日本寿司","。",
                    "如果","将所有","数字","加总","，","全球","随时都有","数十亿只","家禽家畜","就像","活在","工厂","生产线上","，","而每年","宰杀总数","更达到","百亿","。",
                    "采用","工业化的","禽畜","饲养方式后","，","农业生产量","和人类粮食","储备量","大幅增长","。",
                    "像这种","工业化的","畜牧业","，"," ","再加上","农作物","种植的","机械化","，","就成了","整个","现代社会","经济秩序的","基础","。",
                    "随着","农业","工业化","，","只需要","越来越少的","农民数量","，","就足以","养活","越来越多的","办公","或工厂","人口","。",
                    "例如","现在的","美国","，","只有","2%的人口","以农业","为生","，","但","仅仅就是","这2%","，","不仅","养活了","整个美国的","人口","，","还有","剩余粮食","可以","出口到","世界各地","。",
                    "如果没有","农业","工业化","，","就不会有","足够的","人力","来办公","思考","和从事","工厂劳动","，","也就","不可能有","都市里的","工业革命","。",
                    "正是因为","农业","释放出了","数十亿的","人力","，","由工厂","和办公室","吸纳","，","才开始像","雪崩一样","有各种","新产品","倾泻而出","。",
                    "比起以前","，","人类","生产出","更多","钢铁","，","制作出","更多","服装","，","兴建出","更多","建筑","，","还制造出","令人","瞠目结舌、","超出想象的","各种产品","，","像是灯泡、","手机、","数码相机","和洗碗机","。",
                    "人类","有史以来","第一次","，","生产","超出了","需求","。",
                    "也是","因为如此","，","产生了","一个全新的","问题","：","谁要来","买","这些产品","？",
                    "小标题","：","血拼的","年代","。",
                    "现代","资本主义经济","如果","想要存活","，","就得不断","提高产量","。",
                    "然而","，","光是","生产","还不够","。",
                    "生产出来","之后","，","还得","有人买","，","否则","业者","或投资人","都得","关门大吉","。",
                    "为了","避免","这种灾难","，","确保","不管什么","新产品","都有人","买账","，","就出现了","一种新的","伦理观","：","消费主义","。",
                    "有史以来","，","人类的","生活","多半","颇为困窘","，","因此","节俭","就成了","过去","所高喊的","口号","，","像是","清教徒","或","斯巴达人","，","都以","简朴","律己","而闻名","。",
                    "所以","，","如果是","正直的人","，","就该","避免","奢侈、","从来不","浪费","食物","，","裤子破了","该缝缝补补","，","而不是去","买条新的","。",
                    "然而","，","消费主义的","美德","就是","消费更多的","产品","和服务","，","鼓励","所有人","应该","善待自己、","宠爱自己","，","就算因为","过度消费","而慢慢","走上绝路","，","也是","在所不惜","。",
                    "在这里","，","节俭","就像是一种","该赶快治疗的","疾病","。",
                    "现在","我们","很容易","在身边","找到","各种","鼓励消费的","广告","。",
                    "在历史上的","大多数时候","，","各种","鼓励","消费伦理的","文案","不但","无法引起","消费欲望","，","反而还会","激起","极度的","反感","。",
                    "在","过去的人","眼中","，","这种内容","真是","自私、","堕落、","道德沦丧","！",
                    "消费主义","除了","自身","非常努力","，","还在","大众心理学的","推波助澜之下","，","不断","说服","大众","：","放纵","对你有益","，","而节俭是","自我压抑","。",
                    "而且","，","这套理论","已经","成功了","。",
                    "我们","都成了","乖巧的","消费者","，","买了","无数种","我们","并不真正","需要的","产品","，","而且","有的","根本就是","昨天才","知道的","。",
                    "制造商","设计","产品的","时候","，","刻意","让它","在一段","短时间后","就被淘汰","；",
                    "而且","就算","旧型号","明明","就足以","满足","各种需求","，","厂商","还是会","不断推出","新型号","，","我们","如果","不跟进","，","就仿佛","显得","落伍","。",
                    "购物","已成为","人类最喜爱的","消遣","，","而且","消费性产品","也成了","家人、","朋友、","配偶之间","不可或缺的","中介","。",
                    "各种","宗教节日","，","例如","圣诞节","，","都已经","成了","购物节","。",
                    "消费主义","伦理","开枝散叶","，","在食品市场","表现得","最为明显","。",
                    "在过去的","传统农业社会","，","饥荒的","阴影","总是","挥之不去","。",
                    "但到了","今日的","富裕世界","，","一大","健康问题","却成了","肥胖","，","而且","对穷人的","冲击","更大于","富人","。",
                    "因为","富人","懂得选择","有机沙拉","和水果奶昔","，","但穷人","常常是","大啖","汉堡、","比萨","。",
                    "美国","每年","为了节食","所花的钱","，","已经","足以养活","其他地方","所有","正在挨饿的人","。",
                    "肥胖","这件事","，","可以说是","消费主义的","双重胜利","。",
                    "一方面","，","如果大家","吃得太少","，","就会导致","经济萎缩","，","这可不妙","；",
                    "另一方面","，","大家","吃多了","之后","，","就得购买","减肥产品","，","再次","促进","经济成长","。",
                    "然而","，","如果","根据","商人的","资本主义","伦理","，","所有的","利润","都该","再投入","生产","而不是","白白浪费","，","这样一来","，","消费主义","伦理","和资本主义","道德","该如何","共存","？",
                    "没问题","！",
                    "就像","过去的","年代","，","今天也有","精英分子","和一般大众的","劳力分工","。",
                    "在","中世纪","欧洲","，","贵族","浪掷千金、","尽享奢华","，","而农民","则是","省吃俭用、","锱铢必较","。",
                    "但今天","情况","正相反","。",
                    "大富豪","管理资产","和投资","非常谨慎","，","反而是","没那么","有钱的人","，","买起","没那么","需要的","汽车","和电视机","却毫不手软","。",
                    "资本主义","和消费主义的","伦理","可以说是","一枚硬币的","正反两面","，","将这","两种秩序","合而为一","。",
                    "有钱人的","最高","指导原则是","投资","，","而我们这些","其他人的","最高","指导原则","则是","购买","。",
                    "这种","资本","/","消费主义的","伦理","，","还有","另一个","革命性的","意义","。",
                    "过去的","伦理体系","，","常常要求","人类","做些","难如登天的事","，","告诉他们","照做","就能","上天堂","。",
                    "但","总是要求","他们","慈悲、","宽容","，","克服","各种欲望","和愤怒","，","还得","放下","己身的","私利","。",
                    "这对","大多数人","来说","实在太过","强人所难","。",
                    "所以","翻开","伦理道德的","历史","，","虽然","会看到","许多美妙的","理想","，","但","遗憾的是","几乎","没人能","做到","。",
                    "大多数","基督徒的","作为","不像","基督","，","大多数","佛教徒","没听","佛陀的话","，","大多数","儒家子弟","可能会","让孔子","频频摇头","。",
                    "但今天的","情况","有所不同了","，","大多数人","都能","轻松达到","资本","/","消费主义的","理想","。",
                    "想要","进入","这种","新伦理","所承诺的","天堂","，","条件就是","有钱人","应该","继续","贪婪下去","，","把时间","投入","赚更多的钱","，","至于","一般大众","则是要","尽情满足","自己的","欲望","和热情","，","想要什么","就买什么","。",
                    "这是人类","有史以来","第一次","，","信众","终于","真的能够","做到","宗教要求的","条件","。",
                    "只不过","，","我们","又怎么","知道","它承诺的","天堂是","什么样子","？",
                    "答案是","：","看看电视","，","你就知道","。"},{"测试"},{"测试"},{"测试"}}
    };
    public int[][][] num_words_in_sentence = {{{1},{1},{1},{1}},
    {{13, 21, 17, 15, 16, 8, 18, 10, 11, 13, 19, 3, 6, 14, 11, 22, 11, 5, 2, 11, 12, 9, 21, 9, 15, 8, 7, 21, 16, 6, 16, 18, 11, 21, 14, 12, 18, 10, 15, 12, 4, 11, 8, 8, 15, 4, 8, 11, 11, 15, 9, 20, 14, 9, 14, 8, 11, 5, 10, 17, 12, 22, 10, 9, 12, 9, 13, 24, 9, 11, 9, 18, 4, 6},
            {1},{1},{1}},
            {{1},{1},{1},{1},{1}},
            {{4, 9, 11, 13, 5, 7, 13, 8, 6, 8, 13, 5, 6, 10, 7, 13, 19, 17, 14, 19, 10, 8, 15, 19, 8, 8, 12, 21, 7, 10, 22, 5, 27, 21, 6, 22, 12, 17, 20, 12, 14, 13, 16, 15, 12, 8, 16, 9, 13, 21, 6, 14, 11, 9, 20, 10, 7, 15, 15, 11, 9, 4, 14, 4, 13, 11, 20},
                    {1},{1},{13, 7, 6, 20, 10, 8, 13, 13, 19, 7, 19, 10, 16, 15, 24, 17, 16, 26, 8, 11, 5, 8, 6, 12, 16, 24, 18, 23, 7, 9, 16, 10, 19, 6, 18, 11, 21, 14, 10, 8, 8, 15, 12, 11, 7, 10, 13, 25, 2, 9, 13, 4, 16, 11, 12, 11, 13, 15, 6, 16, 17, 12, 28, 11, 9, 6},{1},{1},{1}}};
    */
    public int[][][] num_words_in_sentence = {
            {
                    {1},
                    {1},
                    {6, 14, 28, 22, 16, 7, 12, 24, 14, 19, 7, 19, 10, 8, 33, 10, 9, 8, 16, 13, 12, 19, 33, 15, 19, 11, 23, 7, 17, 13, 6, 8, 20, 3, 17, 10, 16, 15, 7, 11, 17, 9, 13, 5, 35, 13, 11, 26, 15, 18, 19, 14, 13, 42, 63},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1}
            },
            {
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1}
            },
            {
                    {3, 16, 10, 12, 4, 6, 13, 11, 22, 17, 6, 15, 28, 10, 37, 17, 19, 15, 14, 14, 44, 12, 6, 23, 21, 13, 15, 10, 10, 3, 12, 5, 18, 23, 13, 17, 13, 36, 7, 12, 23, 17, 25, 11, 9, 10, 15, 9, 16, 15, 20, 13, 10, 32, 21, 10, 11, 9, 15, 21, 25, 9, 16, 28, 26, 6, 15, 5, 20, 14, 18, 13, 20},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1},
                    {1}
            },
    };

    public int[][] num_page() {
        int[][] result = new int[rawtext.length][];
        for (int i = 0; i < result.length; i++) {
            result[i] = new int[rawtext[i].length];
            for (int j = 0; j < result[i].length; j++) {
                int sum = Arrays.stream(num_words_in_sentence[i][j]).sum();
                int page_c = ((sum-1)/ (MyView.num_row * MyView.num_col)) +1;
                if (page_c < 0) {
                    page_c = 0;
                }
                result[i][j] = page_c;
            }
        }
        return result;
    }

    public void punc_word_text(String[] text) {
        for (int i = 0; i < text.length; i++) {
            text[i] = text[i].replaceAll("，","逗号");
            text[i] = text[i].replaceAll("。","句号");
            text[i] = text[i].replaceAll("！","感叹号");
            text[i] = text[i].replaceAll("？","问号");
            text[i] = text[i].replaceAll("；","分号");
            text[i] = text[i].replaceAll("（","括号");
            text[i] = text[i].replaceAll("）","括号");
            text[i] = text[i].replaceAll("：","冒号");
            text[i] = text[i].replaceAll("“","引号");
            text[i] = text[i].replaceAll("”","引号");
        }
    }
}
